<!doctype html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head>
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hello, World" />





  <link rel="alternate" href="/atom.xml" title="Dare To Think, Strive To Execute" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta property="og:type" content="website">
<meta property="og:title" content="Dare To Think, Strive To Execute">
<meta property="og:url" content="http://yoursite.com/index.html">
<meta property="og:site_name" content="Dare To Think, Strive To Execute">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Dare To Think, Strive To Execute">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/"/>





  <title> Dare To Think, Strive To Execute </title><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <!-- hexo-inject:begin --><!-- hexo-inject:end --><div class="container one-collumn sidebar-position-left 
   page-home 
 ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Dare To Think, Strive To Execute</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-sitemap">
          <a href="/sitemap.xml" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-sitemap"></i> <br />
            
            Sitemap
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            
  <section id="posts" class="posts-expand">
    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2017/03/13/Google-Girl-Hackthon/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="Li Ping">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Dare To Think, Strive To Execute">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Dare To Think, Strive To Execute" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2017/03/13/Google-Girl-Hackthon/" itemprop="url">
                  Google Girl Hackthon
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-03-13T18:58:10+08:00">
                2017-03-13
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="google-girl-hackthon"><a href="#google-girl-hackthon" class="headerlink" title="google girl hackthon"></a>google girl hackthon</h1><p>&#x2003;&#x2003;&#x82B1;&#x4E86;&#x4E24;&#x5929;&#x7684;&#x65F6;&#x95F4;&#x53C2;&#x52A0;&#x4E86;&#x8C37;&#x6B4C;&#x7684;&#x4E00;&#x4E2A;&#x4E3A;&#x4E86;&#x9F13;&#x52B1;&#x5973;&#x751F;coding&#x7684;&#x7F16;&#x7A0B;&#x9A6C;&#x62C9;&#x677E;&#xFF0C;&#x611F;&#x89E6;&#x8FD8;&#x662F;&#x633A;&#x6DF1;&#x7684;&#x3002;&#x5373;&#x4F7F;&#x77E5;&#x4E4E;&#x4E0A;&#x725B;&#x4EBA;&#x518D;&#x591A;&#xFF0C;&#x624B;&#x673A;&#x4E0A;&#x5929;&#x5929;&#x90FD;&#x80FD;&#x542C;&#x5230;&#x738B;&#x5065;&#x6797;&#x9A6C;&#x4E91;&#x9F13;&#x52B1;&#x5E74;&#x8F7B;&#x4EBA;&#x7684;&#x9E21;&#x6C64;&#xFF0C;&#x5373;&#x4FBF;&#x6BCF;&#x5929;&#x516C;&#x4F17;&#x53F7;&#x5404;&#x79CD;&#x6B63;&#x80FD;&#x91CF;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x5E26;&#x7ED9;&#x6211;&#x7684;&#x89E6;&#x52A8;&#x8FDC;&#x4E0D;&#x53CA;&#x9762;&#x5BF9;&#x9762;&#x770B;&#x5230;&#x4E00;&#x7FA4;&#x667A;&#x6167;&#x4F18;&#x96C5;&#x624D;&#x534E;&#x6A2A;&#x6EA2;&#x7684;&#x5973;&#x5DE5;&#x7A0B;&#x5E08;&#x7ED9;&#x6211;&#x7684;&#x89E6;&#x52A8;&#x5927;&#x3002;</p>
<p>&#x2003;&#x2003;&#x53C2;&#x52A0;&#x8FD9;&#x4E2A;&#x7684;&#x65F6;&#x5019;&#x5355;&#x7EAF;&#x662F;&#x51B2;&#x7740;&#x8C37;&#x6B4C;&#x7684;&#x98DF;&#x5802;&#x53BB;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x5DE5;&#x4F5C;&#x4E5F;&#x627E;&#x4E86;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x5956;&#x54C1;&#x4EE5;&#x53CA;&#x5B9E;&#x4E60;&#x5BF9;&#x6211;&#x6765;&#x8BB2;&#x8981;&#x4E48;&#x6CA1;&#x6709;&#x5438;&#x5F15;&#x529B;&#x8981;&#x4E48;&#x4E5F;&#x6CA1;&#x5F88;&#x5927;&#x7684;&#x610F;&#x4E49;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x6211;&#x6536;&#x83B7;&#x4E86;&#x6BD4;&#x60F3;&#x8C61;&#x7684;&#x66F4;&#x591A;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5148;&#x653E;&#x51E0;&#x5F20;&#x6211;&#x4EEC;&#x7684;&#x7167;&#x7247;</p>
<p><img src="../images/hackthon1.jpeg" width="400" height="300" alt="name" align="center"></p>
<p><img src="../images/hackthon2.jpeg" width="400" height="300" alt="name" align="center"></p>
<h1 id="&#x6700;&#x6709;&#x611F;&#x89E6;&#x7684;&#x8BDD;"><a href="#&#x6700;&#x6709;&#x611F;&#x89E6;&#x7684;&#x8BDD;" class="headerlink" title="&#x6700;&#x6709;&#x611F;&#x89E6;&#x7684;&#x8BDD;"></a>&#x6700;&#x6709;&#x611F;&#x89E6;&#x7684;&#x8BDD;</h1><p>&#x2003;&#x2003;&#x65F6;&#x95F4;&#x4E0D;&#x80FD;&#x5012;&#x6D41;&#xFF0C;&#x90A3;&#x4E9B;&#x5E74;&#x9519;&#x8FC7;&#x7684;&#x5927;&#x4F5C;&#x4E1A;&#xFF0C;&#x90A3;&#x4E9B;&#x5E74;&#x9519;&#x8FC7;&#x7684;Project&#xFF0C;&#x8FD8;&#x6709;&#x90A3;&#x4E9B;&#x5E74;&#x62A5;&#x8FC7;&#x7684;&#x5927;&#x817F;&#xFF0C;&#x60F3;&#x60F3;&#x90FD;&#x662F;&#x8BA9;&#x4EBA;&#x54ED;&#x7B11;&#x4E0D;&#x5F97;&#x7684;&#x4E8B;&#x513F;&#xFF0C;&#x662F;&#x6211;&#x628A;&#x5927;&#x5B66;&#x8BFB;&#x7684;&#x592A;&#x8F7B;&#x677E;&#x4E86;&#xFF0C;&#x4E5F;&#x662F;&#x592A;&#x770B;&#x4E0D;&#x8D77;&#x81EA;&#x5DF1;&#x4E86;&#x3002;&#x6211;&#x4E0D;&#x592A;&#x6E05;&#x695A;&#x540C;&#x6837;&#x53C2;&#x52A0;&#x8FD9;&#x4E2A;&#x6D3B;&#x52A8;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x4EC0;&#x4E48;&#x611F;&#x53D7;&#xFF0C;&#x4F46;&#x662F;&#x542C;&#x4E86;&#x51E0;&#x4E2A;&#x5973;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x771F;&#x662F;&#x975E;&#x5E38;&#x89E6;&#x52A8;&#x3002;&#x5176;&#x4E2D;&#x6700;&#x8BA9;&#x6211;&#x96BE;&#x5FD8;&#x4E5F;&#x662F;&#x6700;&#x8BA9;&#x6211;&#x6DF1;&#x601D;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x662F;<br>&gt;</p>
<blockquote>
<p>&#x4E0D;&#x8981;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x5973;&#x5B69;&#x770B;<br>&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x5973;&#x5B69;&#x770B;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x6240;&#x8C13;&#x201C;&#x4E0D;&#x8981;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x5973;&#x5B69;&#x770B;&#x201D;&#x662F;&#x8BF4;&#x4E0D;&#x8981;&#x603B;&#x7528;&#x4F4E;&#x6807;&#x51C6;&#x6765;&#x8981;&#x6C42;&#x81EA;&#x5DF1;&#xFF0C;&#x6211;&#x5927;&#x5B66;&#x671F;&#x95F4;&#x4E0D;&#x4E4F;&#x6210;&#x7EE9;&#x4F18;&#x5F02;&#x7684;&#x5973;&#x540C;&#x5B66;&#xFF0C;&#x4F46;&#x662F;&#x8BF4;&#x5230;&#x52A8;&#x624B;&#x80FD;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x90FD;&#x4E0D;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x800C;&#x4E14;&#x957F;&#x671F;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5373;&#x4F7F;&#x662F;&#x52A8;&#x624B;&#x5728;&#x5973;&#x751F;&#x4E2D;&#x4E5F;&#x4E0D;&#x5DEE;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x6CA1;&#x6709;&#x52A8;&#x529B;&#x8D85;&#x8D8A;&#x81EA;&#x5DF1;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6280;&#x672F;&#x4E0A;&#x8FDB;&#x6B65;&#x975E;&#x5E38;&#x7F13;&#x6162;&#xFF0C;&#x751A;&#x81F3;&#x5F88;&#x591A;&#x5230;&#x4E86;&#x6700;&#x540E;&#x5C31;&#x81EA;&#x66B4;&#x81EA;&#x5F03;&#x4E86;&#x3002;&#x800C;&#x6211;&#x6CA1;&#x6709;&#x653E;&#x5F03;&#x80AF;&#x5B9A;&#x662F;&#x56E0;&#x4E3A;&#x65E2;&#x6CA1;&#x6709;&#x9000;&#x8DEF;&#x53C8;&#x6CA1;&#x6709;&#x4F9D;&#x9760;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6709;&#x4E00;&#x4E2A;&#x7F8E;&#x5973;&#x5DE5;&#x7A0B;&#x5E08;&#x4E5F;&#x8BB2;&#x5230;&#x5F53;&#x81EA;&#x5DF1;&#x7855;&#x58EB;&#x9636;&#x6BB5;&#x4E0D;&#x662F;&#x5408;&#x4F5C;&#x5199;&#x5927;&#x4F5C;&#x4E1A;&#x800C;&#x662F;&#x9700;&#x8981;&#x72EC;&#x7ACB;&#x5B8C;&#x6210;project&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x81EA;&#x5DF1;&#x72EC;&#x7ACB;&#x80FD;handle&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x73B0;&#x539F;&#x6765;&#x5199;&#x4EE3;&#x7801;&#x4EC0;&#x4E48;&#x7684;&#x4E5F;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x96BE;&#x561B;&#xFF0C;&#x81EA;&#x5DF1;&#x5176;&#x5B9E;&#x6BD4;&#x60F3;&#x8C61;&#x7684;&#x80FD;&#x5E72;&#x5F88;&#x591A;&#x3002;&#x5F53;&#x81EA;&#x5DF1;&#x603B;&#x662F;&#x6709;&#x5F88;&#x591A;&#x9000;&#x8DEF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C24;&#x5176;&#x90A3;&#x4E9B;&#x9000;&#x8DEF;&#x90A3;&#x4E48;&#x663E;&#x800C;&#x6613;&#x89C1;&#xFF0C;&#x4E00;&#x65E6;&#x5B66;&#x4F1A;&#x4E86;&#x62FF;&#x90A3;&#x4E9B;&#x201C;&#x5973;&#x751F;&#x5DE5;&#x7A0B;&#x4E0D;&#x884C;&#x201D;&#x7684;&#x5957;&#x8DEF;&#x4E3A;&#x81EA;&#x5DF1;&#x5F00;&#x8131;&#xFF0C;&#x6162;&#x6162;&#x5C31;&#x6D88;&#x78E8;&#x4E86;&#x514B;&#x670D;&#x56F0;&#x96BE;&#x7684;&#x52A8;&#x529B;&#x3002;&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#xFF0C;&#x6211;&#x52AA;&#x529B;&#x514B;&#x670D;&#x7740;&#x81EA;&#x5DF1;&#x8EAB;&#x4E0A;&#x7684;&#x574F;&#x6BDB;&#x75C5;&#xFF0C;&#x4E00;&#x6B65;&#x6B65;&#x5C3D;&#x529B;&#x6210;&#x4E3A;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x7684;&#x6837;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x81EA;&#x8BA4;&#x4E3A;&#x6CA1;&#x6709;&#x5929;&#x8D4B;&#xFF0C;&#x6CA1;&#x6709;&#x624D;&#x534E;&#xFF0C;&#x751A;&#x81F3;&#x4E5F;&#x4E0D;&#x591F;&#x806A;&#x660E;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x7F16;&#x7A0B;&#x6211;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x5165;&#x9053;&#xFF0C;&#x975E;&#x5E38;&#x7684;&#x6CAE;&#x4E27;&#xFF0C;&#x5018;&#x82E5;&#x6709;&#x9000;&#x8DEF;&#x548C;&#x5176;&#x4ED6;&#x9009;&#x62E9;&#x6211;&#x80AF;&#x5B9A;&#x4E5F;&#x65E9;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#x3002;&#x539F;&#x672C;&#x5F88;&#x591A;&#x6280;&#x80FD;&#x7684;&#x83B7;&#x5F97;&#x90FD;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x8F7B;&#x677E;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x73B0;&#x5728;&#x60F3;&#x60F3;&#x652F;&#x6301;&#x6211;&#x8D70;&#x8FC7;&#x5F88;&#x591A;&#x56F0;&#x5883;&#x7684;&#x4E5F;&#x4E0D;&#x8FC7;&#x662F;&#x65E0;&#x4EBA;&#x53EF;&#x4F9D;&#x65F6;&#x7684;&#x987D;&#x5F3A;&#x3002;&#x4E0D;&#x903C;&#x81EA;&#x5DF1;&#x4E00;&#x628A;&#xFF0C;&#x6211;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x539F;&#x6765;&#x53EF;&#x4EE5;&#x4E00;&#x76F4;&#x8D70;&#x8FD9;&#x4E48;&#x8FDC;&#xFF0C;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x6211;&#x514B;&#x670D;&#x4E86;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x6000;&#x7591;&#x4EE5;&#x53CA;&#x5BF9;&#x5DE5;&#x7A0B;&#x7684;&#x6050;&#x60E7;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6240;&#x8C13;&#x201C;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x4E2A;&#x5973;&#x5B69;&#x201D;&#x662F;&#x8BF4;&#x8981;&#x53D1;&#x6325;&#x597D;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x6C14;&#x8D28;&#x8FD8;&#x662F;&#x98CE;&#x683C;&#xFF0C;&#x5973;&#x751F;&#x786E;&#x5B9E;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x5018;&#x82E5;&#x4E00;&#x4E2A;&#x4EBA;&#x5916;&#x5728;&#x4E3E;&#x6B62;&#x6295;&#x8DB3;&#x4F18;&#x96C5;&#x5927;&#x65B9;&#xFF0C;&#x58F0;&#x97F3;&#x60A6;&#x8033;&#x8868;&#x60C5;&#x81EA;&#x4FE1;&#xFF0C;&#x5FC3;&#x601D;&#x4F53;&#x8D34;&#x7EC6;&#x817B;&#xFF0C;&#x6027;&#x683C;&#x5F00;&#x6717;&#x5E7D;&#x9ED8;&#xFF0C;&#x6709;&#x60F3;&#x6CD5;&#xFF0C;&#x6709;&#x80FD;&#x529B;&#xFF0C;&#x6709;&#x89C1;&#x8BC6;&#xFF0C;&#x8BBA;&#x8C01;&#x8DDF;&#x5979;&#x6253;&#x4EA4;&#x9053;&#x90FD;&#x4F1A;&#x5982;&#x6C90;&#x6625;&#x98CE;&#x7684;&#x5427;&#xFF1F;&#x5F53;&#x6211;&#x8D8A;&#x6765;&#x8D8A;&#x610F;&#x8BC6;&#x5230;&#x4F18;&#x79C0;&#x7684;&#x591A;&#x5143;&#x4EE5;&#x540E;&#xFF0C;&#x4E5F;&#x6108;&#x53D1;&#x4F53;&#x4F1A;&#x5230;&#x8FD9;&#x4E9B;&#x8F6F;&#x5B9E;&#x529B;&#x7684;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x2003;&#x2003;&#x60F3;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x60F3;&#x505A;&#x6210;&#x5B83;&#x7684;&#x613F;&#x671B;&#xFF0C;&#x800C;&#x60F3;&#x505A;&#x597D;&#x4E00;&#x4EF6;&#x4E8B;&#x5219;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7ED9;&#x81EA;&#x5DF1;&#x9884;&#x8BBE;&#x7684;&#x6807;&#x51C6;&#x3002;&#x4E00;&#x76F4;&#x90FD;&#x5F88;&#x559C;&#x6B22;&#x90A3;&#x53E5;&#x8BDD;&#xFF0C;&#x201D;&#x6C42;&#x4E8E;&#x4E0A;&#x8005;&#x5F97;&#x4E8E;&#x4E2D;&#xFF0C;&#x6C42;&#x4E8E;&#x4E2D;&#x8005;&#x5F97;&#x4E8E;&#x4E0B;&#x201D;&#x3002;</p>
<ul>
<li><p>&#x6807;&#x51C6;&#x8DDF;&#x81EA;&#x5DF1;&#x7684;&#x89C6;&#x91CE;&#xFF0C;&#x89C2;&#x5FF5;&#x4EE5;&#x53CA;&#x81EA;&#x4FE1;&#x621A;&#x621A;&#x76F8;&#x5173;&#xFF0C;&#x6807;&#x51C6;&#x600E;&#x4E48;&#x4E5F;&#x4E0D;&#x4F1A;&#x9AD8;&#x4E8E;&#x699C;&#x6837;&#xFF0C;&#x6709;&#x51E0;&#x4E2A;&#x4EBA;&#x80FD;&#x53D8;&#x5F97;&#x6BD4;&#x81EA;&#x5DF1;&#x7684;&#x699C;&#x6837;&#x8FD8;&#x597D;&#x5462;&#xFF1F;&#x800C;&#x4E14;&#x9762;&#x5BF9;&#x9762;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x8DDF;&#x81EA;&#x5DF1;&#x6709;&#x76F8;&#x540C;&#x7ECF;&#x5386;&#x7684;&#x4EBA;&#x987F;&#x65F6;&#x5C31;&#x6709;&#x4E86;&#x699C;&#x6837;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x6B21;&#x6D3B;&#x52A8;&#x5C31;&#x8BA9;&#x6211;&#x610F;&#x8BC6;&#x5230;&#x539F;&#x6765;&#x5973;&#x5DE5;&#x7A0B;&#x5E08;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x4F18;&#x79C0;&#x5982;&#x6B64;&#x800C;&#x4E14;&#x4EBA;&#x6570;&#x4E0D;&#x5C11;&#xFF1B;&#x81F3;&#x4E8E;&#x89C2;&#x5FF5;&#xFF0C;&#x5018;&#x82E5;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x88AB;&#x90A3;&#x53E5;&#x201C;&#x7537;&#x5DE5;&#x7A0B;&#x5E08;&#x5C31;&#x662F;&#x6BD4;&#x5973;&#x7A0B;&#x5E8F;&#x5458;&#x4F18;&#x79C0;&#x201D;&#x5F71;&#x54CD;&#xFF0C;&#x6211;&#x5E94;&#x8BE5;&#x4E5F;&#x4F1A;&#x4EE5;&#x66F4;&#x9AD8;&#x7684;&#x6807;&#x51C6;&#x8981;&#x6C42;&#x81EA;&#x5DF1;&#xFF0C;&#x518D;&#x8BF4;&#x81EA;&#x4FE1;&#xFF0C;&#x81EA;&#x4FE1;&#x662F;&#x81EA;&#x5DF1;&#x5728;&#x81EA;&#x5DF1;&#x89C1;&#x8BC6;&#x591A;&#x4E86;&#x4F18;&#x79C0;&#x4E14;&#x6392;&#x9664;&#x4E86;&#x65E0;&#x5173;&#x6742;&#x5FF5;&#x540E;&#x4E00;&#x6B65;&#x6B65;&#x4ECE;&#x5FC3;&#x5E95;&#x91CC;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x8BA4;&#x540C;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4E3B;&#x52A8;&#x627F;&#x62C5;&#x8D23;&#x4EFB;&#x4E5F;&#x5BB9;&#x6613;&#x8BA9;&#x81EA;&#x5DF1;&#x63D0;&#x9AD8;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x56E0;&#x4E3A;&#x8F9C;&#x8D1F;&#x81EA;&#x5DF1;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x8F9C;&#x8D1F;&#x522B;&#x4EBA;&#x5F88;&#x4E0D;&#x597D;&#x610F;&#x601D;&#xFF0C;&#x5F53;&#x7136;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x8FD8;&#x4E0D;&#x591F;&#x4E0D;&#x8981;&#x8138;&#x3002;&#x5BF9;&#x4E8E;&#x6807;&#x51C6;&#x7684;&#x611F;&#x53D7;&#x7B80;&#x76F4;&#x4E0D;&#x8981;&#x66F4;&#x591A;&#xFF0C;&#x5927;&#x5B66;&#x6211;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x5973;&#x751F;&#x4E2D;&#x611F;&#x89C9;&#x826F;&#x597D;&#xFF0C;&#x6446;&#x8131;&#x4E0D;&#x4E86;&#x6027;&#x522B;&#x8D28;&#x7591;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x73ED;&#x4E0A;&#x5927;&#x817F;&#x7ED9;&#x6211;&#x7559;&#x4E86;&#x4E0D;&#x5C11;&#x540E;&#x8DEF;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x800C;&#x518D;&#x5730;&#x964D;&#x4F4E;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x8981;&#x6C42;&#x3002;&#x9898;&#x5916;&#x8BDD;&#x662F;&#x60F3;&#x8D77;&#x4E86;&#x66FE;&#x7ECF;&#x4E00;&#x4E2A;&#x5E08;&#x5F1F;&#x8BF4;&#x7684;&#x4E00;&#x53E5;&#x8BDD;<br>&gt;</p>
<blockquote>
<p>&#x60F3;&#x9003;&#x907F;&#x7684;&#x4E8B;&#xFF0C;&#x7EC8;&#x7A76;&#x662F;&#x8981;&#x9762;&#x5BF9;&#x548C;&#x89E3;&#x51B3;&#x7684;<br>&#x6211;&#x60F3;&#x8BF4;&#xFF0C;&#x53EF;&#x80FD;&#x72AF;&#x7684;&#x9519;&#x8BEF;&#x65E9;&#x665A;&#x90FD;&#x4F1A;&#x72AF;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x72AF;&#x9519;&#x4E5F;&#x8981;&#x8D81;&#x65E9;<br>&#x6BD5;&#x7ADF;&#x8D8A;&#x665A;&#x65F6;&#x95F4;&#x6210;&#x672C;&#x8D8A;&#x9AD8;<br>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x6B20;&#x4E0B;&#x7684;&#x90FD;&#x4F1A;&#x8FD8;&#x7684;</p>
</blockquote>
</li>
<li><p>&#x518D;&#x8BF4;&#x52AA;&#x529B;&#xFF0C;&#x6211;&#x5F53;&#x7136;&#x4E0D;&#x662F;&#x552F;&#x5FC3;&#x4E3B;&#x4E49;&#x8005;&#xFF0C;&#x4F46;&#x662F;&#x201C;&#x5FF5;&#x5FF5;&#x4E0D;&#x5FD8;&#xFF0C;&#x5FC5;&#x6709;&#x56DE;&#x54CD;&#x201D;&#x7684;&#x611F;&#x53D7;&#x6211;&#x8FD8;&#x662F;&#x633A;&#x8BA4;&#x540C;&#x7684;&#xFF0C;&#x6211;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x5927;&#x90E8;&#x5206;&#x7684;&#x61C8;&#x6020;&#x90FD;&#x53D1;&#x751F;&#x5728;&#x81EA;&#x5DF1;&#x6CA1;&#x90A3;&#x4E48;&#x5F3A;&#x70C8;&#x505A;&#x7684;&#x613F;&#x671B;&#x6216;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x6709;&#x6240;&#x6000;&#x7591;&#x6216;&#x8005;&#x6709;&#x7740;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x9000;&#x8DEF;&#x7684;&#x65F6;&#x5019;&#x3002;&#x4E0D;&#x8FC7;&#x5F3A;&#x70C8;&#x505A;&#x6210;&#x4E00;&#x4EF6;&#x4E8B;&#x7684;&#x613F;&#x671B;&#x4E5F;&#x4F1A;&#x8DDF;&#x4E0E;&#x8FD9;&#x4EF6;&#x4E8B;&#x76F8;&#x9047;&#x7684;&#x60C5;&#x666F;&#x6709;&#x5173;&#xFF0C;&#x5F53;&#x7136;&#x60C5;&#x666F;&#x662F;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EE5;&#x524D;&#x542C;&#x4E86;&#x90A3;&#x4E48;&#x591A;word2vector&#x90FD;&#x4E0D;&#x4E3A;&#x6240;&#x52A8;&#xFF0C;&#x5F53;&#x6211;&#x4EB2;&#x773C;&#x89C1;&#x5230;&#x5B83;&#x4EE4;&#x4EBA;&#x9707;&#x64BC;&#x7684;&#x6A21;&#x578B;&#x6548;&#x679C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4F1A;&#x60C5;&#x4E0D;&#x81EA;&#x7981;&#x60F3;&#x53BB;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x5B83;&#x3002;</p>
</li>
</ul>
<p>&#x2003;&#x2003;&#x8FD9;&#x6B21;&#x6D3B;&#x52A8;&#x867D;&#x7136;&#x53EA;&#x5728;&#x8C37;&#x6B4C;&#x5403;&#x4E86;&#x4E00;&#x987F;&#x996D;&#xFF0C;&#x4F46;&#x662F;&#x4ECD;&#x7136;&#x5F88;&#x611F;&#x6FC0;&#x8FD9;&#x4E48;&#x6709;&#x60C5;&#x6000;&#x7684;&#x516C;&#x53F8;&#x3002;&#x6240;&#x8C13;&#x201C;&#x7A77;&#x5219;&#x72EC;&#x5584;&#x5176;&#x8EAB;&#xFF0C;&#x8FBE;&#x5219;&#x517C;&#x6D4E;&#x5929;&#x4E0B;&#x201D;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#x9053;&#x7406;&#x7684;&#xFF0C;&#x770B;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x7684;&#x5BF9;&#x4EBA;&#x624D;&#x7684;&#x6001;&#x5EA6;&#x770B;&#x5176;&#x60C5;&#x6000;&#x8FD8;&#x662F;&#x6709;&#x9053;&#x7406;&#x7684;&#x3002;&#x867D;&#x7136;&#x538B;&#x69A8;&#x5458;&#x5DE5;&#x662F;&#x8D44;&#x672C;&#x4E3B;&#x4E49;&#x7684;&#x5929;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x517C;&#x6D4E;&#x5929;&#x4E0B;&#x7684;&#x516C;&#x53F8;&#x60F3;&#x5FC5;&#x5BF9;&#x81EA;&#x5DF1;&#x5458;&#x5DE5;&#x7684;&#x53D1;&#x5C55;&#x8003;&#x8651;&#x7684;&#x4E5F;&#x4E0D;&#x4F1A;&#x5C11;&#x3002;&#x6069;&#xFF0C;&#x6CA1;&#x9519;&#x6211;&#x5C31;&#x662F;&#x5728;&#x89E3;&#x91CA;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x613F;&#x610F;&#x53BB;&#x5FAE;&#x8F6F;&#xFF0C;&#x5E0C;&#x671B;&#x5230;&#x65F6;&#x5019;&#x6211;&#x4E5F;&#x80FD;&#x9047;&#x5230;&#x4E00;&#x5E2E;&#x5F88;&#x4F18;&#x79C0;&#x7684;&#x540C;&#x4E8B;&#x3002;</p>
<h2 id="&#x6536;&#x83B7;"><a href="#&#x6536;&#x83B7;" class="headerlink" title="&#x6536;&#x83B7;"></a>&#x6536;&#x83B7;</h2><p>&#x2003;&#x2003;&#x6536;&#x83B7;&#x4E3B;&#x8981;&#x6709;&#x4E8C;</p>
<ul>
<li>&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x7F3A;&#x61BE;&#x8DDF;&#x80FD;&#x529B;&#x6709;&#x4E86;&#x66F4;&#x52A0;&#x6E05;&#x9192;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x7406;&#x6027;&#x6709;&#x4F59;&#xFF0C;&#x611F;&#x6027;&#x4E0D;&#x8DB3;&#xFF0C;&#x4E25;&#x8C28;&#x4F46;&#x4E0D;&#x591F;&#x6709;&#x8DA3;&#xFF1B;</li>
<li>&#x4EB2;&#x8EAB;&#x611F;&#x53D7;&#x4E86;&#x591A;&#x7EF4;&#x7684;&#x4F18;&#x79C0;&#xFF0C;&#x73B0;&#x5728;&#x73AF;&#x5883;&#x6BD5;&#x7ADF;&#x7B80;&#x5355;&#xFF0C;&#x6211;&#x9876;&#x591A;&#x4F1A;&#x89C9;&#x5F97;&#x4E00;&#x4E2A;&#x4EBA;&#x4EE3;&#x7801;&#x5199;&#x7684;&#x597D;&#x4F69;&#x670D;&#xFF0C;&#x8BBA;&#x6587;&#x53D1;&#x7684;&#x591A;&#x53D1;&#x7684;&#x725B;&#x94A6;&#x4F69;&#xFF0C;&#x4E3A;&#x4EBA;&#x505A;&#x4E8B;&#x597D;&#x8BA9;&#x4EBA;&#x7FA1;&#x6155;&#xFF1B;&#x5F53;&#x6211;&#x770B;&#x5230;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#x59B9;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5DE5;&#x7A0B;&#x5E08;&#x8FD8;&#x662F;&#x8DDF;&#x6211;&#x4E00;&#x6837;&#x7684;&#x53C2;&#x52A0;&#x6D3B;&#x52A8;&#x7684;&#x7AE5;&#x978B;&#xFF0C;&#x6211;&#x610F;&#x8BC6;&#x5230;&#x5979;&#x4EEC;&#x7684;&#x4F18;&#x79C0;&#x662F;&#x90A3;&#x4E48;&#x591A;&#x5143;&#x3002;&#x6709;&#x7684;&#x662F;&#x5E74;&#x7EAA;&#x8F7B;&#x8F7B;&#x5BF9;&#x81EA;&#x5DF1;&#x672A;&#x6765;&#x90A3;&#x4E48;&#x575A;&#x5B9A;&#x90A3;&#x4E48;&#x6709;&#x68A6;&#x60F3;&#xFF0C;&#x6709;&#x7684;&#x8868;&#x8FBE;&#x81EA;&#x5982;&#x8C08;&#x7B11;&#x98CE;&#x751F;&#xFF0C;&#x6709;&#x7684;&#x63D0;&#x95EE;&#x9898;&#x5C16;&#x9510;&#x6709;&#x6DF1;&#x5EA6;&#xFF0C;&#x6709;&#x7684;&#x601D;&#x7EF4;&#x7F1C;&#x5BC6;&#x8BA4;&#x771F;&#x8D1F;&#x8D23;&#xFF0C;&#x6709;&#x7684;&#x59B9;&#x5B50;&#x98CE;&#x8DA3;&#x5E7D;&#x9ED8;&#xFF0C;&#x505A;&#x5C55;&#x793A;&#x975E;&#x5E38;&#x6709;&#x611F;&#x67D3;&#x529B;&#xFF0C;&#x6709;&#x7684;&#x7EC6;&#x817B;&#x6E29;&#x5A49;&#xFF0C;&#x751F;&#x6D3B;&#x7CBE;&#x81F4;&#xFF0C;&#x8FD8;&#x6709;&#x7684;&#x82F1;&#x8BED;&#x4E00;&#x7EA7;&#x68D2;&#x3002;</li>
</ul>
<h2 id="&#x53CD;&#x601D;"><a href="#&#x53CD;&#x601D;" class="headerlink" title="&#x53CD;&#x601D;"></a>&#x53CD;&#x601D;</h2><p>&#x2003;&#x2003;&#x8BF4;&#x5B8C;&#x4E86;&#x611F;&#x53D7;&#xFF0C;&#x518D;&#x8BF4;&#x4E00;&#x8BF4;&#x81EA;&#x5DF1;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x53CD;&#x601D;&#x3002;</p>
<ul>
<li>&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6446;&#x8131;&#x4E0D;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x504F;&#x89C1;&#xFF0C;&#x89C9;&#x5F97;&#x6280;&#x672F;&#x725B;&#x624D;&#x503C;&#x5F97;&#x94A6;&#x4F69;&#x3002;&#x8FD9;&#x4E2A;&#x6211;&#x6628;&#x665A;&#x4E5F;&#x8DDF;&#x5BA4;&#x53CB;&#x63A2;&#x8BA8;&#x8FC7;&#xFF0C;&#x6280;&#x672F;&#x725B;&#x5F53;&#x7136;&#x503C;&#x5F97;&#x94A6;&#x4F69;&#xFF0C;&#x4F46;&#x662F;&#x6280;&#x672F;&#x4EC5;&#x4EC5;&#x662F;&#x63A8;&#x52A8;&#x793E;&#x4F1A;&#x524D;&#x8FDB;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x529B;&#x91CF;&#xFF0C;&#x8131;&#x79BB;&#x4E86;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#x8FD0;&#x8425;&#x7B49;&#x5176;&#x5F71;&#x54CD;&#x529B;&#x5341;&#x5206;&#x6709;&#x9650;&#x3002;&#x60F3;&#x8D77;&#x6765;&#x9AD8;&#x4E2D;&#x4EE5;&#x524D;&#x7684;&#x81EA;&#x5DF1;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5728;&#x81EA;&#x5DF1;&#x6267;&#x7740;&#x8FFD;&#x9010;&#x5206;&#x6570;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x7F3A;&#x4E4F;&#x4E86;&#x5BF9;&#x5176;&#x4ED6;&#x7D20;&#x517B;&#x7684;&#x9274;&#x522B;&#x4E0E;&#x6B23;&#x8D4F;&#x3002;</li>
<li>&#x505A;&#x8FC7;presentation&#x8D8A;&#x591A;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x4E86;&#x89E3;&#x5230;&#x8868;&#x73B0;&#x80FD;&#x529B;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x4E0D;&#x7F3A;&#x628A;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x8868;&#x8FBE;&#x6E05;&#x695A;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x662F;&#x81EA;&#x5DF1;&#x5F88;&#x7F3A;&#x8868;&#x73B0;&#x529B;&#x8DDF;&#x611F;&#x67D3;&#x529B;&#x3002;&#x4FE1;&#x606F;&#x4F20;&#x9012;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x56E0;&#x4E3A;&#x8868;&#x73B0;&#x529B;&#x8DDF;&#x611F;&#x67D3;&#x529B;&#x4E0D;&#x4F73;&#x5BFC;&#x81F4;&#x5F88;&#x591A;&#x4FE1;&#x606F;&#x4E22;&#x5931;&#xFF0C;&#x60F3;&#x8C61;&#x4E0B;&#x81EA;&#x5DF1;&#x7ECF;&#x5E38;&#x4F5C;&#x4E3A;&#x53F0;&#x4E0B;&#x7684;&#x89C2;&#x4F17;&#x542C;&#x4E1C;&#x897F;&#x7684;&#x72B6;&#x6001;&#x540E;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x60C5;&#x4E0D;&#x81EA;&#x7981;&#x5730;&#x7B11;&#x4E86;&#x8D77;&#x6765;&#x3002;</li>
<li>&#x7406;&#x6027;&#x6709;&#x4F59;&#xFF0C;&#x611F;&#x6027;&#x4E0D;&#x8DB3;&#x3002;&#x6000;&#x7591;&#x81EA;&#x5DF1;&#x662F;&#x4E0D;&#x662F;&#x5F88;&#x5446;&#x677F;&#x4E4F;&#x5473;&#xFF0C;&#x54C8;&#x54C8;&#x3002;</li>
</ul>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>&#x2003;&#x2003;&#x90FD;&#x662F;&#x8001;&#x751F;&#x957F;&#x8C08;&#xFF0C;&#x8BF4;&#x4E0D;&#x4E0A;&#x610F;&#x8BC6;&#x5230;&#x4E86;&#x95EE;&#x9898;&#x5C31;&#x80FD;&#x6539;&#x7684;&#x5F88;&#x5F7B;&#x5E95;&#xFF0C;&#x597D;&#x6B79;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x603B;&#x7ED3;&#xFF0C;&#x6211;&#x5F88;&#x5F00;&#x5FC3;&#x81EA;&#x5DF1;&#x80FD;&#x5728;&#x5165;&#x804C;&#x4E4B;&#x524D;&#x601D;&#x8003;&#x4E86;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5199;&#x51FA;&#x6765;&#x4E00;&#x662F;&#x4E3A;&#x4E86;&#x7EAA;&#x5FF5;&#xFF0C;&#x4E8C;&#x662F;&#x6574;&#x7406;&#x4E0B;&#x601D;&#x8DEF;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x54EA;&#x5929;&#x81EA;&#x5DF1;&#x770B;&#x7684;&#x4E5F;&#x4E3A;&#x50CF;&#x674E;&#x552F;&#x5E08;&#x59D0;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x89C9;&#x5F97;&#x5F53;&#x521D;&#x7684;&#x81EA;&#x5DF1;&#x90A3;&#x4E48;&#x50BB;&#x90A3;&#x4E48;&#x6709;&#x610F;&#x601D;&#x3002;</p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2016/12/06/NMF实现/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="Li Ping">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Dare To Think, Strive To Execute">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Dare To Think, Strive To Execute" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/12/06/NMF实现/" itemprop="url">
                  Nonnegative Matrix Factorization(NMF)实现
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-12-06T15:05:48+08:00">
                2016-12-06
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="nmf&#x5E94;&#x7528;&#x573A;&#x666F;"><a href="#NMF&#x5E94;&#x7528;&#x573A;&#x666F;" class="headerlink" title="NMF&#x5E94;&#x7528;&#x573A;&#x666F;"></a>NMF&#x5E94;&#x7528;&#x573A;&#x666F;</h1><h2 id="&#x63A8;&#x8350;"><a href="#&#x63A8;&#x8350;" class="headerlink" title="&#x63A8;&#x8350;"></a>&#x63A8;&#x8350;</h2><p>&#x2003;&#x2003;&#x5728;&#x63A8;&#x8350;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x7528;&#x6237;&#x4EE5;&#x53CA;&#x5546;&#x54C1;&#x7684;&#x5386;&#x53F2;&#x5173;&#x7CFB;&#x76F8;&#x5F53;&#x4E8E;&#x5927;&#x578B;&#x7684;&#x77E9;&#x9635;&#xFF0C;&#x5206;&#x89E3;&#x540E;&#x7684;&#x77E9;&#x9635;W&#x4EE5;&#x53CA;H&#x53EF;&#x4EE5;&#x770B;&#x6210;&#x7528;&#x6237;&#x4EE5;&#x53CA;&#x5546;&#x54C1;&#x5728;&#x5174;&#x8DA3;&#x7EF4;&#x5EA6;&#x7684;&#x8868;&#x8FBE;&#xFF0C;&#x6839;&#x636E;&#x5206;&#x89E3;&#x540E;&#x7684;&#x77E9;&#x9635;&#x53EF;&#x4EE5;&#x9884;&#x6D4B;&#x672A;&#x77E5;&#x7684;&#x7528;&#x6237;&#x5546;&#x54C1;&#x7684;&#x6253;&#x5206;&#x60C5;&#x51B5;&#x3002;&#x5728;Netflix&#x7ADE;&#x8D5B;&#x4E2D;&#xFF0C; Bellkor&#x2019;s Pragmatic Chaos &#x91C7;&#x7528;&#x8BE5;&#x7B97;&#x6CD5;&#x53D6;&#x5F97;&#x4E86; RMSE&#xFF1A; 0.856704&#x7684;&#x597D;&#x6210;&#x7EE9;&#xFF0C;&#x76F8;&#x6BD4;&#x4E8E;&#x539F;&#x6765;&#x7684;&#x7B97;&#x6CD5;Cinematch&#x6548;&#x679C;&#x63D0;&#x5347;&#x4E86;10.06%&#x3002;</p>
<p><img src="/images/nmf2.png" width="400" height="200" alt="name" align="center"></p>
<h2 id="&#x6587;&#x672C;&#x6316;&#x6398;"><a href="#&#x6587;&#x672C;&#x6316;&#x6398;" class="headerlink" title="&#x6587;&#x672C;&#x6316;&#x6398;"></a>&#x6587;&#x672C;&#x6316;&#x6398;</h2><p>&#x2003;&#x2003;NMF&#x53EF;&#x4EE5;&#x770B;&#x505A;LSI&#x7684;&#x8FD1;&#x4F3C;&#x7B97;&#x6CD5;&#xFF0C;Document-Term&#x77E9;&#x9635;&#x7684;NMF&#x5206;&#x89E3;&#x7ED3;&#x679C;&#x53EF;&#x4EE5;&#x770B;&#x6210;&#x662F;&#x5728;topic&#x7A7A;&#x95F4;&#x5BF9;&#x6587;&#x6863;&#x4EE5;&#x53CA;&#x5355;&#x8BCD;&#x7684;&#x4F4E;&#x79E9;&#x8FD1;&#x4F3C;&#x3002;&#x5229;&#x7528;NMF&#xFF0C;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#x662F;&#x57FA;&#x7840;&#x6F5C;&#x5728;&#x8BED;&#x4E49;&#x7684;&#x52A0;&#x6CD5;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x4F7F;&#x5F97;&#x5728;&#x6587;&#x672C;&#x57DF;&#x4E2D;&#x66F4;&#x6709;&#x610F;&#x4E49;&#x3002;</p>
<p><img src="/images/nmf1.png" width="400" height="200" alt="name" align="center"></p>
<h2 id="&#x4EA4;&#x53C9;&#x793E;&#x533A;&#x53D1;&#x73B0;"><a href="#&#x4EA4;&#x53C9;&#x793E;&#x533A;&#x53D1;&#x73B0;" class="headerlink" title="&#x4EA4;&#x53C9;&#x793E;&#x533A;&#x53D1;&#x73B0;"></a>&#x4EA4;&#x53C9;&#x793E;&#x533A;&#x53D1;&#x73B0;</h2><p>&#x2003;&#x2003;&#x77E9;&#x9635; $V$ &#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x4E2D;&#x7528;&#x6237;&#x5173;&#x7CFB;&#x77E9;&#x9635;&#x3002;$W$ &#x4E2D;&#x7684; $k$ &#x4E2A;&#x5217;&#x5411;&#x91CF;&#x770B;&#x4F5C;&#x65B0;&#x7684;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x4E0B;&#x7684;&#x4E00;&#x7EC4;&#x57FA;&#xFF0C;$H$ &#x7684;&#x6BCF;&#x4E00;&#x884C;&#x662F;&#x5728;&#x8FD9;&#x7EC4;&#x57FA;&#x4E0B;&#x7684;&#x65B0;&#x8868;&#x793A;&#x3002;&#x56E0;&#x6B64;,&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x8868;&#x793A;&#x5411;&#x91CF; $x$ &#x53EF;&#x4EE5;&#x7528;$W$&#x7684;&#x5217;&#x5411;&#x91CF;&#x7684;&#x7EBF;&#x6027;&#x7EC4;&#x5408;&#x8FDB;&#x884C;&#x903C;&#x8FD1;$&#x1D465;&#x2192;&#x1D44A;&#x210E;^&#x1D447;$,&#x5176;&#x4E2D;, $h$ &#x8868;&#x793A;&#x5728;&#x5404;&#x57FA;&#x5411;&#x91CF;&#x7684;&#x7EC4;&#x5408;&#x6743;&#x91CD;&#xFF0C;&#x4EE3;&#x8868;&#x8282;&#x70B9;&#x5230;&#x5404;&#x4E2A;&#x793E;&#x533A;&#x7684;&#x96B6;&#x5C5E;&#x7A0B;&#x5EA6;&#x3002;</p>
<p><img src="/images/nmf3.png" width="400" height="180" alt="name" align="center"></p>
<h1 id="nmf&#x7406;&#x8BBA;&#x63A8;&#x5BFC;"><a href="#NMF&#x7406;&#x8BBA;&#x63A8;&#x5BFC;" class="headerlink" title="NMF&#x7406;&#x8BBA;&#x63A8;&#x5BFC;"></a>NMF&#x7406;&#x8BBA;&#x63A8;&#x5BFC;</h1><p>&#x2003;&#x2003;&#x975E;&#x8D1F;&#x77E9;&#x9635;&#x5206;&#x89E3; (Nonnegative Matrix Factorization, NMF)&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#x91CD;&#x8981;&#x7684;&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x5176;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x4E8E;&#x8BDD;&#x9898;&#x53D1;&#x73B0;&#x548C;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x7B49;&#x5E94;&#x7528;&#x3002;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x975E;&#x8D1F;&#x6837;&#x672C;&#x77E9;&#x9635;(&#x5982;$m$&#x4E2A;&#x7528;&#x6237;&#x5BF9;$n$&#x4E2A;&#x5546;&#x54C1;&#x7684;&#x6253;&#x5206;&#x77E9;&#x9635;)$\mathbf{R} \in R_{+}^{m \times n}$&#xFF0C;NMF&#x7684;&#x76EE;&#x6807;&#x4E3A;&#x6C42;&#x89E3;&#x4E24;&#x4E2A;&#x975E;&#x8D1F;&#x4F4E;&#x79E9;&#x77E9;&#x9635;$\mathbf{W} \in R_{+}^{m \times k}$,$\mathbf{H} \in R_{+}^{k \times n}$&#xFF0C;&#x6700;&#x5C0F;&#x5316;&#x5982;&#x4E0B;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x5982;&#x4E0B;:<br>$$L\left ( \mathbf{W},   \mathbf{H} \right ) = \frac{1}{2} \left | \mathbf{R} - \mathbf{W}\mathbf{H^T} \right | + \frac{\lambda}{2}\left ( \left | \mathbf{W} \right |_F^2 + \left | \mathbf{H} \right |_F^2 \right )$$</p>
<p>&#x2003;&#x2003;&#x5176;&#x4E2D;$\left | . \right |$&#x8868;&#x793A;&#x77E9;&#x9635;&#x7684;F&#x8303;&#x6570;&#x3002;&#x4E0A;&#x8FF0;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x4E5F;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;&#xFF1A;</p>
<p>$$L\left ( \mathbf{W},   \mathbf{H} \right ) = \frac{1}{2} \sum_{i = 1}^{m}\sum_{j = 1}^{n}\left ( r_{i,j} - w_i h_j^T \right ) + \frac{\lambda}{2}\left ( \left | \mathbf{W} \right |_F^2 + \left | \mathbf{H} \right |_F^2 \right )$$</p>
<p>&#x5176;&#x4E2D;$w_i$&#x548C;$h_j$&#x5747;&#x4E3A;&#x884C;&#x5411;&#x91CF;&#xFF0C;&#x5176;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x77E9;&#x9635;$W$&#x7684;&#x7B2C;$i$&#x4E2A;&#x884C;&#x5411;&#x91CF;&#x548C;$H$&#x7684;&#x7B2C;$j$&#x4E2A;&#x884C;&#x5411;&#x91CF;&#x3002;&#x53EF;&#x8BA1;&#x7B97;$W$&#x548C;$H$&#x7684;&#x68AF;&#x5EA6;&#x5982;&#x4E0B;&#xFF1A;<br>$$\frac{\partial L}{\partial w_i} = -\sum_{j = 1}^{n}(r_{i,j} - w_i h_j^T)h_j + \lambda w_i = G_{w_i} + F_{w_i}$$</p>
<p>$$\frac{\partial L}{\partial h_j} = -\sum_{i = 1}^{m}(r_{i,j} - w_i h_j^T)w_i + \lambda h_j = G_{h_j} + F_{h_j}$$</p>
<p>&#x5176;&#x4E2D;&#xFF0C;$G_{w_i} = -\sum_{j = 1}^{n}(r_{i,j} - w_i h_j^T)h_j$&#xFF0C;$F_{w_i} = \lambda w_i$,$G_{h_j} = -\sum_{i = 1}^{m}(r_{i,j} - w_i h_j^T)w_i$,$F_{h_j} = \lambda h_j$&#x3002;&#x91C7;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x53C2;&#x6570;&#x4F18;&#x5316;&#x65B9;&#x5F0F;, &#x53EF;&#x5F97;W&#x4EE5;&#x53CA;H&#x7684;&#x66F4;&#x65B0;&#x65B9;&#x5F0F;&#x89C1;&#x4E0B;&#x5F0F;&#xFF1A;<br>$$w_i \leftarrow \left [ (1 - \eta \lambda)w_i + \eta \sum_{j = 1}^{n}e_{i,j}h_j \right ]_+$$</p>
<p>$$h_j \leftarrow \left [ (1 - \eta \lambda)h_j + \eta \sum_{i = 1}^{m}e_{i,j}w_i \right ]_+$$<br>&#x5176;&#x4E2D;$\left [ x \right ]_+$&#x5B9A;&#x4E49;&#x4E3A;$\left [ x \right ]_+ = \left \langle max(x_1, 0),\cdots,max(x_k, 0) \right \rangle$&#x3002;</p>
<h1 id="&#x5B9E;&#x73B0;"><a href="#&#x5B9E;&#x73B0;" class="headerlink" title="&#x5B9E;&#x73B0;"></a>&#x5B9E;&#x73B0;</h1><h2 id="&#x5355;&#x673A;&#x5B9E;&#x73B0;python"><a href="#&#x5355;&#x673A;&#x5B9E;&#x73B0;&#xFF08;Python" class="headerlink" title="&#x5355;&#x673A;&#x5B9E;&#x73B0;&#xFF08;Python)"></a>&#x5355;&#x673A;&#x5B9E;&#x73B0;&#xFF08;Python)</h2><p>&#x2003;&#x2003;&#x4E0B;&#x9762;&#x662F;&#x91C7;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF08;&#x516C;&#x5F0F;&#x89C1;&#x4E0A;&#x9762;)&#x5B9E;&#x73B0;&#x7684;NMF&#x77E9;&#x9635;&#x5206;&#x89E3;&#x7B97;&#x6CD5;&#x3002;</p>
<pre><code class="python"><span class="comment"># coding=utf-8</span>
<span class="keyword">import</span> numpy <span class="keyword">as</span> np
<span class="keyword">import</span> math
<span class="keyword">import</span> random
<span class="keyword">import</span> argparse


<span class="comment"># generate a matrix whose cell is in gauss distribution</span>
<span class="function"><span class="keyword">def</span> <span class="title">generate_gauss_dist_matrix</span><span class="params">(row, col, mu, sigma)</span>:</span>
    gauss_matrix = np.zeros(shape=(row, col))
    <span class="keyword">for</span> i <span class="keyword">in</span> xrange(row):
        <span class="keyword">for</span> j <span class="keyword">in</span> xrange(col):
            gauss_matrix[i][j] = random.gauss(mu, sigma)
    <span class="keyword">return</span> gauss_matrix 


<span class="comment"># calculate gradients</span>
<span class="function"><span class="keyword">def</span> <span class="title">calculate_grad</span><span class="params">(user_lst, item_lst, rate_lst, row, col, matrix_w, matrix_h, prompt)</span>:</span>
    grad = np.zeros(shape=(row, col))
    error_sum = <span class="number">0</span>  <span class="comment"># calculate the the RMSE on train data.</span>
    <span class="keyword">for</span> user, item, rate <span class="keyword">in</span> zip(user_lst, item_lst, rate_lst):
        eij = rate - np.dot(matrix_w[user, :], matrix_h[:, item])
        error_sum += abs(eij)
        <span class="keyword">if</span> prompt == <span class="string">&quot;W&quot;</span>:
            grad[user, :] += eij * matrix_h[:, item].T
        <span class="keyword">else</span>:
            grad[:, item] += eij * matrix_w[user, :].T
    <span class="keyword">return</span> grad, error_sum


<span class="comment"># update parameters</span>
<span class="function"><span class="keyword">def</span> <span class="title">update_paramters</span><span class="params">(row, col, matrix, grad, learn_rate, reg)</span>:</span>
    <span class="keyword">for</span> i <span class="keyword">in</span> range(row):
        <span class="keyword">for</span> j <span class="keyword">in</span> range(col):
            new = (<span class="number">1</span> - learn_rate * reg) * matrix[i][j] + learn_rate * grad[i][j]
            matrix[i][j] = max(new, <span class="number">0.0</span>)
    <span class="keyword">return</span> matrix


<span class="function"><span class="keyword">def</span> <span class="title">matrix_factorization_train</span><span class="params">(user_lst, item_lst, rate_lst, K=<span class="number">10</span>, iters=<span class="number">100</span>, learn_rate_init=<span class="number">0.001</span>, reg=<span class="number">0.1</span>)</span>:</span>
    max_user_id = max(user_lst)
    max_item_id = max(item_lst)
    sum_rate = sum(rate_lst) 
    count = len(user_lst) 

    <span class="comment"># size</span>
    row = max_user_id + <span class="number">1</span>
    col = max_item_id + <span class="number">1</span>

    <span class="comment"># matrix parameters distribution is gauss distribution.</span>
    <span class="keyword">print</span> <span class="string">&quot;initialization of the parameters......&quot;</span>
    bias = sum_rate * <span class="number">1.0</span> / count
    mu = math.sqrt(bias / K)
    sigma = <span class="number">0.1</span>
    matrix_w = generate_gauss_dist_matrix(row, K, mu, sigma)
    matrix_h = generate_gauss_dist_matrix(K, col, mu, sigma)

    <span class="keyword">for</span> iter <span class="keyword">in</span> xrange(<span class="number">1</span>, iters + <span class="number">1</span>):
        learn_rate = learn_rate_init / math.sqrt(iter)
        <span class="keyword">print</span> <span class="string">&quot;In this iteration, learn_rate is: &quot;</span> + str(learn_rate)
        <span class="comment"># update W</span>
        grad_w, error_sum = calculate_grad(user_lst, item_lst, rate_lst, row, K, matrix_w, matrix_h, <span class="string">&quot;W&quot;</span>)
        matrix_w = update_paramters(row, K, matrix_w, grad_w, learn_rate, reg)
        <span class="keyword">print</span> <span class="string">&quot;This is the &quot;</span> + str(iter) \
              + <span class="string">&quot;th iteration after update W, and the RMSE of the Train data is &quot;</span> \
              + str(math.sqrt(error_sum * <span class="number">1.0</span> / len(user_lst)))

        <span class="comment"># update Q</span>
        grad_h, error_sum = calculate_grad(user_lst, item_lst, rate_lst, K, col, matrix_w, matrix_h, <span class="string">&quot;Q&quot;</span>)
        matrix_h = update_paramters(K, col, matrix_h, grad_h, learn_rate, reg)
        <span class="keyword">print</span> <span class="string">&quot;This is the &quot;</span> + str(iter) \
              + <span class="string">&quot;th iteration after update H, and the RMSE of the Train data is &quot;</span> \
              + str(math.sqrt(error_sum * <span class="number">1.0</span> / count))
    <span class="keyword">return</span> matrix_w, matrix_h


<span class="function"><span class="keyword">def</span> <span class="title">matrix_factorization_predict</span><span class="params">(user_lst, item_lst, rate_lst, matrix_w, matrix_h)</span>:</span>
    max_user_id = len(matrix_w)
    max_item_id = len(matrix_h[<span class="number">0</span>])
    count = len(user_lst)
    error = <span class="number">0</span>
    <span class="keyword">for</span> user, item, rate <span class="keyword">in</span> zip(user_lst, item_lst, rate_lst):
        <span class="comment"># filter the triple whose user or item are not trained.</span>
        <span class="keyword">if</span> user &gt;= max_user_id <span class="keyword">or</span> item &gt; max_item_id:
            <span class="keyword">continue</span>
        error += abs(rate - np.dot(matrix_w[user, :], matrix_h[:, item]))
    rmse = math.sqrt(error / count)
    <span class="keyword">return</span> rmse


<span class="comment"># Return the user_lst, item_lst, rate_lst of the movie info.</span>
<span class="function"><span class="keyword">def</span> <span class="title">load_data</span><span class="params">(file_pt)</span>:</span>
    user_lst = list()
    item_lst = list()
    rate_lst = list()
    <span class="keyword">with</span> open(file_pt) <span class="keyword">as</span> f:
        <span class="keyword">for</span> line <span class="keyword">in</span> f:
            <span class="keyword">try</span>:
                fields = line.strip().split()
                user_lst.append(int(fields[<span class="number">0</span>]) - <span class="number">1</span>)
                item_lst.append(int(fields[<span class="number">1</span>]) - <span class="number">1</span>)
                rate_lst.append(int(fields[<span class="number">2</span>]))
            <span class="keyword">except</span> ValueError:
                <span class="keyword">print</span> <span class="string">&quot;format must be [user, item, rate, *]!&quot;</span>
    <span class="keyword">return</span> user_lst, item_lst, rate_lst 


<span class="function"><span class="keyword">def</span> <span class="title">parse_args</span><span class="params">()</span>:</span>
    parser = argparse.ArgumentParser(description=<span class="string">&quot;NMF demo by Ping Li&quot;</span>)

    <span class="comment"># optional args</span>
    parser.add_argument(<span class="string">&quot;-l&quot;</span>, <span class="string">&quot;--learn_rate&quot;</span>, type=float, metavar=<span class="string">&quot;\b&quot;</span>, default=<span class="number">0.001</span>, help=<span class="string">&quot;learn rate, default 0.001&quot;</span>)
    parser.add_argument(<span class="string">&quot;-r&quot;</span>, <span class="string">&quot;--reg&quot;</span>, type=float, metavar=<span class="string">&quot;\b&quot;</span>, default=<span class="number">0.1</span>, help=<span class="string">&quot;reg, default 0.1&quot;</span>)
    parser.add_argument(<span class="string">&quot;-i&quot;</span>, <span class="string">&quot;--iter&quot;</span>, type=int, metavar=<span class="string">&quot;\b&quot;</span>, default=<span class="number">50</span>, help=<span class="string">&quot;iter num, default 50&quot;</span>)
    parser.add_argument(<span class="string">&quot;-K&quot;</span>, <span class="string">&quot;--K&quot;</span>, type=int, metavar=<span class="string">&quot;\b&quot;</span>, default=<span class="number">10</span>, help=<span class="string">&quot;iter num, default 10&quot;</span>)

    <span class="comment"># necessary args</span>
    parser.add_argument(<span class="string">&quot;-tr&quot;</span>, <span class="string">&quot;--train_pt&quot;</span>, metavar=<span class="string">&quot;\b&quot;</span>, help=<span class="string">&quot;train data path&quot;</span>, required=<span class="keyword">True</span>)
    parser.add_argument(<span class="string">&quot;-te&quot;</span>, <span class="string">&quot;--test_pt&quot;</span>, metavar=<span class="string">&quot;\b&quot;</span>, help=<span class="string">&quot;test data path&quot;</span>, required=<span class="keyword">True</span>)

    args = parser.parse_args()

    <span class="keyword">if</span> args.learn_rate &lt; <span class="number">0.0</span> <span class="keyword">or</span> args.reg &lt; <span class="number">0.0</span> <span class="keyword">or</span> args.iter &lt; <span class="number">0</span> <span class="keyword">or</span> args.K &lt; <span class="number">0</span>:
        <span class="keyword">raise</span> ValueError(<span class="string">&quot;learn_rate, reg, iter, K must be positive&quot;</span>)

    <span class="keyword">return</span> args


<span class="keyword">if</span> __name__ == <span class="string">&quot;__main__&quot;</span>:
    args = parse_args()

    train_user_lst, train_item_lst, train_rate_lst = load_data(args.train_pt)
    test_user_lst, test_item_lst, test_rate_lst = load_data(args.test_pt)
    <span class="keyword">print</span> <span class="string">&quot;NMF train start......&quot;</span>
    <span class="comment"># A descent parameters for NMF.</span>
    W, H = matrix_factorization_train(train_user_lst, train_item_lst,
                                      train_rate_lst, args.K, args.iter, args.learn_rate, args.reg)
    <span class="keyword">print</span> <span class="string">&quot;NMF test start ......&quot;</span>
    rmse = matrix_factorization_predict(test_user_lst, test_item_lst, test_rate_lst, W, H)
    <span class="keyword">print</span> <span class="string">&quot;RMSE of the matrix factorization on test data is &quot;</span> + str(rmse)

<span class="comment"># command line</span>
<span class="comment"># python NMF.py --learn_rate 0.001 --reg 0.1 --iter 100 -K 10 --train_pt &quot;./u1.base&quot; --test_pt &quot;./u1.test&quot;</span>
</code></pre>
<h2 id="&#x5B9E;&#x73B0;&#x8981;&#x70B9;"><a href="#&#x5B9E;&#x73B0;&#x8981;&#x70B9;" class="headerlink" title="&#x5B9E;&#x73B0;&#x8981;&#x70B9;"></a>&#x5B9E;&#x73B0;&#x8981;&#x70B9;</h2><h3 id="&#x53C2;&#x6570;&#x521D;&#x59CB;&#x5316;"><a href="#&#x53C2;&#x6570;&#x521D;&#x59CB;&#x5316;" class="headerlink" title="&#x53C2;&#x6570;&#x521D;&#x59CB;&#x5316;"></a>&#x53C2;&#x6570;&#x521D;&#x59CB;&#x5316;</h3><p>&#x2003;&#x2003;&#x7531;&#x4E8E; NMF &#x662F;&#x4E00;&#x4E2A;&#x975E;&#x51F8;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x80FD;&#x627E;&#x5230;&#x4E00;&#x4E2A; local optimal&#x3002;&#x53C2;&#x6570;&#x521D;&#x59CB;&#x503C;&#x7684;&#x9009;&#x53D6;&#x5BF9;&#x7ED3;&#x679C;&#x7684;&#x5F71;&#x54CD;&#x6BD4;&#x8F83;&#x5927;&#x3002;&#x53C2;&#x6570;&#x521D;&#x59CB;&#x503C;&#x6700;&#x597D;&#x79BB;&#x9884;&#x671F;&#x89E3;&#x6BD4;&#x8F83;&#x8FD1;&#xFF0C;&#x6240;&#x4EE5;&#x5176;&#x91CD;&#x6784;&#x540E;&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x548C;&#x539F;&#x6837;&#x672C;&#x503C;&#x63A5;&#x8FD1;:<br>$$w_i h_j = R_{i,j}$$<br>&#x2003;&#x2003;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x7B56;&#x7565;&#x662F;&#x8BA9;&#x53C2;&#x6570;&#x968F;&#x673A;&#x521D;&#x59CB;&#x503C;&#x91CD;&#x6784;&#x540E;&#x7684;&#x503C;&#x7B49;&#x4E8E; $R$ &#x7684;&#x5747;&#x503C; $\mu$:<br>$$W = DenseMatrix(m, K) \times \sqrt{\frac{\mu}{K}}$$<br>$$H = DenseMatrix(K, n) \times \sqrt{\frac{\mu}{K}}$$</p>
<h3 id="rmse&#x9707;&#x8361;&#x95EE;&#x9898;"><a href="#RMSE&#x9707;&#x8361;&#x95EE;&#x9898;" class="headerlink" title="RMSE&#x9707;&#x8361;&#x95EE;&#x9898;"></a>RMSE&#x9707;&#x8361;&#x95EE;&#x9898;</h3><p>&#x2003;&#x2003;&#x5728;&#x4F18;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x4E00;&#x76F4;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x7387;&#x4F1A;&#x5BFC;&#x81F4;loss&#x9707;&#x8361;&#xFF0C;&#x5728;&#x4F18;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6B65;&#x957F;&#x5B9C;&#x9010;&#x6E10;&#x51CF;&#x5C0F;&#x3002;</p>
<p>$$learnrate = \frac{lr} { math.sqrt(step)}$$</p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2016/11/27/Sbt打包时一些包找不到的问题/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="Li Ping">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Dare To Think, Strive To Execute">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Dare To Think, Strive To Execute" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/11/27/Sbt打包时一些包找不到的问题/" itemprop="url">
                  Sbt打包时一些包找不到的问题
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-11-27T09:31:11+08:00">
                2016-11-27
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="&#x80CC;&#x666F;"><a href="#&#x80CC;&#x666F;" class="headerlink" title="&#x80CC;&#x666F;"></a>&#x80CC;&#x666F;</h1><p>&#x2003;&#x2003;&#x4E00;&#x76F4;&#x5BF9;&#x4E8E;java&#x6253;jar&#x5305;&#x4E00;&#x76F4;&#x534A;&#x89E3;&#xFF0C;&#x4E5F;&#x4ECE;&#x6765;&#x6CA1;&#x6DF1;&#x7A76;&#x5728;idea &#x8FD9;&#x4E2A;IDE&#x4E2D;&#x5982;&#x4F55;&#x6253;jar&#x5305;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E3A;&#x6B64;&#x81EA;&#x5DF1;&#x5728;&#x8FD9;&#x4E2A;&#x4E0A;&#x9762;&#x8DF3;&#x4E86;&#x5F88;&#x591A;&#x5751;&#x3002;<br>&#x2003;&#x2003;&#x6700;&#x8FD1;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7B2C;&#x4E09;&#x65B9;&#x5305;&#xFF0C;&#x672C;&#x6765;&#x5728;&#x6253;&#x5305;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x80A1;&#x8111;&#x90FD;&#x52A0;&#x8FDB;&#x53BB;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8DD1;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#x603B;&#x662F;&#x4F1A;&#x51FA;&#x73B0;jar&#x5305;&#x627E;&#x4E0D;&#x5230;&#x3002;&#x6211;&#x5C06;&#x6253;&#x597D;&#x7684;jar&#x5305;&#x89E3;&#x538B;&#x7F29;&#x4EE5;&#x540E;&#xFF0C;&#x786E;&#x5B9E;&#x80FD;&#x627E;&#x5230;&#x6211;&#x60F3;&#x8981;&#x7684;&#x90A3;&#x51E0;&#x4E2A;&#x5305;&#x540D;&#xFF0C;&#x53EF;&#x662F;&#x7A0B;&#x5E8F;&#x5C31;&#x662F;&#x627E;&#x4E0D;&#x5230;&#x3002;&#x5F53;&#x6211;&#x91C7;&#x7528;&#x5916;&#x90E8;&#x52A0;jar&#x5305;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x7A0B;&#x5E8F;&#x5C31;&#x80FD;&#x987A;&#x5229;&#x8DD1;&#x8D77;&#x6765;&#x4E86;&#x3002;<br><img src="/images/jar.jpg" width="400" height="150" alt="error" allgin="center"></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div></pre></td><td class="code"><pre><div class="line">input=/user/liping/ETL/test</div><div class="line">output=/user/liping/ETL/result-after-transform</div><div class="line"></div><div class="line">function run()</div><div class="line">{</div><div class="line">hadoop fs -rmr $output</div><div class="line">${SPARK_HOME}/bin/spark-submit \</div><div class="line"> --master &quot;spark://bda07:7077&quot; \</div><div class="line"> --class &quot;sparksql.reader.FormatTransform&quot; \</div><div class="line"> --conf &quot;spark.cores.max=10&quot; \</div><div class="line"> --jars &quot;./etl/spark-csv_2.10-1.5.0.jar:./etl/common-csv-1.1.jar&quot; \</div><div class="line"> spark-sql.jar \</div><div class="line"> --input_pt $input \</div><div class="line"> --output_pt $output \</div><div class="line"> --input_format &quot;json&quot; \</div><div class="line">  --output_format &quot;tsv&quot;</div><div class="line">}</div><div class="line"></div><div class="line">run</div></pre></td></tr></table></figure>
<p>&#x2003;&#x2003;&#x5982;&#x6B64;&#x770B;&#x6765;&#xFF0C;&#x6211;&#x7528;idea&#x6253;&#x7684;jar&#x5305;&#x8FD8;&#x786E;&#x5B9E;&#x6CA1;&#x6709;&#x5C06;spark-csv_2.10-1.5.0.jar&#x4EE5;&#x53CA;common-csv-1.1.jar&#x8FD9;&#x4E24;&#x4E2A;&#x5305;&#x6253;&#x8FDB;&#x53BB;&#x3002;&#x4E3A;&#x6B64;&#x6211;&#x4E13;&#x95E8;&#x8BF7;&#x8BF7;&#x6559;&#x4E86;&#x4E00;&#x4E2A;&#x64C5;&#x957F;java&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x4E4B;&#x540E;&#x604D;&#x7136;&#x5927;&#x609F;&#xFF0C;&#x539F;&#x6765;&#x6253;jar&#x5305;&#x91CC;&#x9762;&#x662F;&#x4E0D;&#x80FD;&#x6709;&#x5176;&#x4ED6;&#x7684;jar&#x5305;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x67D0;&#x4E2A;&#x7C7B;&#xFF0C;&#x5E94;&#x8BE5;&#x5148;&#x5C06;&#x8BE5;jar&#x5305;&#x89E3;&#x538B;&#x540E;&#x518D;&#x8DDF;&#x6E90;&#x7A0B;&#x5E8F;&#x7F16;&#x8BD1;&#x597D;&#x7684;class&#x6587;&#x4EF6;&#x4E00;&#x8D77;&#x6253;&#x5305;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x6253;extracted jar&#x3002;&#x56E0;&#x4E3A;extracted jar&#x5148;&#x5C06;&#x8BE5;jar&#x5305;&#x89E3;&#x538B;&#x540E;&#x518D;&#x4E00;&#x8D77;&#x6253;&#x5305;&#x3002;&#x540C;&#x65F6;&#x89E3;&#x538B;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x6253;&#x7684;jar&#x5305;&#x5C31;&#x53EF;&#x4EE5;&#x660E;&#x663E;&#x770B;&#x51FA;&#x4E8C;&#x8005;&#x7684;&#x533A;&#x522B;&#x3002;&#x540C;&#x65F6;&#x6211;&#x4E5F;&#x610F;&#x8BC6;&#x5230;&#x5E73;&#x65F6;&#x81EA;&#x5DF1;&#x6253;&#x7684;&#x4E0A;&#x767E;M&#x7684;jar&#x5305;&#xFF0C;&#x9664;&#x4E86;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x6E90;&#x6587;&#x4EF6;&#x7F16;&#x8BD1;&#x540E;&#x7684;class&#x6587;&#x4EF6;&#xFF0C;&#x5176;&#x4ED6;&#x4E00;&#x70B9;&#x7528;&#x90FD;&#x6CA1;&#x7528;&#x3002;<br>&#x4E0B;&#x56FE;&#x662F;&#x6B63;&#x786E;&#x6253;&#x5305;&#x65B9;&#x5F0F;&#xFF1A;<br><img src="/images/jar2.jpeg" width="500" height="300" alt="error" align="center"><br>&#x4E0B;&#x56FE;&#x662F;&#x6211;&#x4E4B;&#x524D;&#x7684;&#x6253;&#x5305;&#x65B9;&#x5F0F;&#xFF1A;<br><img src="/images/jar4.jpeg" width="600" height="300" alt="error" align="center"><br>&#x4E0B;&#x9762;&#x662F;&#x539F;&#x672C;&#x7684;jar&#x89E3;&#x538B;&#x540E;&#x8DDF;&#x6B63;&#x786E;&#x7684;jar&#x89E3;&#x538B;&#x540E;&#x7684;&#x5BF9;&#x7167;&#x56FE;&#xFF1A;<br><img src="/images/jar3.jpeg" width="600" height="300" alt="error" align="center"></p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2016/11/18/分布式算法实现-数据分布&&模型分布/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="Li Ping">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Dare To Think, Strive To Execute">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Dare To Think, Strive To Execute" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/11/18/分布式算法实现-数据分布&&模型分布/" itemprop="url">
                  分布式算法实现--数据分布&&模型分布
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-11-18T18:14:44+08:00">
                2016-11-18
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="&#x80CC;&#x666F;"><a href="#&#x80CC;&#x666F;" class="headerlink" title="&#x80CC;&#x666F;"></a>&#x80CC;&#x666F;</h1><p>&#x2003;&#x2003;&#x5728;Spark&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x6846;&#x67B6;&#x4E0B;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x6709;&#x4E24;&#x79CD;&#x5206;&#x5E03;&#x5F0F;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF1A;&#x6570;&#x636E;&#x5206;&#x5E03;&#x548C;&#x6A21;&#x578B;&#x5206;&#x5E03;&#x3002;&#x6570;&#x636E;&#x5206;&#x5E03;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x65E0;&#x5DEE;&#x522B;&#x5730;&#x5212;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5B50;&#x96C6;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6570;&#x636E;&#x5B50;&#x96C6;&#x5206;&#x53D1;&#x5230;&#x96C6;&#x7FA4;&#x7684;&#x5404;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x8FDB;&#x884C;&#x5E76;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x5728;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x4FDD;&#x7559;&#x4E00;&#x4EFD;&#x5B8C;&#x6574;&#x7684;&#x6A21;&#x578B;&#x53C2;&#x6570;&#xFF0C;&#x5728;&#x53C2;&#x6570;&#x5B8C;&#x6210;&#x5C40;&#x90E8;&#x66F4;&#x65B0;&#x4E4B;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x6C47;&#x5408;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x5C40;&#x90E8;&#x53C2;&#x6570;&#x503C;&#x5F97;&#x51FA;&#x5168;&#x5C40;&#x53C2;&#x6570;&#x503C;&#x3002;&#x2003;&#x2003;Spark MLlib&#x4E2D;&#x5927;&#x90E8;&#x5206;&#x7B97;&#x6CD5;&#x91C7;&#x7528;&#x4E86;&#x6570;&#x636E;&#x5206;&#x5E03;&#x5B9E;&#x73B0;&#x3002;&#x4E0E;&#x6570;&#x636E;&#x5206;&#x5E03;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#x90FD;&#x9700;&#x8981;&#x4FDD;&#x7559;&#x4E00;&#x4EFD;&#x5B8C;&#x6574;&#x7684;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x4E0D;&#x540C;&#xFF0C;&#x6A21;&#x578B;&#x5206;&#x5E03;&#x540C;&#x65F6;&#x5C06;&#x6570;&#x636E;&#x548C;&#x53C2;&#x6570;&#x5206;&#x53D1;&#x5230;&#x5404;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x56E0;&#x800C;&#x80FD;&#x591F;&#x652F;&#x6301;&#x66F4;&#x7EC6;&#x7C92;&#x5EA6;&#x7684;&#x5E76;&#x884C;&#x5316;&#x3002;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5E93;GraphLab&#x5C06;&#x6570;&#x636E;&#x548C;&#x6A21;&#x578B;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x6709;&#x5411;&#x65E0;&#x73AF;&#x4E8C;&#x90E8;&#x56FE;&#x91C7;&#x7528;&#x6A21;&#x578B;&#x5206;&#x5E03;&#x4E0E;&#x5F02;&#x6B65;&#x901A;&#x4FE1;&#x7684;&#x65B9;&#x5F0F;&#x5BF9;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;&#x8BA1;&#x7B97;&#x3002;<br>&#x2003;&#x2003;&#x76F8;&#x6BD4;&#x8F83;&#x800C;&#x8A00;&#xFF0C;&#x6570;&#x636E;&#x5206;&#x5E03;&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#xFF0C;&#x901A;&#x4FE1;&#x4EE3;&#x4EF7;&#x5C0F;&#xFF0C;&#x4F46;&#x5176;&#x8981;&#x6C42;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x90FD;&#x4FDD;&#x5B58;&#x4E00;&#x4EFD;&#x5B8C;&#x6574;&#x7684;&#x6A21;&#x578B;&#x53C2;&#x6570;&#xFF0C;&#x56E0;&#x800C;&#x96BE;&#x4EE5;&#x6EE1;&#x8DB3;&#x5177;&#x6709;&#x5927;&#x89C4;&#x6A21;&#x53C2;&#x6570;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x7684;&#x8BAD;&#x7EC3;&#xFF1B;&#x91C7;&#x7528;&#x6A21;&#x578B;&#x5206;&#x5E03;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x4E0E;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x7684;&#x5173;&#x7CFB;&#x62BD;&#x8C61;&#x51FA;&#x4E00;&#x4E2A;&#x4E8C;&#x90E8;&#x56FE;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x4E0E;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x90FD;&#x662F;&#x56FE;&#x4E0A;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x540C;&#x65F6;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x548C;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x90FD;&#x5206;&#x5E03;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x56E0;&#x6B64;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x901A;&#x4FE1;&#x5F00;&#x9500;&#x8F83;&#x5927;&#xFF0C;&#x4F46;&#x5176;&#x4E3B;&#x8981;&#x4F18;&#x52BF;&#x5728;&#x4E8E;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x5927;&#x89C4;&#x6A21;&#x53C2;&#x6570;&#x7684;&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#x3002;</p>
<h1 id="&#x6570;&#x636E;&#x5206;&#x5E03;"><a href="#&#x6570;&#x636E;&#x5206;&#x5E03;" class="headerlink" title="&#x6570;&#x636E;&#x5206;&#x5E03;"></a>&#x6570;&#x636E;&#x5206;&#x5E03;</h1><h2 id="&#x6570;&#x636E;&#x5206;&#x5E03;&#x4ECB;&#x7ECD;"><a href="#&#x6570;&#x636E;&#x5206;&#x5E03;&#x4ECB;&#x7ECD;" class="headerlink" title="&#x6570;&#x636E;&#x5206;&#x5E03;&#x4ECB;&#x7ECD;"></a>&#x6570;&#x636E;&#x5206;&#x5E03;&#x4ECB;&#x7ECD;</h2><p>&#x2003;&#x2003;&#x6570;&#x636E;&#x5206;&#x5E03;&#x662F;&#x5C06;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5212;&#x5206;&#x5E76;&#x5206;&#x53D1;&#x5230;&#x4E0D;&#x540C;&#x8282;&#x70B9;&#x4EE5;&#x5B9E;&#x73B0;&#x7B97;&#x6CD5;&#x5E76;&#x884C;&#x7684;&#x4E00;&#x7C7B;&#x65B9;&#x5F0F;&#x7684;&#x7EDF;&#x79F0;&#x3002;&#x56FE;-1&#x662F;Spark &#x73AF;&#x5883;&#x4E2D;&#x91C7;&#x7528;&#x6570;&#x636E;&#x5206;&#x5E03;&#x5B9E;&#x73B0;&#x5E76;&#x884C;&#x7B97;&#x6CD5;&#x7684;&#x793A;&#x610F;&#x56FE;&#xFF1A;&#xFF08;1&#xFF09;Driver&#x5C06;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x5206;&#x6210;&#x82E5;&#x5E72;&#x4E2A;&#x5206;&#x533A;&#x5206;&#x53D1;&#x5230;&#x5404;&#x4E2A;Worker&#x4E0A;; &#xFF08;2&#xFF09;Driver&#x5411;&#x6240;&#x6709;&#x7684;Worker&#x5E7F;&#x64AD;&#x6A21;&#x578B;&#x53C2;&#x6570;&#xFF1B;&#xFF08;3&#xFF09;&#x6BCF;&#x4E00;&#x4E2A;Worker&#x6839;&#x636E;&#x5F53;&#x524D;&#x7684;&#x6A21;&#x578B;&#x548C;&#x6240;&#x62E5;&#x6709;&#x7684;&#x672C;&#x5730;&#x5C40;&#x90E8;&#x6570;&#x636E;&#x8BA1;&#x7B97;&#x51FA;&#x68AF;&#x5EA6;&#x5E76;&#x5C06;&#x5176;&#x53D1;&#x9001;&#x7ED9;Driver&#xFF1B;&#xFF08;4&#xFF09;Driver&#x63A5;&#x6536;&#x5230;&#x6240;&#x6709;Worker&#x7684;&#x68AF;&#x5EA6;&#x540E;&#x5C06;&#x5176;&#x5408;&#x5E76;&#x5E76;&#x5BF9;&#x73B0;&#x6709;&#x7684;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#x3002;&#x7B97;&#x6CD5;&#x91CD;&#x590D;&#x6B65;&#x9AA4;&#xFF08;2&#xFF09;-&#xFF08;4&#xFF09;&#x76F4;&#x81F3;&#x6536;&#x655B;&#x3002;<br>&#x2003;&#x2003;&#x6570;&#x636E;&#x5206;&#x5E03;&#x5F0F;&#x5728;&#x5404;&#x79CD;&#x5206;&#x5E03;&#x5F0F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5E93;&#x4E2D;&#x88AB;&#x5E7F;&#x6CDB;&#x91C7;&#x7EB3;&#xFF0C;&#x4F8B;&#x5982;Spark&#x4E2D;&#x91CD;&#x8981;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5E93;MLlib&#x91C7;&#x53D6;&#x6570;&#x636E;&#x5206;&#x5E03;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x4E0D;&#x540C;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x57FA;&#x4E8E;Hadoop MapReduce&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x5B9E;&#x73B0;&#x7684;&#x5927;&#x89C4;&#x6A21;&#x6570;&#x636E;&#x6316;&#x6398;&#x4E0E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E93;Mahout&#x4E5F;&#x662F;&#x91C7;&#x7528;&#x7684;&#x6570;&#x636E;&#x5206;&#x5E03;&#x3002;</p>
<p><img src="/images/data1.png" width="500" height="300" alt="error" align="center"></p>
<h2 id="&#x4EE5;lr&#x4E3A;&#x4F8B;&#x4ECB;&#x7ECD;&#x6570;&#x636E;&#x5206;&#x5E03;"><a href="#&#x4EE5;LR&#x4E3A;&#x4F8B;&#x4ECB;&#x7ECD;&#x6570;&#x636E;&#x5206;&#x5E03;" class="headerlink" title="&#x4EE5;LR&#x4E3A;&#x4F8B;&#x4ECB;&#x7ECD;&#x6570;&#x636E;&#x5206;&#x5E03;"></a>&#x4EE5;LR&#x4E3A;&#x4F8B;&#x4ECB;&#x7ECD;&#x6570;&#x636E;&#x5206;&#x5E03;</h2><p>&#x2003;&#x2003;Logistic Regression &#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x770B;&#x6210;&#x5BF9;&#x4E00;&#x4E2A;&#x6B63;&#x5219;&#x5316;&#x540E;&#x7684;&#x8D1F;&#x5BF9;&#x6570;&#x4F3C;&#x7136;&#x51FD;&#x6570;&#x7684;&#x4F18;&#x5316;&#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x4E8C;&#x503C;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x5047;&#x8BBE;&#x7ED9;&#x5B9A;$N$&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;$x_i$&#x4E3A;&#x7B2C;$i$&#x4E2A;&#x6837;&#x672C;&#x7684;K&#x7EF4;&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF0C;&#x4E3A;&#x7B2C;$i$&#x4E2A;&#x6837;&#x672C;&#x7684;&#x6807;&#x7B7E;&#xFF0C;$t_i = 0$&#x8868;&#x793A;&#x7B2C;$i$&#x4E2A;&#x6837;&#x672C;&#x4E3A;&#x8D1F;&#x4F8B;&#xFF0C;$t_i = 1$&#x8868;&#x793A;&#x5176;&#x4E3A;&#x6B63;&#x4F8B;&#x3002;&#x8FDB;&#x4E00;&#x6B65;&#x5047;&#x8BBE;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x4E3A;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x5373;$f\left ( x \right ) = \left \langle \mathbf{w, x}  \right \rangle + b$&#xFF0C;&#x5176;&#x4E2D;&#x548C;&#x4E3A;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x3002;Logistic Regression&#x7684;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x7531;&#x7ECF;&#x9A8C;&#x98CE;&#x9669;&#x9879;&#x548C;$l$2&#x6B63;&#x5219;&#x9879;&#x7EC4;&#x6210;&#xFF1A;</p>
<p>(1)$$L \left (\mathbf{w} \right ) = - \sum_{i = 1}^N \left [ t_i ln \left ( y_i \right )  - \left ( 1- t_i \right ) ln\left ( 1 - y_i \right ) \right] + \frac{\lambda }{2}\left | \mathbf{w} \right |_2^2$$</p>
<p>&#x2003;&#x2003;&#x5176;&#x4E2D;&#x4E3A;&#x4F7F;&#x7528;&#x6A21;&#x578B;&#x5BF9;&#x7B2C;i&#x4E2A;&#x6837;&#x672C;&#x7684;&#x9884;&#x6D4B;&#x503C;&#xFF0C;&#x4E3A;&#x5E73;&#x8861;&#x7ECF;&#x9A8C;&#x98CE;&#x9669;&#x4E0E;&#x6B63;&#x5219;&#x9879;&#x7684;&#x7CFB;&#x6570;&#x3002;Logistic Regression&#x7684;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#xFF08;GD&#xFF1A;Gradient Descent&#xFF09;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x6839;&#x636E;(1)&#x5F0F;&#xFF0C;&#x53EF;&#x6C42;&#x5F97;b&#x4EE5;&#x53CA;w&#x7684;&#x68AF;&#x5EA6;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>(2) $$\frac{\partial L}{\partial b} = - \sum_{i = 1}^N\left ( t_i - y_i \right ) = G_b$$</p>
<p>(3) $$\frac{\partial L}{\partial b} = - \sum_{i = 1}^N\left ( t_i - y_i \right ) \times x_i  + \lambda \mathbf{w}= G_{\mathbf{w}} + \mathbf{F}$$<br>&#x2003;&#x2003;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x5E76;&#x884C;&#x5316;&#xFF0C;&#x5C06;&#x5BF9;w&#x7684;&#x68AF;&#x5EA6;&#x5206;&#x6210;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x5176;&#x4E2D;$G_\mathbf{w} = - \sum_{i = 1}^N\left ( t_i - y_i \right ) \times x_i$, $F = \lambda \mathbf{w}$&#x3002;<br>&#x2003;&#x2003;&#x91C7;&#x7528;GD&#x53C2;&#x6570;&#x4F18;&#x5316;&#x65B9;&#x5F0F;, &#x53EF;&#x5F97;w&#x4EE5;&#x53CA;b&#x7684;&#x66F4;&#x65B0;&#x65B9;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>(4) $$b\leftarrow b + \eta \sum_{i = 1}^N\left ( t_i - y_i \right )$$</p>
<p>(5) $$\mathbf{w}_j \leftarrow \left ( 1 - \eta \lambda \right )\mathbf{w}_j + \eta \sum_{i = 1}^N\left ( t_i - y_i \right ) x_i^j,for j = 1,\cdots, K$$<br>&#x5176;&#x4E2D;&#x4E3A;&#x9884;&#x8BBE;&#x7684;&#x5B66;&#x4E60;&#x6B65;&#x957F;&#x3002;<br>&#x2003;&#x2003;&#x7B97;&#x6CD5;1&#x5C55;&#x793A;&#x4E86;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5206;&#x5E03;&#x5B9E;&#x73B0;Logistic Regression&#x7B97;&#x6CD5;&#x7684;&#x4F2A;&#x4EE3;&#x7801;&#xFF0C;&#x5176;&#x5728;&#x7B97;&#x6CD5;&#x6267;&#x884C;&#x521D;&#x59CB;&#x5C06;&#x8BAD;&#x7EC3;&#x6837;&#x672C;$S$&#x5212;&#x5206;&#x6210;&#x591A;&#x4EFD;&#x5E76;&#x5206;&#x53D1;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x5E76;&#x5E7F;&#x64AD;&#x6A21;&#x578B;&#x53C2;&#x6570;w&#x548C;b&#x5230;&#x6240;&#x6709;&#x7684;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#x3002;&#x5728;&#x6BCF;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9996;&#x5148;&#x6BCF;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#x6839;&#x636E;&#x672C;&#x5730;&#x7684;&#x6570;&#x636E;&#x548C;&#x5F53;&#x524D;&#x53C2;&#x6570;&#x503C;$\mathbf{w}$&#x548C;$b$&#x8BA1;&#x7B97;&#x672C;&#x5730;&#x7684;&#x68AF;&#x5EA6;$G_{\mathbf{w}}^i$&#x548C;$G_b^i$&#xFF1B;&#x7136;&#x540E;&#x96C6;&#x7FA4;&#x7684;Driver&#x8282;&#x70B9;&#x805A;&#x5408;&#x6240;&#x6709;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#x4E0A;&#x68AF;&#x5EA6;$G_{\mathbf{w}}^i$&#x548C;$G_b^i$&#xFF0C;&#x66F4;&#x65B0;&#x5168;&#x5C40;&#x7684;&#x53C2;&#x6570;&#x503C;&#xFF0C;&#x5E76;&#x5411;&#x6240;&#x6709;&#x7684;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#x8FDB;&#x884C;&#x5E7F;&#x64AD;&#xFF1B;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#x5728;&#x63A5;&#x6536;&#x5230;&#x66F4;&#x65B0;&#x540E;&#x7684;&#x5168;&#x5C40;&#x53C2;&#x6570;&#x503C;&#x540E;&#xFF0C;&#x5F00;&#x59CB;&#x4E0B;&#x4E00;&#x8F6E;&#x7684;&#x8FED;&#x4EE3;&#x3002;</p>
<p><img src="/images/data2.png" width="600" height="250" alt="data1" align="center"></p>
<h2 id="&#x6570;&#x636E;&#x5206;&#x5E03;&#x4E00;&#x822C;&#x5F62;&#x5F0F;"><a href="#&#x6570;&#x636E;&#x5206;&#x5E03;&#x4E00;&#x822C;&#x5F62;&#x5F0F;" class="headerlink" title="&#x6570;&#x636E;&#x5206;&#x5E03;&#x4E00;&#x822C;&#x5F62;&#x5F0F;"></a>&#x6570;&#x636E;&#x5206;&#x5E03;&#x4E00;&#x822C;&#x5F62;&#x5F0F;</h2><p>&#x2003;&#x2003;&#x6570;&#x636E;&#x5206;&#x5E03;&#x7684;&#x4E00;&#x822C;&#x6D41;&#x7A0B;&#x56FE;&#x89C1;&#x4E0B;&#x56FE;&#x3002;&#x9996;&#x5148;&#x6316;&#x6398;&#x51FA;&#x7B97;&#x6CD5;&#x4E2D;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x7684;&#x90E8;&#x5206;&#x5728;Worker&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x5728;&#x4EE5;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4E3A;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x4E2D;&#xFF0C;&#x8BA1;&#x7B97;&#x68AF;&#x5EA6;&#x662F;&#x660E;&#x663E;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5728;&#x7070;&#x8272;&#x8282;&#x70B9;&#x4E2D;&#x6267;&#x884C;&#xFF1B;&#x76F8;&#x53CD;&#x5408;&#x5E76;&#x68AF;&#x5EA6;&#x5E7F;&#x64AD;&#x53C2;&#x6570;&#x7B49;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x5728;&#x9EC4;&#x8272;&#x8282;&#x70B9;Driver&#x4E2D;&#x6267;&#x884C;&#x3002;<br><img src="/images/data3.jpeg" width="300" height="450" alt="data1" align="center"></p>
<h1 id="&#x6A21;&#x578B;&#x5206;&#x5E03;"><a href="#&#x6A21;&#x578B;&#x5206;&#x5E03;" class="headerlink" title="&#x6A21;&#x578B;&#x5206;&#x5E03;"></a>&#x6A21;&#x578B;&#x5206;&#x5E03;</h1><h2 id="&#x6A21;&#x578B;&#x5206;&#x5E03;&#x4ECB;&#x7ECD;"><a href="#&#x6A21;&#x578B;&#x5206;&#x5E03;&#x4ECB;&#x7ECD;" class="headerlink" title="&#x6A21;&#x578B;&#x5206;&#x5E03;&#x4ECB;&#x7ECD;"></a>&#x6A21;&#x578B;&#x5206;&#x5E03;&#x4ECB;&#x7ECD;</h2><p>&#x2003;&#x2003;&#x6A21;&#x578B;&#x5206;&#x5E03;&#x662F;&#x5C06;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x5206;&#x5E03;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x5B9E;&#x73B0;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x7684;&#x4E00;&#x7C7B;&#x65B9;&#x5F0F;&#x7684;&#x7EDF;&#x79F0;&#x3002;&#x4F7F;&#x7528;&#x6A21;&#x578B;&#x5206;&#x5E03;&#x5B9E;&#x73B0;&#x5206;&#x5E03;&#x5F0F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x4E8C;&#x90E8;&#x56FE;&#xFF0C;&#x5982;&#x56FE;-2&#x6240;&#x793A;&#xFF0C;&#x5176;&#x4E2D;&#x4E3A;&#x6837;&#x672C;&#x9876;&#x70B9;&#x8868;&#x793A;&#x6BCF;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;&#x4E3A;&#x53C2;&#x6570;&#x9876;&#x70B9;&#x8868;&#x793A;&#x6A21;&#x578B;&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x7528;&#x8868;&#x793A;&#x6837;&#x672C;&#x5BF9;&#x53C2;&#x6570;&#x5173;&#x8054;&#x7A0B;&#x5EA6;&#xFF08;&#x5728;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x5047;&#x8BBE;&#x4E0B;&#xFF0C;&#x4E3A;&#x6837;&#x672C;&#x7684;&#x7B2C;j&#x7EF4;&#x7279;&#x5F81;&#xFF09;&#xFF0C;&#x5F53;&#x65F6;&#xFF0C;&#x9876;&#x70B9;&#x4E0E;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x8D77;&#x6743;&#x91CD;&#x4E3A;&#x7684;&#x8FB9;&#xFF0C;&#x53CD;&#x4E4B;&#xFF0C;&#x9876;&#x70B9;&#x4E0E;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x8FB9;&#x3002;<br>&#x2003;&#x2003;&#x56FE;-3&#x4E3A;&#x57FA;&#x4E8E;Spark&#x7684;GraphX[9]&#x91C7;&#x7528;&#x6A21;&#x578B;&#x5206;&#x5E03;&#x5B9E;&#x73B0;&#x5E76;&#x884C;&#x7B97;&#x6CD5;&#x7684;&#x793A;&#x610F;&#x56FE;:&#xFF08;1&#xFF09;&#x901A;&#x8FC7;GraphX&#x5C06;&#x4E8C;&#x90E8;&#x56FE;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x5230;&#x4E0D;&#x540C;&#x7684;Spark&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#xFF1B;&#xFF08;2&#xFF09;&#x6A21;&#x578B;&#x9876;&#x70B9;&#x5411;&#x4E0E;&#x5176;&#x90BB;&#x63A5;&#x6837;&#x672C;&#x9876;&#x70B9;&#x53D1;&#x9001;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x4FE1;&#x606F;&#xFF1B;&#xFF08;3&#xFF09;&#x6837;&#x672C;&#x9876;&#x70B9;&#x8BA1;&#x7B97;&#x8BE5;&#x6837;&#x672C;&#x4E0A;&#x7684;&#x68AF;&#x5EA6;&#x5E76;&#x53D1;&#x9001;&#x7ED9;&#x90BB;&#x63A5;&#x7684;&#x53C2;&#x6570;&#x9876;&#x70B9;&#xFF1B;&#xFF08;4&#xFF09; &#x53C2;&#x6570;&#x9876;&#x70B9;&#x5728;&#x63A5;&#x53D7;&#x5230;&#x68AF;&#x5EA6;&#x4FE1;&#x606F;&#x540E;&#x66F4;&#x65B0;&#x81EA;&#x8EAB;&#x6743;&#x91CD;&#x3002;&#x91CD;&#x590D;&#xFF08;2&#xFF09;-&#xFF08;4&#xFF09;&#x76F4;&#x81F3;&#x6536;&#x655B;&#x3002;<br><img src="/images/model1.png" width="300" height="350" alt="data1" align="center"><br><img src="/images/model2.png" width="500" height="450" alt="data1" align="center"></p>
<h2 id="&#x4EE5;lr&#x4E3A;&#x4F8B;&#x4ECB;&#x7ECD;&#x6A21;&#x578B;&#x5206;&#x5E03;"><a href="#&#x4EE5;LR&#x4E3A;&#x4F8B;&#x4ECB;&#x7ECD;&#x6A21;&#x578B;&#x5206;&#x5E03;" class="headerlink" title="&#x4EE5;LR&#x4E3A;&#x4F8B;&#x4ECB;&#x7ECD;&#x6A21;&#x578B;&#x5206;&#x5E03;"></a>&#x4EE5;LR&#x4E3A;&#x4F8B;&#x4ECB;&#x7ECD;&#x6A21;&#x578B;&#x5206;&#x5E03;</h2><p>&#x4E0E;&#x6570;&#x636E;&#x5206;&#x5E03;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;&#x6A21;&#x578B;&#x5206;&#x5E03;&#x9700;&#x8981;&#x9996;&#x5148;&#x6839;&#x636E;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x548C;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x6784;&#x9020;&#x4E8C;&#x90E8;&#x56FE;, &#x5728;Logistic Regression&#x4E2D;&#x9876;&#x70B9;&#x4E0E;&#x9876;&#x70B9;&#x5206;&#x522B;&#x4EE3;&#x8868;&#x7B2C;$i$&#x4E2A;&#x6837;&#x672C;&#x548C;&#x7B2C;$j$&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5F53;$x_i^j \neq 0$&#x65F6;&#xFF0C;&#x9876;&#x70B9;$S_i$&#x4E0E;&#x9876;&#x70B9;$\mathbf{w}_j$&#x4E4B;&#x95F4;&#x4F1A;&#x6709;&#x6743;&#x91CD;&#x4E3A;&#x7684;&#x8FB9;&#xFF0C;&#x53CD;&#x4E4B;&#xFF0C;&#x9876;&#x70B9;$i$&#x4E0E;&#x9876;&#x70B9;$j$&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x8FB9;&#x3002; &#x7B97;&#x6CD5;2&#x5C55;&#x793A;&#x4E86;&#x4F7F;&#x7528;&#x6A21;&#x578B;&#x5206;&#x5E03;&#x5F0F;&#x5B9E;&#x73B0;Logistic Regression&#x7B97;&#x6CD5;&#x7684;&#x4F2A;&#x4EE3;&#x7801;&#xFF0C;&#x5728;&#x5BF9;&#x6B64;&#x4E8C;&#x90E8;&#x56FE;&#x5212;&#x5206;&#x548C;&#x5206;&#x53D1;&#x540E;&#x7B97;&#x6CD5;&#x5F00;&#x59CB;&#x5BF9;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;&#x66F4;&#x65B0;&#xFF0C;&#x5728;&#x6BCF;&#x4E00;&#x8F6E;&#x8FED;&#x4EE3;&#x4E2D;&#xFF0C;&#x9996;&#x5148;&#x6BCF;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x9876;&#x70B9;&#x5C06;&#x5176;&#x53C2;&#x6570;&#x503C;&#x53D1;&#x9001;&#x7ED9;&#x5176;&#x76F8;&#x90BB;&#x7684;&#x6837;&#x672C;&#x9876;&#x70B9;&#xFF0C;&#x5404;&#x4E2A;&#x6837;&#x672C;&#x9876;&#x70B9;&#x6839;&#x636E;&#x63A5;&#x6536;&#x5230;&#x7684;&#x53C2;&#x6570;&#x503C;&#x8BA1;&#x7B97;&#x5F53;&#x524D;&#x6A21;&#x578B;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x4EE5;&#x53CA;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#xFF0C;&#x5E76;&#x5411;&#x5176;&#x76F8;&#x90BB;&#x7684;&#x53C2;&#x6570;&#x9876;&#x70B9;&#x5E7F;&#x64AD;&#x5176;&#x5F97;&#x5230;&#x7684;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#x3002;&#x53C2;&#x6570;&#x9876;&#x70B9;&#x63A5;&#x6536;&#x5230;&#x6240;&#x6709;&#x7684;&#x68AF;&#x5EA6;&#x5411;&#x91CF;&#x540E;&#x8FDB;&#x884C;&#x68AF;&#x5EA6;&#x805A;&#x5408;&#x548C;&#x53C2;&#x6570;&#x66F4;&#x65B0;&#xFF0C;&#x5B8C;&#x6210;&#x4E00;&#x8F6E;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x3002;<br><img src="/images/model3.png" width="600" height="250" alt="data1" align="center"></p>
<h2 id="&#x6A21;&#x578B;&#x5206;&#x5E03;&#x4E00;&#x822C;&#x5F62;&#x5F0F;"><a href="#&#x6A21;&#x578B;&#x5206;&#x5E03;&#x4E00;&#x822C;&#x5F62;&#x5F0F;" class="headerlink" title="&#x6A21;&#x578B;&#x5206;&#x5E03;&#x4E00;&#x822C;&#x5F62;&#x5F0F;"></a>&#x6A21;&#x578B;&#x5206;&#x5E03;&#x4E00;&#x822C;&#x5F62;&#x5F0F;</h2><p>&#x2003;&#x2003;&#x6A21;&#x578B;&#x5206;&#x5E03;&#x7684;&#x4E00;&#x822C;&#x6D41;&#x7A0B;&#x56FE;&#x89C1;&#x4E0B;&#x56FE;&#x3002;&#x9996;&#x5148;&#x5E94;&#x8BE5;&#x6784;&#x9020;&#x51FA;&#x6837;&#x672C;&#x5230;&#x6A21;&#x578B;&#x7684;&#x4E8C;&#x90E8;&#x56FE;&#xFF0C;&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x6A21;&#x578B;&#x5206;&#x5E03;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6570;&#x636E;&#x4E0E;&#x6A21;&#x578B;&#x90FD;&#x662F;&#x4F5C;&#x4E3A;&#x4E8C;&#x90E8;&#x56FE;&#x4E2D;&#x7684;&#x9876;&#x70B9;&#x5B58;&#x50A8;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x6240;&#x4EE5;&#x5404;&#x4E2A;&#x6B65;&#x9AA4;&#x90FD;&#x65E0;&#x5DEE;&#x5730;&#x5728;&#x8BA1;&#x7B97;&#x8282;&#x70B9;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;<br><img src="/images/model4.jpeg" width="300" height="500" alt="data1" align="center"></p>
<h1 id="&#x5E94;&#x7528;&#x573A;&#x666F;"><a href="#&#x5E94;&#x7528;&#x573A;&#x666F;" class="headerlink" title="&#x5E94;&#x7528;&#x573A;&#x666F;"></a>&#x5E94;&#x7528;&#x573A;&#x666F;</h1><ul>
<li>&#x4ECE;&#x7F16;&#x7A0B;&#x65B9;&#x5F0F;&#x6765;&#x770B;&#xFF0C;&#x6570;&#x636E;&#x5206;&#x5E03;&#x56E0;&#x4E3A;&#x6A21;&#x578B;&#x4EE5;&#x5E7F;&#x64AD;&#x7684;&#x5F62;&#x5F0F;&#x5206;&#x53D1;&#xFF0C;&#x7F16;&#x7A0B;&#x8F83;&#x7B80;&#x5355;&#x3002;</li>
<li>&#x4ECE;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x6765;&#x770B;&#xFF0C;&#x6A21;&#x578B;&#x5206;&#x5E03;&#x56E0;&#x4E3A;&#x6A21;&#x578B;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#xFF0C;&#x5177;&#x5907;&#x652F;&#x6301;&#x5927;&#x89C4;&#x6A21;&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#x7684;&#x80FD;&#x529B;&#x3002;</li>
<li>&#x4ECE;&#x8BA1;&#x7B97;&#x6548;&#x7387;&#x6765;&#x770B;&#xFF0C;&#x6A21;&#x578B;&#x5206;&#x5E03;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x89E3;&#x51B3;&#x6A21;&#x578B;&#x89C4;&#x6A21;&#x5927;&#x3001;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x65E0;&#x6CD5;&#x5B58;&#x50A8;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x9002;&#x5408;&#x57FA;&#x4E8E;&#x5927;&#x89C4;&#x6A21;&#x4F46;&#x7A00;&#x758F;&#x7684;&#x6570;&#x636E;&#x8BAD;&#x7EC3;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#xFF1B;&#x5728;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x5C0F;&#x6216;&#x975E;&#x7A00;&#x758F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5206;&#x5E03;&#x65B9;&#x5F0F;&#x901A;&#x4FE1;&#x5F00;&#x9500;&#x5C0F;&#xFF0C;&#x53EF;&#x4EE5;&#x52A0;&#x901F;&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#x3002;</li>
</ul>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2016/11/18/blog-new-plan/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="Li Ping">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Dare To Think, Strive To Execute">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Dare To Think, Strive To Execute" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/11/18/blog-new-plan/" itemprop="url">
                  Blog New Plan
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-11-18T16:36:25+08:00">
                2016-11-18
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="plan"><a href="#Plan" class="headerlink" title="Plan"></a>Plan</h1><p>&#x2003;&#x2003;&#x4E4B;&#x524D;&#x7684;&#x535A;&#x5BA2;&#x6240;&#x5728;&#x7684;&#x670D;&#x52A1;&#x5668;&#x901F;&#x5EA6;&#x5B9E;&#x5728;&#x592A;&#x6162;&#xFF0C;&#x6BCF;&#x6B21;&#x6253;&#x5F00;&#x90FD;&#x611F;&#x89C9;&#x5F04;&#x4E22;&#x4E86;&#x4E00;&#x5929;&#x7684;&#x597D;&#x5FC3;&#x60C5;&#xFF0C;&#x6070;&#x9022;&#x5E08;&#x5F1F;&#x5B89;&#x5229;hexo&#xFF0C;&#x6211;&#x5C31;&#x6253;&#x7B97;&#x628A;&#x535A;&#x5BA2;&#x6574;&#x4E2A;&#x5730;&#x6765;&#x4E2A;&#x5927;&#x8FC1;&#x79FB;&#x3002;&#x53E6;&#x5916;&#x627E;&#x5DE5;&#x4F5C;&#x4E5F;&#x63A5;&#x8FD1;&#x5C3E;&#x58F0;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x6253;&#x7B97;&#x628A;&#x5269;&#x4E0B;&#x7684;&#x672C;&#x6765;&#x4EE5;&#x6587;&#x6863;&#x5F62;&#x5F0F;&#x5B58;&#x5728;&#x7740;&#x7684;&#x7B14;&#x8BB0;&#x653E;&#x4E0A;&#x6765;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x4E3A;&#x4E86;&#x81EA;&#x6211;&#x603B;&#x7ED3;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x53EF;&#x4EE5;&#x7ED9;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x4EBA;&#x4E00;&#x4E9B;&#x524D;&#x4EBA;&#x4E4B;&#x9274;&#x3002;</p>
<h2 id="&#x7B97;&#x6CD5;&#x5206;&#x5E03;&#x5F0F;&#x5B9E;&#x73B0;"><a href="#&#x7B97;&#x6CD5;&#x5206;&#x5E03;&#x5F0F;&#x5B9E;&#x73B0;" class="headerlink" title="&#x7B97;&#x6CD5;&#x5206;&#x5E03;&#x5F0F;&#x5B9E;&#x73B0;"></a>&#x7B97;&#x6CD5;&#x5206;&#x5E03;&#x5F0F;&#x5B9E;&#x73B0;</h2><ul>
<li>&#x6570;&#x636E;&#x5206;&#x5E03;</li>
<li>&#x6A21;&#x578B;&#x5206;&#x5E03;</li>
</ul>
<h2 id="&#x673A;&#x5668;&#x5B66;&#x4E60;"><a href="#&#x673A;&#x5668;&#x5B66;&#x4E60;" class="headerlink" title="&#x673A;&#x5668;&#x5B66;&#x4E60;"></a>&#x673A;&#x5668;&#x5B66;&#x4E60;</h2><ul>
<li>Factorization Machine</li>
<li>NMF</li>
<li>ICModel</li>
</ul>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2016/11/18/pagerank-幂法实现/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="Li Ping">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Dare To Think, Strive To Execute">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Dare To Think, Strive To Execute" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/11/18/pagerank-幂法实现/" itemprop="url">
                  Pagerank 幂法实现
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-11-18T10:53:18+08:00">
                2016-11-18
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="graphx&#x4E2D;pagerank&#x4E2D;&#x7684;&#x4E0D;&#x8DB3;"><a href="#Graphx&#x4E2D;Pagerank&#x4E2D;&#x7684;&#x4E0D;&#x8DB3;" class="headerlink" title="Graphx&#x4E2D;Pagerank&#x4E2D;&#x7684;&#x4E0D;&#x8DB3;"></a>Graphx&#x4E2D;Pagerank&#x4E2D;&#x7684;&#x4E0D;&#x8DB3;</h1><p>&#x2003;&#x2003;&#x524D;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E3A;&#x4E86;&#x5B8C;&#x5584;bda studio&#x4E2D;&#x5F97;&#x7B97;&#x6CD5;&#xFF0C;&#x6211;&#x8C03;&#x7814;&#x4E86;spark graphx&#x4E2D;&#x7684;pagerank&#xFF0C;&#x4E4B;&#x540E;&#x5C31;&#x840C;&#x53D1;&#x4E86;&#x8981;&#x81EA;&#x5DF1;&#x91CD;&#x5199;pagerank&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x5F00;&#x59CB;&#x60F3;&#x91CD;&#x5199;pagerank&#x5B8C;&#x5168;&#x662F;&#x56E0;&#x4E3A;&#x5F53;&#x521D;&#x56FA;&#x6267;&#x5730;&#x60F3;&#x8BA9;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x6536;&#x655B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#xFF0C;&#x8BA9;&#x7B97;&#x6CD5;&#x7EC8;&#x6B62;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x7B97;&#x6CD5;&#x7A76;&#x7ADF;&#x6536;&#x655B;&#x4E0D;&#x6536;&#x655B;&#x5FC3;&#x91CC;&#x5F88;&#x6CA1;&#x6709;&#x5E95;&#x6C14;&#x3002;&#x5F53;&#x6211;&#x6D4B;&#x8BD5;&#x5B8C;spark graphx&#x4E2D;&#x5F97;pagerank&#x4EE5;&#x540E;&#xFF0C;&#x53D1;&#x73B0;&#x4E86;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x66F4;&#x52A0;&#x575A;&#x5B9A;&#x4E86;&#x6211;&#x5199;&#x597D;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x5FC3;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x63D0;&#x4E00;&#x53E5;&#xFF0C;&#x6211;&#x6D4B;&#x8BD5;&#x8BE5;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x7684;&#x662F;twitter&#x6570;&#x636E;&#x96C6;&#x7684;&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5206;&#x522B;&#x662F;twitter_rv.net&#x4EE5;&#x53CA;numeric&#xFF1B;&#x524D;&#x8005;&#x662F;&#x8FB9;&#x6587;&#x4EF6;&#xFF0C;&#x540E;&#x8005;&#x662F;&#x7528;&#x6237;id&#x4EE5;&#x53CA;&#x7528;&#x6237;&#x540D;&#x5B57;&#x5178;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x8FB9;&#x5927;&#x6982;&#x6709;10&#x4EBF;&#x5DE6;&#x53F3;&#xFF0C;&#x9876;&#x70B9;&#x6709;&#x56DB;&#x5343;&#x4E07;&#x3002;graphx&#x7684;pagerank&#x7B97;&#x6CD5;&#x5199;&#x7684;&#x867D;&#x7136;&#x5341;&#x5206;&#x7B80;&#x77ED;&#x7CBE;&#x70BC;&#xFF0C;&#x4F46;&#x662F;&#x5B58;&#x5728;&#x7740;&#x8FD9;&#x6837;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x6536;&#x655B;&#x6027;&#x65B9;&#x9762;&#xFF1A;&#x7B97;&#x6CD5;&#x8FED;&#x4EE3;&#x7684;&#x65F6;&#x5019;pagerank&#x503C;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x603B;&#x7684;pagerank&#x503C;&#x4E5F;&#x5728;&#x4E0D;&#x65AD;&#x53D8;&#x5C0F;&#xFF0C;&#x8FD9;&#x4E5F;&#x8BF4;&#x660E;&#x65E0;&#x8BBA;&#x8FED;&#x4EE3;&#x591A;&#x5C11;&#x6B21;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7B97;&#x6CD5;&#x4E5F;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x6536;&#x655B;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x8D8A;&#x591A;&#xFF0C;&#x635F;&#x5931;&#x7684;pagerank&#x503C;&#x4E5F;&#x8D8A;&#x591A;&#x3002;</li>
<li>&#x6548;&#x7387;&#x65B9;&#x9762;&#xFF1A; &#x8BE5;&#x7B97;&#x6CD5;&#x5728;&#x8FED;&#x4EE3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FED;&#x4EE3;&#x65F6;&#x95F4;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x957F;, &#x8FED;&#x4EE3;&#x65F6;&#x95F4;&#x51E0;&#x4E4E;&#x6210;&#x500D;&#x589E;&#x957F;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x7B97;&#x6CD5;&#x6574;&#x4F53;&#x7684;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x6BD4;&#x8F83;&#x77ED;&#x8FD8;&#x53EF;&#x4EE5;&#x5FCD;&#x53D7;&#xFF0C;&#x4F46;&#x662F;&#x8D8A;&#x5230;&#x540E;&#x6765;&#x8FED;&#x4EE3;&#x65F6;&#x95F4;&#x4F1A;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x5C0F;&#x65F6;&#x5DE6;&#x53F3;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x9020;&#x6210;&#x5185;&#x5B58;&#x5D29;&#x6E83;&#x3002;</li>
</ul>
<h1 id="&#x5E42;&#x6CD5;&#x8DDF;&#x4F20;&#x7EDF;pagerank&#x7684;&#x6839;&#x672C;&#x533A;&#x522B;"><a href="#&#x5E42;&#x6CD5;&#x8DDF;&#x4F20;&#x7EDF;pagerank&#x7684;&#x6839;&#x672C;&#x533A;&#x522B;" class="headerlink" title="&#x5E42;&#x6CD5;&#x8DDF;&#x4F20;&#x7EDF;pagerank&#x7684;&#x6839;&#x672C;&#x533A;&#x522B;"></a>&#x5E42;&#x6CD5;&#x8DDF;&#x4F20;&#x7EDF;pagerank&#x7684;&#x6839;&#x672C;&#x533A;&#x522B;</h1><p><img src="/images/pagerank1.bmp" width="300" height="300" alt="error" align="center"></p>
<p>&#x2003;&#x2003;&#x5728;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x56FE;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x51FA;&#x73B0;&#x51FA;&#x5EA6;&#x4E3A;0 &#x7684;&#x9876;&#x70B9;&#xFF0C;&#x5982;&#x4E0A;&#x56FE;&#x9876;&#x70B9;C&#xFF0C;&#x5982;&#x679C;&#x4ECD;&#x7136;&#x7528;&#x4E4B;&#x524D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5373;&#x6240;&#x6709;&#x9876;&#x70B9;&#x4EE5;damping factor&#x7684;&#x6982;&#x7387;&#x6CBF;&#x7740;&#x94FE;&#x63A5;&#x8DF3;&#x8F6C;&#xFF0C;(1 - damping factor)&#x7684;&#x6982;&#x7387;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#xFF0C;&#x90A3;&#x4E48;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x5C31;&#x4F1A;&#x635F;&#x5931;&#x6240;&#x6709;&#x51FA;&#x5EA6;&#x4E3A;0&#x7684;&#x9876;&#x70B9;&#x7684;pagernak&#x603B;&#x548C;&#x4E58;&#x4EE5;damping factor&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x51FA;&#x5EA6;&#x4E3A;0 &#x7684;&#x9876;&#x70B9;&#x6709;85%(&#x9ED8;&#x8BA4;damping factor&#x5C31;&#x662F;0.85)&#x7684;pagerank&#x5E76;&#x6CA1;&#x6709;&#x7ED9;&#x5176;&#x4ED6;&#x7684;&#x9876;&#x70B9;&#x3002;</p>
<p>&#x2003;&#x2003;&#x90A3;&#x600E;&#x6837;&#x624D;&#x662F;&#x5408;&#x7406;&#x7684;&#x5462;&#xFF0C;&#x4ECE;&#x7ECF;&#x9A8C;&#x4E0A;&#x8BB2;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x51FA;&#x5EA6;&#x4E3A;0&#x7684;&#x9876;&#x70B9;&#xFF0C;&#x5B83;&#x4EEC;&#x5E94;&#x8BE5;&#x5C06;&#x81EA;&#x5DF1;100%&#x7684;pagerank&#x968F;&#x673A;&#x5730;&#x8D21;&#x732E;&#x7ED9;&#x6240;&#x6709;&#x7684;&#x9875;&#x9762;&#x624D;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5F53;&#x6CA1;&#x6709;&#x94FE;&#x63A5;&#x5F80;&#x4E0B;&#x8DF3;&#x8F6C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x968F;&#x673A;&#x5730;&#x9009;&#x62E9;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x3002;&#x5E42;&#x6CD5;&#x8DDF;&#x4F20;&#x7EDF;&#x7684;pagerank&#x6700;&#x6839;&#x672C;&#x7684;&#x533A;&#x522B;&#x5C31;&#x662F;&#x5408;&#x7406;&#x5730;&#x5904;&#x7406;&#x4E86;&#x51FA;&#x5EA6;&#x4E3A;0&#x7684;&#x9876;&#x70B9;&#x7684;pagerank&#x503C;&#xFF0C;&#x8BA9;&#x8FED;&#x4EE3;&#x7684;&#x8FC7;&#x7A0B;pagerank&#x603B;&#x548C;&#x4E0D;&#x53D8;&#xFF0C;&#x53EA;&#x662F;&#x5404;&#x4E2A;&#x7F51;&#x9875;&#x7684;pagerank&#x503C;&#x6709;&#x589E;&#x6709;&#x51CF;&#x3002;</p>
<h1 id="&#x7B97;&#x6CD5;&#x4ECB;&#x7ECD;"><a href="#&#x7B97;&#x6CD5;&#x4ECB;&#x7ECD;" class="headerlink" title="&#x7B97;&#x6CD5;&#x4ECB;&#x7ECD;"></a>&#x7B97;&#x6CD5;&#x4ECB;&#x7ECD;</h1><p>&#x2003;&#x2003;&#x5047;&#x8BBE;$N$&#x662F;Internet &#x4E2D;&#x6240;&#x6709;&#x53EF;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x9875;&#x7684;&#x6570;&#x76EE;&#xFF0C;&#x6B64;&#x6570;&#x503C;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x5B9A;&#x4E49;&#xFF1A;$N \times N$&#x7684;&#x7F51;&#x9875;&#x94FE;&#x63A5;&#x77E9;&#x9635;$G = g_{i,j}\in R^{N*N}$, &#x82E5;&#x7F51;&#x9875;i&#x5B58;&#x5728;&#x94FE;&#x63A5;&#x5230;j, &#x5219;&#x6709;$g_{i,j} = 1$, &#x5426;&#x5219; $g_{i,j} = 0$&#x3002;&#x5927;&#x89C4;&#x6A21;&#x7A00;&#x758F;&#x77E9;&#x9635;&#x6709;&#x5982;&#x4E0B;&#x7279;&#x70B9;&#xFF1A;</p>
<ul>
<li>G&#x4E2D;&#x975E;&#x96F6;&#x5143;&#x7D20;&#x7684;&#x7684;&#x6570;&#x76EE;&#x662F;&#x6574;&#x4E2A;Internet&#x4E2D;&#x8D85;&#x94FE;&#x63A5;&#x7684;&#x6570;&#x76EE;&#x3002;</li>
<li>&#x7B2C;j&#x5217;&#x975E;&#x96F6;&#x5143;&#x7D20;&#x7684;&#x4F4D;&#x7F6E;&#x8868;&#x793A;&#x4E86;&#x6240;&#x6709;&#x94FE;&#x63A5;&#x5230;&#x7F51;&#x9875;j&#x7684;&#x7F51;&#x9875;&#x3002;</li>
<li>&#x7B2C;i&#x884C;&#x975E;&#x96F6;&#x5143;&#x7D20;&#x7684;&#x4F4D;&#x7F6E;&#x8868;&#x793A;&#x4E86;&#x6240;&#x6709;&#x4ECE;&#x7F51;&#x9875;i&#x94FE;&#x63A5;&#x51FA;&#x53BB;&#x7684;&#x7F51;&#x9875;&#x3002;</li>
<li>&#x8BB0;&#x77E9;&#x9635;&#x884C;&#x5143;&#x7D20;&#x4E4B;&#x548C; $r_i = \sum _j g_{i,j}$, &#x5B83;&#x8868;&#x793A;&#x4E86;&#x7B2C;i&#x4E2A;&#x7F51;&#x9875;&#x7684;&#x51FA;&#x5EA6;&#x3002;</li>
<li>&#x8BB0;&#x77E9;&#x9635;&#x5217;&#x5143;&#x7D20;&#x4E4B;&#x548C; $c_j = \sum _i g_{i,j}$, &#x5B83;&#x8868;&#x793A;&#x4E86;&#x7B2C;j&#x4E2A;&#x7F51;&#x9875;&#x7684;&#x5165;&#x5EA6;&#x3002;</li>
</ul>
<p>&#x2003;&#x2003;&#x8981;&#x8BA1;&#x7B97;pagerank, &#x53EF;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x4E0A;&#x7F51;&#x201C;&#x51B2;&#x6D6A;&#x201D;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5373;&#x6BCF;&#x6B21;&#x770B;&#x5B8C;&#x7F51;&#x9875;&#x540E;&#x6709;&#x4E24;&#x79CD;&#x9009;&#x62E9;&#xFF1A;</p>
<p>&#x2003;&#x2003;&#x5728;&#x5F53;&#x524D;&#x7F51;&#x9875;&#x4E2D;&#x968F;&#x673A;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x8D85;&#x94FE;&#x63A5;&#x8FDB;&#x5165;&#x4E0B;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x3002;<br>&#x968F;&#x673A;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7F51;&#x9875;&#x3002;<br>&#x2003;&#x2003;&#x8BBE;$p$&#x4E3A;&#x4ECE;&#x5F53;&#x524D;&#x7F51;&#x9875;&#x4E0A;&#x627E;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x8DF3;&#x8F6C;&#x8FC7;&#x53BB;&#x7684;&#x6982;&#x7387;(&#x4E5F;&#x53EB;<strong>damping factor</strong>)&#xFF0C;&#x5219;$1 - p$&#x5373;&#x4E3A;&#x4E0D;&#x9009;&#x5F53;&#x524D;&#x7F51;&#x9875;&#x94FE;&#x63A5;&#xFF0C;&#x968F;&#x673A;&#x53BB;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x7684;&#x6982;&#x7387;&#x3002;&#x82E5;&#x5F53;&#x524D;&#x7F51;&#x9875;&#x662F; $i$&#xFF0C;&#x5219;&#x5176;&#x8DF3;&#x8F6C;&#x5230;&#x7F51;&#x9875; $j$ &#x7684;&#x53EF;&#x80FD;&#x6027;&#x6709;&#x4E24;&#x79CD;&#xFF1A;</p>
<ul>
<li>&#x7F51;&#x9875; j &#x5728;&#x7F51;&#x9875; i &#x7684;&#x94FE;&#x63A5;&#x4E0A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x8FD9;&#x4E24;&#x4E2A;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x6709;&#x5411;&#x8FB9;&#xFF0C;&#x5176;&#x6982;&#x7387;&#x4E3A; $\frac {p}{r_i} + \frac {1 - p}{N}$.</li>
<li>&#x7F51;&#x9875; j &#x4E0D;&#x5728;&#x7F51;&#x9875; i &#x7684;&#x94FE;&#x63A5;&#x4E0A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x8FD9;&#x4E24;&#x4E2A;&#x9876;&#x70B9;&#x4E0D;&#x5B58;&#x5728;&#x6709;&#x5411;&#x8FB9;&#xFF0C;&#x5176;&#x6982;&#x7387;&#x4E3A; $\frac {1 - p}{N}$.</li>
<li>&#x7531;&#x4E8E;&#x7F51;&#x9875; i &#x4E0E;&#x7F51;&#x9875; j &#x4E4B;&#x95F4;&#x662F;&#x5426;&#x5B58;&#x5728;&#x6709;&#x5411;&#x8FB9;&#x7531;$g_{i,j}$&#x51B3;&#x5B9A;&#xFF0C;&#x5219;&#x8F6C;&#x79FB;&#x77E9;&#x9635;&#x4E3A;&#xFF1A;</li>
</ul>
<p>$$a_{i,j} = p \times \frac{g_{i,j}}{r_i} + \frac{1 - p}N$$</p>
<p>&#x2003;&#x2003;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C; $r_i = 0$, &#x5219;&#x610F;&#x5473;&#x7740; $g_{i,j} = 0$, &#x4E0A;&#x5F0F;&#x4E2D; $a_{i,j} = \frac{1}{N}$&#x3002;&#x4EFB;&#x610F;&#x4E24;&#x4E2A;&#x7F51;&#x9875;&#x4E4B;&#x95F4;&#x7684;&#x8F6C;&#x79FB;&#x77E9;&#x9635; $A = \left(a_{i,j} \right)_{n \times n}$&#x3002;&#x8BBE;&#x77E9;&#x9635;D&#x4E3A;&#x5404;&#x4E2A;&#x7F51;&#x9875;&#x51FA;&#x5EA6;&#x7684;&#x5012;&#x6570;(&#x82E5;&#x6CA1;&#x6709;&#x51FA;&#x5EA6;&#x5219;&#x7F6E;&#x4E3A;1)&#x6784;&#x6210;N&#x9636;&#x5BF9;&#x89D2;&#x77E9;&#x9635;, $e$&#x662F;&#x5168;&#x4E3A;1&#x7684;N&#x7EF4;&#x5411;&#x91CF;, &#x5219;&#x6709;&#xFF1A;</p>
<p>$$A = pGD + \frac {1 - p}{N}ee^T $$</p>
<p>&#x2003;&#x2003;&#x8BBE; $x_i ^k$, i = 1,2,3&#x2026;n&#x8868;&#x793A;&#x67D0;&#x65F6;&#x523B; k &#x7F51;&#x9875; i &#x7684;pagerank&#x503C;, &#x5411;&#x91CF; $x^k$&#x8868;&#x793A;&#x5F53;&#x524D;&#x65F6;&#x523B;&#x5404;&#x4E2A;&#x7F51;&#x9875;&#x7684;pagerank&#x3002;&#x90A3;&#x4E48;&#x4E0B;&#x4E00;&#x65F6;&#x523B;&#x6D4F;&#x89C8;&#x5230;&#x7F51;&#x9875; j &#x7684;&#x6982;&#x7387;&#x4E3A; $x_j^ {k + 1} = \sum_i a_{i,j} \times x_i^k$, &#x6B64;&#x65F6;&#x6D4F;&#x89C8;&#x7F51;&#x9875;&#x7684;pagerank&#x4E3A; $x^{k + 1}= Ax^k$.</p>
<p>&#x2003;&#x2003;&#x5F53;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x65E0;&#x9650;&#x8FDB;&#x884C;&#x4E0B;&#x53BB;&#xFF0C;&#x8FBE;&#x5230;&#x6781;&#x9650;&#x60C5;&#x51B5;&#xFF0C;&#x5373;&#x7F51;&#x9875;&#x8BBF;&#x95EE;&#x6982;&#x7387; $x^k$ &#x6536;&#x655B;&#x5230;&#x4E00;&#x4E2A;&#x6781;&#x9650;&#x503C;&#xFF0C;&#x8FD9;&#x4E2A;&#x6781;&#x9650;&#x5411;&#x91CF;x&#x4E3A;&#x5404;&#x4E2A;&#x7F51;&#x9875;&#x7684;pagerank&#xFF0C;&#x5B83;&#x6EE1;&#x8DB3; $Ax = x$, &#x4E14; $\sum_i^n x_i = 1 $. &#x6700;&#x540E;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6C42;&#x5F97;&#x7684;pagerank&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x662F;&#x77E9;&#x9635;A&#x5728;&#x7279;&#x5F81;&#x503C;&#x4E3A;1&#x65F6;&#x7684;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x3002;</p>
<h2 id="spark-graphx-&#x5B9E;&#x73B0;"><a href="#Spark-Graphx-&#x5B9E;&#x73B0;" class="headerlink" title="Spark Graphx &#x5B9E;&#x73B0;"></a>Spark Graphx &#x5B9E;&#x73B0;</h2><p>&#x2003;&#x2003;&#x5C06;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;pagerank&#x503C;&#x5206;&#x6210;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x901A;&#x8FC7;&#x94FE;&#x63A5;&#x8DF3;&#x8F6C;&#x8FC7;&#x6765;&#x7684;&#xFF0C;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x4E3A;&#x4E0D;&#x901A;&#x8FC7;&#x94FE;&#x63A5;&#x8DF3;&#x8F6C;&#x7684;&#x90E8;&#x5206;&#x3002;&#x8D21;&#x732E;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x7684;pagerank&#x503C;&#x7684;&#x8282;&#x70B9;&#x6709;&#x4E24;&#x7C7B;&#xFF1A;</p>
<p>&#x51FA;&#x5EA6;&#x4E3A; 0 &#x7684;&#x9876;&#x70B9;&#xFF0C;&#x8FD9;&#x4E9B;&#x9876;&#x70B9;&#x4EE5;1/N&#x7684;&#x6982;&#x7387;&#x8DF3;&#x8F6C;&#x5230;&#x5176;&#x4ED6;&#x9875;&#x9762;, &#x5BF9;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x7684;&#x8D21;&#x732E;&#x4E3A;$\frac{x_i}{N}$&#xFF1B;<br>&#x51FA;&#x5EA6;&#x4E0D;&#x4E3A; 0 &#x7684;&#x9876;&#x70B9;&#xFF0C;&#x8FD9;&#x4E9B;&#x9876;&#x70B9;&#x4EE5;(1 - p) / N&#x7684;&#x6982;&#x7387;&#x8DF3;&#x8F6C;&#x5230;&#x5176;&#x4ED6;&#x7F51;&#x9875;&#xFF0C;&#x8D21;&#x732E;&#x4E86;$\frac {(1 - p) \times x_i}{N}$;<br>&#x7531;&#x4E8E;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x5F97;&#x5230;&#x7684;pagerank&#x5BF9;&#x6240;&#x6709;&#x7684;&#x8282;&#x70B9;&#x800C;&#x8A00;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5728;graphx&#x4E2D;&#xFF0C;&#x8BA1;&#x7B97;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x4F7F;&#x7528;&#x6D88;&#x606F;&#x4F20;&#x9012;&#xFF0C;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x91C7;&#x7528;map&#x64CD;&#x4F5C;&#x3002;</p>
<p><img src="/images/pagerank2.png" width="600" height="300" alt="error" align="center"></p>
<h2 id="&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FED;&#x4EE3;&#x65F6;&#x95F4;&#x53D8;&#x957F;"><a href="#&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FED;&#x4EE3;&#x65F6;&#x95F4;&#x53D8;&#x957F;" class="headerlink" title="&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FED;&#x4EE3;&#x65F6;&#x95F4;&#x53D8;&#x957F;"></a>&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FED;&#x4EE3;&#x65F6;&#x95F4;&#x53D8;&#x957F;</h2><p>&#x2003;&#x2003;&#x8FED;&#x4EE3;&#x65F6;&#x95F4;&#x53D8;&#x957F;&#x662F;&#x7531;&#x4E8E;RDD&#x7684;lazy computation&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;RDD&#x4E3A;&#x4E86;&#x9519;&#x8BEF;&#x6062;&#x590D;&#xFF0C;&#x5728;&#x8FED;&#x4EE3;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x90FD;&#x4FDD;&#x7559;&#x7740;&#x5F88;&#x957F;&#x4E14;&#x590D;&#x6742;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;(lineage dependency)&#xFF0C;&#x4E0D;&#x8FC7;&#x4E3A;&#x4EC0;&#x4E48;lineage&#x8D8A;&#x957F;&#x4F1A;&#x9020;&#x6210;&#x8FED;&#x4EE3;&#x65F6;&#x95F4;&#x8D8A;&#x957F;&#xFF0C;&#x63E3;&#x6D4B;&#x662F;&#x56E0;&#x4E3A;&#x8FED;&#x4EE3;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x5360;&#x7528;&#x5927;&#x91CF;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x592A;&#x591A;&#x4F1A;&#x53D1;&#x751F;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x3002;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E3B;&#x8981;&#x5C31;&#x662F;&#x8981;&#x61C2;&#x5F97;&#x5408;&#x7406;&#x7684;cache&#x4EE5;&#x53CA;unpersist, &#x4EC5;&#x4EC5;&#x8FD9;&#x4E9B;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x5728;&#x9002;&#x5F53;&#x7684;&#x65F6;&#x5019;&#xFF0C;truncate lineage&#x8BBE;&#x7F6E;checkpoint&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E0B;&#x9762;&#x662F;&#x6211;train pagerank&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<figure class="highlight scala"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div><div class="line">25</div><div class="line">26</div><div class="line">27</div><div class="line">28</div><div class="line">29</div><div class="line">30</div><div class="line">31</div><div class="line">32</div><div class="line">33</div><div class="line">34</div><div class="line">35</div><div class="line">36</div><div class="line">37</div><div class="line">38</div><div class="line">39</div><div class="line">40</div><div class="line">41</div><div class="line">42</div><div class="line">43</div><div class="line">44</div><div class="line">45</div><div class="line">46</div><div class="line">47</div><div class="line">48</div><div class="line">49</div><div class="line">50</div><div class="line">51</div><div class="line">52</div><div class="line">53</div><div class="line">54</div><div class="line">55</div><div class="line">56</div><div class="line">57</div><div class="line">58</div><div class="line">59</div><div class="line">60</div><div class="line">61</div><div class="line">62</div><div class="line">63</div><div class="line">64</div><div class="line">65</div><div class="line">66</div><div class="line">67</div><div class="line">68</div><div class="line">69</div><div class="line">70</div><div class="line">71</div><div class="line">72</div><div class="line">73</div><div class="line">74</div><div class="line">75</div><div class="line">76</div><div class="line">77</div><div class="line">78</div><div class="line">79</div><div class="line">80</div><div class="line">81</div><div class="line">82</div><div class="line">83</div><div class="line">84</div><div class="line">85</div><div class="line">86</div><div class="line">87</div><div class="line">88</div><div class="line">89</div><div class="line">90</div><div class="line">91</div><div class="line">92</div><div class="line">93</div><div class="line">94</div><div class="line">95</div><div class="line">96</div></pre></td><td class="code"><pre><div class="line"><span class="comment">/** Update the vertex with new pagerank.*/</span></div><div class="line"><span class="function"><span class="keyword">def</span> <span class="title">updateVertex</span></span>(id: <span class="type">VertexId</span>, attr: <span class="type">Double</span>, msg_sum: <span class="type">Double</span>): <span class="type">Double</span> = {</div><div class="line">  damping_factor * msg_sum</div><div class="line">}</div><div class="line"></div><div class="line"><span class="function"><span class="keyword">def</span> <span class="title">sum</span></span>(a: <span class="type">Double</span>, b: <span class="type">Double</span>): <span class="type">Double</span> = a + b</div><div class="line"></div><div class="line"><span class="comment">/** Send pr/out_degree with edge direction.*/</span></div><div class="line"><span class="function"><span class="keyword">def</span> <span class="title">sendPR</span></span>(e: <span class="type">EdgeContext</span>[<span class="type">Double</span>, <span class="type">Double</span>, <span class="type">Double</span>]) = {</div><div class="line">  e.sendToDst(e.srcAttr * e.attr)</div><div class="line">}</div><div class="line">  <span class="comment">/**</span></div><div class="line">   * Run pagerank algorithm with damping_factor and max_iter.</div><div class="line">   * @param g The original graph.</div><div class="line">   * @return An RDD includes all vertices&apos; id and pagerank value.</div><div class="line">   */</div><div class="line">  <span class="function"><span class="keyword">def</span> <span class="title">run</span></span>(g: <span class="type">Graph</span>[<span class="type">Double</span>, <span class="type">Double</span>]): <span class="type">PagerankModel</span> = {</div><div class="line">    <span class="type">N</span> = g.vertices.count()</div><div class="line">    <span class="comment">//Cache the outdegree to get the vertices whose outdegree is 0.</span></div><div class="line">    <span class="keyword">val</span> outdegree = g.outDegrees.cache()</div><div class="line"></div><div class="line">    <span class="comment">//Initialize the graph with its pr set 1/N and edge attr set 1/out_degree</span></div><div class="line">    <span class="keyword">var</span> graph = g.outerJoinVertices(outdegree) {</div><div class="line">      <span class="keyword">case</span> (vid, vdata, deg) =&gt; deg.getOrElse(<span class="number">0</span>)</div><div class="line">    }.mapTriplets(e =&gt; <span class="number">1.0</span> / e.srcAttr)</div><div class="line">      .mapVertices((id, attr) =&gt; <span class="number">1.0</span> / <span class="type">N</span>)</div><div class="line">      .cache()</div><div class="line"></div><div class="line">    <span class="comment">// v is a vertices set whose outdegree is &gt; 0.</span></div><div class="line">    <span class="keyword">val</span> v: <span class="type">VertexRDD</span>[<span class="type">Double</span>] = graph.vertices.innerJoin(outdegree) { (vid, <span class="type">PR</span>, deg) =&gt; <span class="type">PR</span> }</div><div class="line">    <span class="comment">// special_vertices are vertices whose outdegree is 0.</span></div><div class="line">    <span class="keyword">val</span> special_vertices = graph.vertices.subtract(v).cache()</div><div class="line">    special_vertices.checkpoint()</div><div class="line">    outdegree.unpersist(blocking = <span class="literal">false</span>)</div><div class="line"></div><div class="line">    <span class="comment">//send messages:[ pr / out_degree ].</span></div><div class="line">    <span class="comment">//aggregate messages to the same dstId.</span></div><div class="line">    <span class="keyword">var</span> messages: <span class="type">VertexRDD</span>[<span class="type">Double</span>] = graph.aggregateMessages(sendPR, sum).cache()</div><div class="line">    <span class="keyword">var</span> old_message: <span class="type">VertexRDD</span>[<span class="type">Double</span>] = <span class="literal">null</span></div><div class="line"></div><div class="line">    <span class="comment">//K is the num of vertices whose out_degree is 0.</span></div><div class="line">    <span class="type">K</span> = <span class="type">N</span> - outdegree.count()</div><div class="line">    <span class="comment">//Respectly calculate the avg_PR_deg1 for pages with out_degree</span></div><div class="line">    <span class="comment">//and avg_PR_deg0 for pages with out_degree 0.</span></div><div class="line">    <span class="keyword">var</span> avg_PR_deg1 = (<span class="number">1.0</span> - <span class="type">K</span> * <span class="number">1.0</span> / <span class="type">N</span>) / <span class="type">N</span></div><div class="line">    <span class="keyword">var</span> avg_PR_deg0 = <span class="number">1.0</span> * <span class="type">K</span> / (<span class="type">N</span> * <span class="type">N</span>)</div><div class="line"></div><div class="line">    <span class="keyword">var</span> preG: <span class="type">Graph</span>[<span class="type">Double</span>, <span class="type">Double</span>] = <span class="literal">null</span></div><div class="line">    <span class="keyword">val</span> times = <span class="keyword">new</span> <span class="type">ArrayBuffer</span>[<span class="type">Double</span>]()</div><div class="line">    <span class="keyword">var</span> iter = <span class="number">0</span></div><div class="line">    <span class="keyword">while</span> (iter &lt; max_iter) {</div><div class="line">      <span class="keyword">val</span> timer = <span class="keyword">new</span> <span class="type">Timer</span>()</div><div class="line">      <span class="keyword">val</span> new_PR: <span class="type">VertexRDD</span>[<span class="type">Double</span>] = graph.vertices</div><div class="line">        .innerJoin(messages)(updateVertex).cache()</div><div class="line">      preG = graph</div><div class="line"></div><div class="line">      <span class="comment">//update tht pagerank value.</span></div><div class="line">      graph = graph.outerJoinVertices(new_PR) {</div><div class="line">        <span class="keyword">case</span> (vid, old_PR, new_opt) =&gt; new_opt.getOrElse(<span class="number">0.0</span>)</div><div class="line">      }.mapVertices {</div><div class="line">        (id, <span class="type">PR</span>) =&gt; <span class="type">PR</span> + avg_PR_deg1 * (<span class="number">1</span> - damping_factor) + avg_PR_deg0</div><div class="line">      }.cache()</div><div class="line">      graph.vertices.foreachPartition(f =&gt; {})</div><div class="line">      graph.checkpoint()</div><div class="line"></div><div class="line">      old_message = messages</div><div class="line">      messages = graph.aggregateMessages(sendPR, sum).cache()</div><div class="line"></div><div class="line">      <span class="comment">//all pagerank value sum.</span></div><div class="line">      <span class="keyword">val</span> sum_PR: <span class="type">Double</span> = graph.vertices.map { <span class="keyword">case</span> (id, attr) =&gt; attr }.sum()</div><div class="line">      <span class="comment">//pagerank sum for those vertices whose outdegree is 0.</span></div><div class="line">      <span class="keyword">val</span> sum0_PR = graph.vertices.innerJoin(special_vertices) {</div><div class="line">        <span class="keyword">case</span> (id, pr, zero) =&gt; pr</div><div class="line">      }.map {</div><div class="line">        <span class="keyword">case</span> (id, attr) =&gt; attr</div><div class="line">      }.sum()</div><div class="line"></div><div class="line">      avg_PR_deg1 = (sum_PR - sum0_PR) / <span class="type">N</span></div><div class="line">      avg_PR_deg0 = sum0_PR / <span class="type">N</span></div><div class="line"></div><div class="line">      iter = iter + <span class="number">1</span></div><div class="line">      <span class="keyword">val</span> cost_time = timer.cost()</div><div class="line">      times.append(cost_time)</div><div class="line">      <span class="keyword">val</span> msg = <span class="type">Msg</span>(<span class="string">s&quot;iter &quot;</span> -&gt; iter, <span class="string">s&quot;cost_time(ms)&quot;</span> -&gt; cost_time)</div><div class="line">      logInfo(msg.toString)</div><div class="line"></div><div class="line">      old_message.unpersist(blocking = <span class="literal">false</span>)</div><div class="line">      preG.unpersist(blocking = <span class="literal">false</span>)</div><div class="line">      new_PR.unpersist(blocking = <span class="literal">false</span>)</div><div class="line">    }</div><div class="line">    <span class="keyword">val</span> avg_time = times.sum / iter</div><div class="line">    logInfo(<span class="string">s&quot;average iteration time is: <span class="subst">$avg_time</span> ms.\n&quot;</span>)</div><div class="line">    <span class="keyword">val</span> <span class="type">PR</span>: <span class="type">RDD</span>[(<span class="type">VertexId</span>, <span class="type">Double</span>)] = graph.vertices</div><div class="line">    <span class="keyword">val</span> prmodel = <span class="keyword">new</span> <span class="type">PagerankModel</span>(<span class="type">PR</span>)</div><div class="line">    prmodel</div><div class="line">  }</div></pre></td></tr></table></figure>
<h1 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h1><p>&#x2003;&#x2003;pagerank&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x6536;&#x655B;&#x5F88;&#x5FEB;&#x5F97;&#x7B97;&#x6CD5;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0A;&#x9762;&#x6D4B;&#x8BD5;&#x7684;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x56FE;&#xFF0C;&#x89C4;&#x6A21;&#x8FD8;&#x662F;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x8FED;&#x4EE3;15&#x6B21;&#x4EE5;&#x540E;&#xFF0C;top50&#x7684;users &#x57FA;&#x672C;&#x8DDF;&#x67D0;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#x4E2D;&#x6B21;&#x5E8F;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x3002;&#x5728;&#x6548;&#x679C;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x8981;&#x4FDD;&#x8BC1;topK&#x7528;&#x6237;&#x7684;&#x6B21;&#x5E8F;&#xFF0C;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x4E0D;&#x7528;&#x5F88;&#x591A;&#xFF1B;&#x5728;&#x6548;&#x7387;&#x4E0A;&#x770B;&#xFF0C;&#x5982;&#x679C;&#x56FE;&#x4E0D;&#x662F;&#x5F88;&#x5927;&#xFF0C;&#x8BBE;&#x7F6E;checkpoint&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x90A3;&#x4E48;&#x9891;&#x7E41;&#xFF0C;&#x6BD4;&#x5982;&#x8FED;&#x4EE3;&#x4E24;&#x4E09;&#x6B21;&#x5199;&#x4E00;&#x6B21;hdfs&#x4E5F;&#x884C;&#xFF0C;&#x53E6;&#x5916;&#x5728;spark&#x5BF9;&#x56FE;&#x8FDB;&#x884C;partition&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5E94;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x901A;&#x4FE1;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6709;&#x540C;&#x6837;srcID&#x7684;&#x88AB;&#x5206;&#x5230;&#x540C;&#x4E00;&#x4E2A;partition&#x4E2D;&#xFF0C;spark Graphx&#x4E2D;&#x6709;&#x76F8;&#x5E94;&#x7684;API&#xFF0C;PartitionStrategy.EdgePartition2D&#x3002;</p>
<p>&#x2003;&#x2003;&#x4E0A;&#x56FE;&#x4E2D;&#x7684;pagerank&#x5206;&#x522B;&#x4E3A;&#xFF1A;</p>
<p><img src="/images/pagerank3.png" width="100" height="150" alt="error" align="center"></p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2016/11/17/岛上书店/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="Li Ping">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Dare To Think, Strive To Execute">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Dare To Think, Strive To Execute" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/11/17/岛上书店/" itemprop="url">
                  岛上书店
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-11-17T20:27:58+08:00">
                2016-11-17
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="&#x662F;&#x8FDF;&#x949D;&#x7684;&#x611F;&#x53D7;&#x8BA9;&#x5C81;&#x6708;&#x5306;&#x5306;"><a href="#&#x662F;&#x8FDF;&#x949D;&#x7684;&#x611F;&#x53D7;&#x8BA9;&#x5C81;&#x6708;&#x5306;&#x5306;" class="headerlink" title="&#x662F;&#x8FDF;&#x949D;&#x7684;&#x611F;&#x53D7;&#x8BA9;&#x5C81;&#x6708;&#x5306;&#x5306;"></a>&#x662F;&#x8FDF;&#x949D;&#x7684;&#x611F;&#x53D7;&#x8BA9;&#x5C81;&#x6708;&#x5306;&#x5306;</h1><p>&#x2003;&#x2003;&#x7EC6;&#x817B;&#x7684;&#x611F;&#x89C9;&#x4E5F;&#x662F;&#x751F;&#x6D3B;&#x4E30;&#x5BCC;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x603B;&#x63D0;&#x9192;&#x81EA;&#x5DF1;&#x8FD8;&#x8BB0;&#x5F97;&#x5C0F;&#x5B66;&#x65F6;&#x5019;&#x6BCF;&#x4E00;&#x6B21;&#x5347;&#x65D7;&#x7684;&#x6CB8;&#x817E;&#x70ED;&#x60C5;&#x4E48;&#xFF0C;&#x8FD8;&#x8BB0;&#x5F97;&#x9AD8;&#x4E2D;&#x6821;&#x56ED;&#x7684;&#x6842;&#x82B1;&#x6DE1;&#x96C5;&#x7684;&#x9999;&#x6C14;&#x5728;&#x591C;&#x8272;&#x4E2D;&#x7ED9;&#x6211;&#x7684;&#x611F;&#x89C9;&#x4E48;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x957F;&#x6625;&#x6DF1;&#x591C;&#x81EA;&#x4E60;&#x56DE;&#x6765;&#x8E29;&#x7740;&#x539A;&#x539A;&#x7684;&#x79EF;&#x96EA;&#x4FB5;&#x5728;&#x660F;&#x9EC4;&#x7684;&#x706F;&#x5149;&#x4E2D;&#x770B;&#x5230;&#x706F;&#x5149;&#x4E0B;&#x98DE;&#x821E;&#x7684;&#x96EA;&#x82B1;&#x7684;&#x6837;&#x5B50;&#x4E48;&#xFF0C;&#x8FD8;&#x6709;&#x73B0;&#x5728;&#xFF0C;&#x6BCF;&#x5929;&#x665A;&#x4E0A;&#x9A91;&#x7740;&#x81EA;&#x884C;&#x8F66;&#x98DE;&#x5FEB;&#x5730;&#x4ECE;&#x4E2D;&#x5173;&#x6751;&#x4E1C;&#x8DEF;&#x98DE;&#x9A70;&#x8FC7;&#x53BB;&#xFF0C;&#x671B;&#x7740;&#x6591;&#x6593;&#x7684;&#x8F66;&#x5C3E;&#x706F;&#x4EE5;&#x53CA;&#x7EA2;&#x7EFF;&#x706F;&#xFF0C;&#x604D;&#x60DA;&#x4E2D;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x662F;&#x5728;&#x5E1D;&#x90FD;&#x3002;</p>
<p>&#x2003;&#x2003;&#x662F;&#x6211;&#x4EEC;&#x5BF9;&#x751F;&#x6D3B;&#x4E2D;&#x8FDF;&#x949D;&#x7684;&#x611F;&#x53D7;&#xFF0C;&#x4F7F;&#x5F97;&#x5C81;&#x6708;&#x5306;&#x5306;&#x3002;&#x5C24;&#x5176;&#x662F;&#x73B0;&#x5728;&#xFF0C;&#x6BCF;&#x5929;&#x6765;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x683C;&#x5B50;&#x95F4;&#xFF0C;&#x6253;&#x6C34;&#xFF0C;&#x6D47;&#x82B1;&#xFF0C;&#x6253;&#x5F00;&#x7535;&#x8111;&#xFF0C;&#x65E5;&#x590D;&#x4E00;&#x65E5;&#x91CD;&#x590D;&#x505A;&#x7740;&#x540C;&#x6837;&#x7684;&#x4E8B;&#x513F;&#xFF0C;&#x867D;&#x7136;&#x81EA;&#x5DF1;&#x6E05;&#x695A;&#x6BCF;&#x5929;&#x81EA;&#x5DF1;CPU&#x7684;&#x6D41;&#x6C34;&#x7EBF;&#x8FD8;&#x662F;&#x6EE1;&#x8D1F;&#x8377;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x5DE5;&#x4F5C;&#x5185;&#x5BB9;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x8C01;&#x80FD;&#x5206;&#x5F97;&#x6E05;&#x6628;&#x5929;&#x8DDF;&#x524D;&#x5929;&#x7684;&#x533A;&#x522B;&#x3002;</p>
<p><img src="/images/store.jpg" width="300" height="400" alt="error" align="center"></p>
<h1 id="&#x5C9B;&#x4E0A;&#x4E66;&#x5E97;"><a href="#&#x5C9B;&#x4E0A;&#x4E66;&#x5E97;" class="headerlink" title="&#x5C9B;&#x4E0A;&#x4E66;&#x5E97;"></a>&#x5C9B;&#x4E0A;&#x4E66;&#x5E97;</h1><p>&#x2003;&#x2003;&#x4E4B;&#x6240;&#x4EE5;&#x8BF4;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x60F3;&#x628A;&#x8FD9;&#x4E9B;&#x611F;&#x53D7;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x4E0D;&#x4E3A;&#x522B;&#x7684;&#xFF0C;&#x53EA;&#x4E3A;&#x8BB0;&#x5F55;&#x6211;&#x5F53;&#x65F6;&#x770B;&#x5B83;&#x7684;&#x611F;&#x89C9;&#x3002;</p>
<p>&#x2003;&#x2003;&#x8BFB;&#x5C0F;&#x8BF4;&#x9700;&#x8981;&#x5728;&#x9002;&#x5408;&#x5B83;&#x7684;&#x4EBA;&#x751F;&#x9636;&#x6BB5;&#x8BFB;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x4E8C;&#x5341;&#x5C81;&#x6709;&#x5171;&#x9E23;&#x7684;&#x4E1C;&#x897F;&#x5230;&#x4E86;&#x56DB;&#x5341;&#x5C81;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x4EA7;&#x751F;&#x5171;&#x9E23;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x4E66;&#x672C;&#x5982;&#x6B64;&#xFF0C;&#x751F;&#x6D3B;&#x4EA6;&#x5982;&#x6B64;&#x3002;</p>
<blockquote>
<p>&#x5173;&#x4E8E;&#x653F;&#x6CBB;&#x3001;&#x4E0A;&#x5E1D;&#x3001;&#x548C;&#x7231;&#xFF0C;&#x4EBA;&#x4EEC;&#x603B;&#x7231;&#x8BB2;&#x4E9B;&#x65E0;&#x804A;&#x7684;&#x8C0E;&#x8BDD;&#x3002;&#x60F3;&#x8981;&#x4E86;&#x89E3;&#x4E00;&#x4E2A;&#x4EBA;&#x4F60;&#x53EA;&#x9700;&#x95EE;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x201C;&#x4F60;&#x6700;&#x559C;&#x6B22;&#x7684;&#x4E66;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;</p>
<p>&#x5173;&#x4E8E;&#x5A5A;&#x59FB;&#xFF0C;&#x8981;&#x662F;&#x6709;&#x8C01;&#x8BA9;&#x4F60;&#x89C9;&#x5F97;&#x4F60;&#x5728;&#x4E00;&#x5C4B;&#x5B50;&#x4EBA;&#x4E2D;&#x662F;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#xFF0C;&#x5C31;&#x9009;&#x90A3;&#x4E2A;&#x4EBA;&#x5427;&#x3002;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x8FD9;&#x7BC7;&#x5C0F;&#x8BF4;&#x7ED3;&#x6784;&#x7D27;&#x51D1;&#xFF0C;&#x6E29;&#x6696;&#x4EBA;&#x5FC3;&#xFF0C;&#x5F88;&#x81EA;&#x7136;&#xFF0C;&#x5C31;&#x662F;&#x5199;&#x4E00;&#x4E2A;&#x5F88;&#x5BFB;&#x5E38;&#x7684;&#x4EBA;&#x5F88;&#x5BFB;&#x5E38;&#x7684;&#x81EA;&#x6551;&#x7684;&#x6545;&#x4E8B;&#x3002;&#x5468;&#x672B;&#x7684;&#x665A;&#x4E0A;&#xFF0C;&#x4F34;&#x7740;&#x4E66;&#x684C;&#x4E0A;&#x7684;&#x767E;&#x5408;&#x82B1;&#x9999;&#xFF0C;&#x53EA;&#x89C9;&#x5F97;&#x6B64;&#x65F6;&#x81EA;&#x5DF1;&#x662F;&#x6700;&#x5E78;&#x798F;&#x7684;&#x3002;</p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2016/11/17/Quickly-DownLoad-Resources-From-Coursera/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="Li Ping">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Dare To Think, Strive To Execute">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Dare To Think, Strive To Execute" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/11/17/Quickly-DownLoad-Resources-From-Coursera/" itemprop="url">
                  Quickly DownLoad Resources From Coursera
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-11-17T20:25:31+08:00">
                2016-11-17
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="&#x5B89;&#x88C5;coursera-dl"><a href="#&#x5B89;&#x88C5;coursera-dl" class="headerlink" title="&#x5B89;&#x88C5;coursera-dl"></a>&#x5B89;&#x88C5;coursera-dl</h1><ul>
<li>&#x8FD9;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x76F4;&#x63A5;pip install coursera-dl</li>
</ul>
<h1 id="&#x4E0B;&#x8F7D;"><a href="#&#x4E0B;&#x8F7D;" class="headerlink" title="&#x4E0B;&#x8F7D;"></a>&#x4E0B;&#x8F7D;</h1><ul>
<li><p>&#x767B;&#x9646;&#x5230;coursera&#x4E3B;&#x9875;&#xFF0C;&#x767B;&#x9646;&#x5E76;&#x4E14;enroll&#x67D0;&#x4E2A;&#x8981;&#x4E0B;&#x8F7D;&#x7684;&#x8BFE;&#x7A0B;&#x3002;</p>
</li>
<li><p>&#x8FDB;&#x5165;&#x8BFE;&#x7A0B;&#xFF0C;<a href="https://class.coursera.org/ntumltwo-001&#xFF0C;" target="_blank" rel="external">https://class.coursera.org/ntumltwo-001&#xFF0C;</a> &#x4F8B;&#x5982;&#x6211;&#x60F3;&#x4E0B;&#x8F7D;&#x6797;&#x8F69;&#x7530;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x57FA;&#x77F3;&#xFF0C;&#x5219;&#x5C06;ntumltwo-001&#x4F5C;&#x4E3A;&#x6211;&#x7684;&#x8BFE;&#x7A0B;id.</p>
</li>
<li><p>&#x4E0B;&#x8F7D;&#x547D;&#x4EE4;</p>
</li>
<li><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">coursera-dl -u myaccount -p mypasswd -d your_target_dir ntumltwo-001</div></pre></td></tr></table></figure>
</li>
</ul>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2016/11/17/Spark小白学习之路/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="Li Ping">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Dare To Think, Strive To Execute">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Dare To Think, Strive To Execute" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/11/17/Spark小白学习之路/" itemprop="url">
                  Spark小白学习之路
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-11-17T20:21:15+08:00">
                2016-11-17
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="&#x80CC;&#x666F;"><a href="#&#x80CC;&#x666F;" class="headerlink" title="&#x80CC;&#x666F;"></a>&#x80CC;&#x666F;</h1><p>&#x2003;&#x2003;&#x6700;&#x8FD1;&#x597D;&#x51E0;&#x4E2A;&#x540C;&#x5B66;&#x95EE;&#x6211;&#x600E;&#x4E48;&#x5F00;&#x59CB;&#x5B66;&#x4E60;spark, &#x867D;&#x8BF4;&#x5BF9;spark&#x7684;&#x8BA4;&#x8BC6;&#x4E5F;&#x5341;&#x5206;&#x6709;&#x9650;&#xFF0C;&#x4F46;&#x662F;&#x597D;&#x6B79;&#x63A5;&#x89E6;spark&#x4E5F;&#x6709;&#x4E00;&#x5E74;&#x534A;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x8BB0;&#x5F55;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x5B66;&#x4E60;&#x5386;&#x7A0B;&#x4EE5;&#x4FBF;&#x521D;&#x5165;&#x95E8;&#x8005;&#x4E0D;&#x81F3;&#x4E8E;&#x6700;&#x540E;&#x201C;&#x4ECE;&#x5165;&#x95E8;&#x5230;&#x653E;&#x5F03;&#x201D;&#x3002;&#x60F3;&#x60F3;&#x5F53;&#x521D;&#x81EA;&#x5DF1;&#x62B1;&#x7740;&#x201C;hadoop&#x6743;&#x5A01;&#x6307;&#x5357;&#x201D;&#x6000;&#x7740;&#x4E00;&#x5B9A;&#x8981;&#x8DDF;hadoop&#x6B7B;&#x78D5;&#x5230;&#x5E95;&#x7684;&#x60B2;&#x58EE;&#x5FC3;&#x60C5;&#xFF0C;&#x4E0D;&#x4EC5;&#x54D1;&#x7136;&#x5931;&#x7B11;&#x3002;&#x521A;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x4F1A;&#x89C9;&#x5F97;&#x9AD8;&#x5927;&#x4E0A;&#x7684;&#x4E1C;&#x897F;&#x4E0D;&#x5927;&#x597D;&#x61C2;&#xFF0C;&#x5B9E;&#x5219;&#x4E0D;&#x7136;&#x3002;&#x521A;&#x5F00;&#x59CB;&#x5927;&#x90FD;&#x662F;&#x4ECE;&#x770B;&#x4E66;&#x5F00;&#x59CB;&#x7684;&#xFF0C;&#x7406;&#x8BBA;&#x77E5;&#x8BC6;&#x53C8;&#x4F1A;&#x8BA9;&#x4EBA;&#x89C9;&#x5F97;&#x6666;&#x6DA9;&#xFF0C;&#x987F;&#x65F6;&#x6108;&#x53D1;&#x89C9;&#x5F97;&#x8FD9;&#x4E9B;&#x5206;&#x5E03;&#x5F0F;&#x6846;&#x67B6;&#x9AD8;&#x6DF1;&#x83AB;&#x6D4B;&#x4E86;&#x3002;&#x597D;&#x5728;&#x6211;&#x5B66;&#x4E60;spark&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x75DB;&#x82E6;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x8BF4;&#x5341;&#x5206;&#x70ED;&#x7231;&#x8FD9;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x5E73;&#x53F0;&#xFF0C;&#x9042;&#x5206;&#x4EAB;&#x4E0B;&#x6211;&#x7684;&#x5B66;&#x4E60;&#x5FC3;&#x5F97;&#x3002;</p>
<h1 id="&#x73AF;&#x5883;"><a href="#&#x73AF;&#x5883;" class="headerlink" title="&#x73AF;&#x5883;"></a>&#x73AF;&#x5883;</h1><h2 id="spark"><a href="#spark" class="headerlink" title="spark"></a>spark</h2><p>&#x2003;&#x2003;&#x4E0B;&#x8F7D;spark&#x7A33;&#x5B9A;&#x7248;&#x7684;binary&#x5B89;&#x88C5;&#x5305;&#xFF0C;&#x6309;&#x7167;&#x5B98;&#x65B9;&#x6587;&#x6863;&#x914D;&#x7F6E;&#x4E0B;spark_env.sh&#x7B49;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;</p>
<ul>
<li>tutorial: spark-tutorial</li>
<li>spark programming guide: programming-guide<br>&#x4E0A;&#x9762;&#x7684;&#x6559;&#x7A0B;&#x76F4;&#x63A5;&#x5728;spark-shell&#x4E2D;&#x8FD0;&#x884C;(&#x4E0D;&#x7528; IDE)&#x5C31;&#x597D;&#x4E86;&#x3002;<br>&#x5148;&#x770B;&#x4E00;&#x904D;&#x8BD5;&#x4E00;&#x904D;&#x6709;&#x4E00;&#x4E2A;&#x76F4;&#x89C2;&#x7684;&#x611F;&#x53D7;&#x3002;<h2 id="ide"><a href="#IDE" class="headerlink" title="IDE"></a>IDE</h2>&#x2003;&#x2003;intelliJ IDEA&#xFF0C;&#x8BE5;IDE&#x529F;&#x80FD;&#x5341;&#x5206;&#x5F3A;&#x5927;&#xFF0C;&#x4E0D;&#x4EC5;&#x96C6;&#x6210;&#x4E86;terminal, scala &#x7F16;&#x8BD1;&#x5668;&#xFF0C;sbt&#xFF0C; &#x7248;&#x672C;&#x63A7;&#x5236;&#x7B49;, &#x8FD8;&#x6709;&#x4EE3;&#x7801;&#x7F8E;&#x5316;&#xFF0C;&#x81EA;&#x52A8;&#x8865;&#x5168;&#x7684;&#x529F;&#x80FD;&#x3002;<br>&#x5B89;&#x88C5;intelliJ IDEA, &#x7136;&#x540E;&#x5B89;&#x88C5;sbt&#x4EE5;&#x53CA;scala&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x3002;<br><img src="/images/demo.png" width="500" height="400" alt="error" align="center"><br>&#x2003;&#x2003;&#x70B9;&#x51FB;&#x4E0B;&#x9762;&#x7684;plugin&#xFF0C;&#x641C;&#x7D22;&#x5E76;&#x5B89;&#x88C5;set&#x4EE5;&#x53CA;scala &#x63D2;&#x4EF6;&#x3002;&#x4E0D;&#x8FC7;sbt&#x7684;&#x63A7;&#x4EF6;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x5B89;&#x88C5;&#x5931;&#x8D25;&#xFF0C;&#x5982;&#x679C;&#x591A;&#x6B21;&#x5931;&#x8D25;&#xFF0C;&#x5EFA;&#x8BAE;&#x4E0B;&#x8F7D;&#x4E0B;&#x6765;&#x624B;&#x52A8;&#x5B89;&#x88C5;&#x3002;&#x81F3;&#x4E8E;sbt&#x662F;&#x505A;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x901A;&#x4FD7;&#x70B9;&#x513F;&#x7406;&#x89E3;&#x5C31;&#x662F;sbt&#x662F;&#x7BA1;&#x7406;&#x9879;&#x76EE;&#x4F9D;&#x8D56;&#x7684;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#xFF0C;spark&#x7A0B;&#x5E8F;&#x4F9D;&#x8D56;&#x5F88;&#x591A;spark&#x7684;jar&#x5305;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x914D;&#x7F6E;&#x4E86;build.sbt&#x90A3;&#x4E48;sbt&#x4F1A;&#x81EA;&#x52A8;&#x53BB;&#x8FDC;&#x7A0B;&#x5E93;&#x4E2D;&#x5E2E;&#x6211;&#x4EEC;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E9B;jar&#x5305;&#xFF0C;&#x653E;&#x5728;&#x6211;&#x4EEC;library&#x4E2D;&#x3002;sbt&#x8DDF;maven&#x529F;&#x80FD;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x662F;&#x524D;&#x8005;&#x670D;&#x52A1;&#x4E8E;scala&#xFF0C;&#x540E;&#x8005;&#x4E3B;&#x8981;&#x7528;&#x5728;java&#x9879;&#x76EE;&#x4E2D;&#x3002;<br>&#x2003;&#x2003;&#x4E0B;&#x8F7D;&#x5B8C;&#x4E86;&#x63A7;&#x4EF6;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x914D;&#x7F6E;build.sbt&#x6587;&#x4EF6;&#x3002;&#x4F60;&#x5728;idea&#x4E2D;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9996;&#x5148;&#x9879;&#x76EE;&#x4E0B;&#x9762;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;build.sbt&#x6587;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;scala&#x7A0B;&#x5E8F;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x989D;&#x5916;&#x914D;&#x7F6E;&#xFF0C;&#x5018;&#x82E5;&#x662F;spark&#x7A0B;&#x5E8F;&#xFF0C;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x5982;&#x4E0B;&#x683C;&#x5F0F;&#x6DFB;&#x52A0;&#x4F9D;&#x8D56;&#x3002;</li>
</ul>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div></pre></td><td class="code"><pre><div class="line">name := &quot;example&quot;</div><div class="line"></div><div class="line">version := &quot;0.1&quot;</div><div class="line"></div><div class="line">scalaVersion := &quot;2.10.4&quot;</div><div class="line"></div><div class="line">libraryDependencies ++= Seq(</div><div class="line">  &quot;org.apache.spark&quot; %% &quot;spark-core&quot; % &quot;1.5.2&quot;,</div><div class="line">  &quot;org.apache.spark&quot; %% &quot;spark-graphx&quot; % &quot;1.5.2&quot;,</div><div class="line">  &#x201C;org.apache.spark&quot; %% &quot;spark-streaming&quot; % &quot;1.5.2&quot;,</div><div class="line">  &quot;org.apache.spark&quot; %% &quot;spark-mllib&quot; % &quot;1.5.2&quot;,</div><div class="line">  &quot;org.apache.spark&quot; %% &quot;spark-sql&quot; % &quot;1.5.2&quot; )</div></pre></td></tr></table></figure>
<hr>
<p>&#x2003;&#x2003;&#x4E0A;&#x9762;&#x6211;&#x6DFB;&#x52A0;&#x4E86;5&#x4E2A;&#x4F9D;&#x8D56;&#xFF0C;&#x8FD9;5&#x4E2A;&#x5305;&#x90FD;&#x662F;spark&#x751F;&#x6001;&#x7684;&#x4E3B;&#x8981;&#x90E8;&#x95E8;&#xFF0C;&#x5206;&#x522B;&#x662F;spark-core&#xFF0C;&#x8FD9;&#x4E2A;&#x53EA;&#x7528;&#x7528;&#x5230;RDD&#x90FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#xFF0C;spark-graphx&#x63D0;&#x4F9B;&#x56FE;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x4EE5;&#x53CA;&#x8BA1;&#x7B97;&#x65B9;&#x9762;&#x7684;API&#xFF0C;spark-mllib&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;API&#xFF0C;spark-streaming&#x9488;&#x5BF9;&#x6D41;&#x5F0F;&#x8BA1;&#x7B97;&#xFF0C;spark-sql&#x662F;spark&#x751F;&#x6001;&#x4E0D;&#x53EF;&#x4F4E;&#x4F30;&#x7684;&#x751F;&#x529B;&#x519B;&#xFF0C;&#x56E0;&#x4E3A;spark-sql&#x652F;&#x6301;&#x591A;&#x79CD;&#x6570;&#x636E;&#x6E90;&#xFF0C;&#x53EF;&#x4EE5;&#x5904;&#x7406;hive&#xFF0C;mysql&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8F7B;&#x677E;&#x5B9E;&#x73B0;ETL&#x7684;&#x64CD;&#x4F5C;&#x3002;<br>&#x4E0A;&#x9762;&#x7684;&#x4F9D;&#x8D56;&#x5305;&#x5E76;&#x4E0D;&#x662F;&#x8D8A;&#x591A;&#x8D8A;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;sbt&#x6BCF;&#x6B21;&#x521B;&#x5EFA;&#x65B0;&#x9879;&#x76EE;&#x90FD;&#x4F1A;&#x8981;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E9B;&#x4F9D;&#x8D56;&#xFF0C;&#x4E00;&#x6765;&#x6BD4;&#x8F83;&#x6162;&#xFF0C;&#x4E8C;&#x6765;&#x6700;&#x540E;&#x7684;jar&#x5305;&#x4F1A;&#x5F88;&#x5927;&#x3002;<br>&#x8BED;&#x8A00;, scala. &#x867D;&#x8BF4;spark&#x652F;&#x6301;python, R, Java, &#x4F46;&#x662F;&#x4E00;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x7684;&#x65F6;&#x5019;&#x7528;&#x7684;&#x5C31;&#x662F;scala&#x5C31;&#x6CA1;&#x89C9;&#x5F97;scala&#x662F;&#x5B66;&#x4E60;&#x969C;&#x788D;&#xFF0C;&#x51B5;&#x4E14;scala&#x7684;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x529F;&#x80FD;&#x5728;&#x5199;map, reduce&#x51FD;&#x6570;&#x7684;&#x65F6;&#x5019;&#x771F;&#x7684;&#x5341;&#x5206;&#x4FBF;&#x6377;&#x3002;&#x53E6;&#x5916;scala&#x8DDF;java&#x53EF;&#x4EE5;&#x6DF7;&#x5408;&#x7F16;&#x7A0B;&#xFF0C;scala&#x6587;&#x4EF6;&#x4E2D;&#x53EF;&#x4EE5;import java&#x7684;&#x5305;&#x3002;<br>&#x5B66;&#x4E60;&#x8981;&#x70B9;</p>
<h2 id="driver&#x8DDF;executor&#x7684;&#x533A;&#x522B;"><a href="#driver&#x8DDF;executor&#x7684;&#x533A;&#x522B;" class="headerlink" title="driver&#x8DDF;executor&#x7684;&#x533A;&#x522B;"></a>driver&#x8DDF;executor&#x7684;&#x533A;&#x522B;</h2><p>&#x2003;&#x2003;&#x7B80;&#x5355;&#x7406;&#x89E3;&#xFF0C;driver&#x8FD0;&#x884C;&#x4E3B;&#x7A0B;&#x5E8F;&#xFF0C;&#x5982;&#x679C;&#x6709;map&#x7B49;&#x64CD;&#x4F5C;&#xFF0C;&#x90FD;&#x4EA4;&#x7ED9;executor&#x6765;&#x6267;&#x884C;&#x3002;<br>&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x6846;&#x67B6;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x8981;&#x627E;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FD9;&#x4E9B;&#x90E8;&#x5206;&#x5206;&#x7ED9;&#x5176;&#x4ED6;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x6267;&#x884C;&#xFF0C;&#x4EE5;&#x6B64;&#x6765;&#x63D0;&#x5347;&#x8FD0;&#x884C;&#x7684;&#x6548;&#x7387;&#x3002;&#x60F3;&#x5230;&#x8FD9;&#x91CC;&#x770B;&#x5230;&#x5176;&#x4ED6;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5C31;&#x4F1A;&#x6E05;&#x6670;&#x5F88;&#x591A;&#x3002;&#x5F53;&#x521D;&#x78B0;&#x5230;driver&#xFF0C;executor, master, worker&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x662F;&#x4E00;&#x5934;&#x96FE;&#x6C34;&#x3002;<br>transformation &#x8DDF; action</p>
<p>&#x2003;&#x2003;transformation&#x8DDF;action&#x90FD;&#x662F;spark&#x63D0;&#x4F9B;&#x7ED9;RDD&#x7684;API&#x7684;&#x5206;&#x7C7B;&#x3002;RDD&#x63D0;&#x4F9B;&#x7ED9;&#x5F00;&#x53D1;&#x8005;&#x7684;API&#x6709;:</p>
<ul>
<li>transformation: map, join, groupby, filter, flatmap, union, intersection, distinct&#x2026;&#x2026;</li>
<li>action: reduce, sum, first, top, collect, take&#x2026;&#x2026;</li>
<li>spark&#x662F;&#x5185;&#x5B58;&#x8BA1;&#x7B97;&#xFF0C;&#x4E5F;&#x662F;&#x61D2;&#x60F0;&#x8BA1;&#x7B97;&#xFF0C;&#x5C31;&#x662F;&#x6240;&#x6709;&#x7684;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x90FD;&#x5C3D;&#x53EF;&#x80FD;load&#x8FDB;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;transformation&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x51FA;&#x73B0;action&#x4EE5;&#x540E;&#x8BE5;action&#x4F9D;&#x8D56;&#x7684;transformation&#x624D;&#x4F1A;&#x4E00;&#x8D77;&#x6267;&#x884C;&#x3002;spark&#x5728;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x4F1A;&#x4E00;&#x76F4;&#x4FDD;&#x5B58;RDD&#x7684;&#x4F9D;&#x8D56;&#x4FE1;&#x606F;&#xFF0C;&#x4E5F;&#x53EB;&#x8840;&#x7F18;&#xFF08;lineage)&#x3002;&#x5F53;&#x7136;&#x5982;&#x679C;&#x662F;&#x8FED;&#x4EE3;&#x7B97;&#x6CD5;&#xFF0C;&#x9700;&#x8981;&#x597D;&#x597D;&#x8003;&#x8651;&#x600E;&#x4E48;&#x4F18;&#x5316;&#xFF0C;&#x90FD;&#x5219;&#x4F1A;&#x51FA;&#x73B0;OOM&#x3002;</li>
</ul>
<h2 id="&#x7B80;&#x5355;&#x7684;spark&#x7A0B;&#x5E8F;-wordcount"><a href="#&#x7B80;&#x5355;&#x7684;spark&#x7A0B;&#x5E8F;-wordcount" class="headerlink" title="&#x7B80;&#x5355;&#x7684;spark&#x7A0B;&#x5E8F; wordcount"></a>&#x7B80;&#x5355;&#x7684;spark&#x7A0B;&#x5E8F; wordcount</h2><figure class="highlight scala"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div></pre></td><td class="code"><pre><div class="line"><span class="keyword">import</span> org.apache.spark.<span class="type">SparkConf</span></div><div class="line"><span class="keyword">import</span> org.apache.spark.<span class="type">SparkContext</span></div><div class="line"></div><div class="line"><span class="class"><span class="keyword">object</span> <span class="title">wordcount</span> </span>{</div><div class="line"></div><div class="line">  <span class="function"><span class="keyword">def</span> <span class="title">main</span></span>(args: <span class="type">Array</span>[<span class="type">String</span>]) {</div><div class="line">    <span class="keyword">val</span> conf = <span class="keyword">new</span> <span class="type">SparkConf</span>().setAppName(<span class="string">&quot;wordcount&quot;</span>).setMaster(<span class="string">&quot;local[2]&quot;</span>)</div><div class="line">    <span class="keyword">val</span> sc = <span class="keyword">new</span> <span class="type">SparkContext</span>(conf)</div><div class="line">    sc.textFile(<span class="string">&quot;text&quot;</span>).flatMap{ s =&gt; s.split(<span class="string">&quot;\\s+&quot;</span>)}.map{word =&gt; (word, <span class="number">1</span>)}.reduceByKey(_ + _).foreach(println)</div><div class="line">    sc.stop()</div><div class="line">  }</div><div class="line">}</div></pre></td></tr></table></figure>
<p>&#x2003;&#x2003;&#x5904;&#x7406;&#x5C0F;&#x6570;&#x636E;&#x91CF;&#x7684;&#x7A0B;&#x5E8F;&#x5728;idea&#x5C31;&#x53EF;&#x4EE5;&#x80DC;&#x4EFB;(&#x6307;&#x5B9A;master&#x4E3A;local)&#xFF0C; &#x6570;&#x636E;&#x91CF;&#x5F88;&#x5927;&#x7684;&#x60C5;&#x51B5;&#x53EF;&#x4EE5;&#x6253;&#x6210;jar&#x5305;&#x4E0A;&#x4F20;&#x5230;spark&#x96C6;&#x7FA4;&#x4E2D;&#x8FD0;&#x884C;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div></pre></td><td class="code"><pre><div class="line">output=hdfs://bda00:8020/user/xx/hive_table</div><div class="line">table=test</div><div class="line"></div><div class="line">function run {</div><div class="line">    hadoop fs -rm $output</div><div class="line">    spark-submit \</div><div class="line">        --executor-memory 5G \</div><div class="line">        --master &quot;spark://hostname:7077&quot; \</div><div class="line">        --class &quot;sparksql.reader.HiveReader&quot; \</div><div class="line">        --conf &quot;spark.cores.max=10&quot; \</div><div class="line">        jarName.jar \</div><div class="line">        --output_pt $output \</div><div class="line">        --table src </div><div class="line">    }   </div><div class="line">run</div></pre></td></tr></table></figure>
<p>&#x2003;&#x2003;&#x8FD9;&#x4E2A;jar&#x5305;&#x4E4B;&#x524D;&#x7684;&#x662F;spark&#x73AF;&#x5883;&#x53C2;&#x6570;&#xFF0C;&#x4F8B;&#x5982;executor&#x7684;core&#x6570;&#x76EE;&#xFF0C;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x7B49;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x8FD8;&#x53EF;&#x4EE5;&#x4F20;&#x5165;&#x4F9D;&#x8D56;&#x7684;jar&#x5305;&#x7B49;&#x3002;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x8BE6;&#x89C1;, spark_submit_application.&#x2013;class&#x6307;&#x5B9A;spark&#x7A0B;&#x5E8F;&#x4E3B;&#x7C7B;&#x3002;</p>
<p>&#x2003;&#x2003;spark&#x7A0B;&#x5E8F;&#x7684;&#x53C2;&#x6570;&#x662F;&#x4F7F;&#x7528;&#x4E86;scopt&#x6765;&#x5B9E;&#x73B0;&#x8BFB;&#x53C2;&#x6570;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x7F8E;&#x89C2;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x53C2;&#x6570;&#x68C0;&#x67E5;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x53C2;&#x8003;java&#x7A0B;&#x5E8F;&#x7684;&#x4F20;&#x53C2;&#x65B9;&#x6CD5;&#xFF08;&#x8C8C;&#x4F3C;&#x5C31;&#x662F;jar&#x5305;&#x540E;&#x9762;&#x7A7A;&#x683C;&#x9694;&#x5F00;)&#x5C31;&#x597D;&#x3002;</p>
<h1 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h1><p>&#x2003;&#x2003;&#x5B9E;&#x8DF5;&#x662F;&#x4E86;&#x89E3;spark&#x6700;&#x76F4;&#x63A5;&#x6700;&#x6709;&#x6548;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8FDB;&#x4E00;&#x6B65;&#x4E86;&#x89E3;spark&#xFF0C;&#x5B9E;&#x8DF5;&#x8FD9;&#x4E9B;&#x6587;&#x6863;&#x4E2D;&#x7684;&#x4F8B;&#x5B50;&#x8FD8;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x518D;&#x770B;&#x4E00;&#x4E9B;&#x76F8;&#x5173;&#x7684;&#x6280;&#x672F;&#x4E66;&#x7C4D;&#x6216;&#x8005;&#x535A;&#x5BA2;&#x80AF;&#x5B9A;&#x662F;&#x975E;&#x5E38;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5BF9;spark&#x6709;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x518D;&#x4E86;&#x89E3;&#x5B83;&#x5C31;&#x4E0D;&#x4F1A;&#x90A3;&#x4E48;&#x6050;&#x60E7;&#x4E86;&#x3002;</p>
<p>&#x2003;&#x2003;&#x53E6;&#x5916;&#x8865;&#x5145;&#x4E00;&#x4E9B;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#x7684;&#x8FDB;&#x9636;&#x8D44;&#x6599;&#xFF0C;&#x5F53;&#x7136;&#x6700;&#x597D;&#x7684;&#x8FD8;&#x662F;&#x5B98;&#x65B9;&#x6587;&#x6863;&#xFF1A;</p>
<ul>
<li><a href="http://dongxicheng.org/framework-on-yarn/apache-spark-shuffle-details" target="_blank" rel="external">http://dongxicheng.org/framework-on-yarn/apache-spark-shuffle-details</a></li>
<li><a href="http://blog.sina.com.cn/s/blog_4d1426660102v3pt.html" target="_blank" rel="external">http://blog.sina.com.cn/s/blog_4d1426660102v3pt.html</a></li>
<li><a href="http://blog.sina.com.cn/s/blog_4d1426660102v5u2.html" target="_blank" rel="external">http://blog.sina.com.cn/s/blog_4d1426660102v5u2.html</a></li>
</ul>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2016/11/17/Tensorflow-Mac/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="Li Ping">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Dare To Think, Strive To Execute">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Dare To Think, Strive To Execute" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2016/11/17/Tensorflow-Mac/" itemprop="url">
                  Tensorflow Mac
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-11-17T20:17:58+08:00">
                2016-11-17
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h1 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h1><p>&#x6700;&#x8FD1;&#x627E;&#x5DE5;&#x4F5C;&#xFF0C;&#x597D;&#x4E45;&#x90FD;&#x6CA1;&#x78B0;&#x535A;&#x5BA2;&#x4E86;&#xFF0C;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#x65B0;&#x4E1C;&#x897F;&#xFF0C;&#x53EA;&#x662F;&#x5404;&#x79CD;&#x5FD9;&#x4E71;&#x4E00;&#x76F4;&#x6CA1;&#x7A7A;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x54CD;&#x5E94;&#x901F;&#x5EA6;&#x8D8A;&#x6765;&#x8D8A;&#x5DEE;&#xFF0C;&#x4E5F;&#x5C31;&#x66F4;&#x52A0;&#x6CA1;&#x6709;&#x4E4B;&#x524D;&#x7684;&#x7CBE;&#x5FC3;&#x7EC6;&#x81F4;&#x3002;&#x597D;&#x4E0D;&#x5BB9;&#x6613;&#x6765;&#x4E00;&#x6B21;&#xFF0C;&#x6545;&#x5C06;&#x4ECA;&#x5929;&#x7684;bug&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7559;&#x4E0B;&#x3002;</p>
<h1 id="&#x95EE;&#x9898;&#x73AF;&#x5883;"><a href="#&#x95EE;&#x9898;&#x73AF;&#x5883;" class="headerlink" title="&#x95EE;&#x9898;&#x73AF;&#x5883;"></a>&#x95EE;&#x9898;&#x73AF;&#x5883;</h1><p>&#x6211;&#x662F;&#x5728;mac&#x4E0A;&#x91C7;&#x7528;pip &#x5B89;&#x88C5;tensorflow&#x7684;&#xFF0C;python&#x73AF;&#x5883;&#x662F;2.7&#xFF0C;&#x9047;&#x5230;&#x7684;bug&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<p><img src="/images/mac.jpg" width="600" height="300" alt="error" align="center"></p>
<h1 id="&#x89E3;&#x51B3;&#x65B9;&#x6848;"><a href="#&#x89E3;&#x51B3;&#x65B9;&#x6848;" class="headerlink" title="&#x89E3;&#x51B3;&#x65B9;&#x6848;"></a>&#x89E3;&#x51B3;&#x65B9;&#x6848;</h1><p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6211;&#x662F;&#x67E5;&#x627E;&#x5230;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#xFF1A;python&#x5B89;&#x88C5;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x9700;&#x8981;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">pip install --upgrade setuptools</div></pre></td></tr></table></figure>
<p>&#x95EE;&#x9898;&#x662F;setuptools&#x8FD9;&#x4E2A;&#x5305;&#x627E;&#x4E0D;&#x5230;&#xFF0C;&#x63A5;&#x7740;&#x91CD;&#x65B0;&#x5B89;&#x88C5;tf&#x5373;&#x53EF;&#x3002;</p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
  </section>

  
  <nav class="pagination">
    <span class="page-number current">1</span><a class="page-number" href="/page/2/">2</a><a class="page-number" href="/page/3/">3</a><a class="extend next" rel="next" href="/page/2/"><i class="fa fa-angle-right"></i></a>
  </nav>



          </div>
          


          

        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.png"
               alt="Li Ping" />
          <p class="site-author-name" itemprop="name">Li Ping</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">22</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">9</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Li Ping</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Muse
  </a>
</div>


        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  

  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	




  
  

  
  
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
          processEscapes: true,
          skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
        }
      });
    </script>

    <script type="text/x-mathjax-config">
      MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for (i=0; i < all.length; i += 1) {
          all[i].SourceElement().parentNode.className += ' has-jax';
        }
      });
    </script>
    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
  


  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config({"tex2jax":{"inlineMath":[["$","$"],["\\(","\\)"]],"skipTags":["script","noscript","style","textarea","pre","code"],"processEscapes":true},"TeX":{"equationNumbers":{"autoNumber":"AMS"}}});
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->


  


</body>
</html>
