<!doctype html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head>
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="感悟," />





  <link rel="alternate" href="/atom.xml" title="Dare To Think, Strive To Execute" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="&amp;#x2003;&amp;#x2003;&amp;#x524D;&amp;#x4E00;&amp;#x6BB5;&amp;#x65F6;&amp;#x95F4;&amp;#x53C2;&amp;#x52A0;&amp;#x4E00;&amp;#x4E2A;&amp;#x7535;&amp;#x4FE1;&amp;#x4E3E;&amp;#x529E;&amp;#x7684;&amp;#x5929;&amp;#x7FFC;&amp;#x676F;&amp;#x5927;&amp;#x6570;&amp;#x636E;&amp;#x6BD4;&amp;#x8D5B;&amp;#xFF0C;">
<meta property="og:type" content="article">
<meta property="og:title" content="当我写分布式算法的时候在想些什么">
<meta property="og:url" content="http://yoursite.com/2016/11/17/当我写分布式算法的时候在想些什么/index.html">
<meta property="og:site_name" content="Dare To Think, Strive To Execute">
<meta property="og:description" content="&amp;#x2003;&amp;#x2003;&amp;#x524D;&amp;#x4E00;&amp;#x6BB5;&amp;#x65F6;&amp;#x95F4;&amp;#x53C2;&amp;#x52A0;&amp;#x4E00;&amp;#x4E2A;&amp;#x7535;&amp;#x4FE1;&amp;#x4E3E;&amp;#x529E;&amp;#x7684;&amp;#x5929;&amp;#x7FFC;&amp;#x676F;&amp;#x5927;&amp;#x6570;&amp;#x636E;&amp;#x6BD4;&amp;#x8D5B;&amp;#xFF0C;">
<meta property="og:updated_time" content="2016-11-17T11:29:03.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="当我写分布式算法的时候在想些什么">
<meta name="twitter:description" content="&amp;#x2003;&amp;#x2003;&amp;#x524D;&amp;#x4E00;&amp;#x6BB5;&amp;#x65F6;&amp;#x95F4;&amp;#x53C2;&amp;#x52A0;&amp;#x4E00;&amp;#x4E2A;&amp;#x7535;&amp;#x4FE1;&amp;#x4E3E;&amp;#x529E;&amp;#x7684;&amp;#x5929;&amp;#x7FFC;&amp;#x676F;&amp;#x5927;&amp;#x6570;&amp;#x636E;&amp;#x6BD4;&amp;#x8D5B;&amp;#xFF0C;">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/2016/11/17/当我写分布式算法的时候在想些什么/"/>





  <title> 当我写分布式算法的时候在想些什么 | Dare To Think, Strive To Execute </title><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <!-- hexo-inject:begin --><!-- hexo-inject:end --><div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Dare To Think, Strive To Execute</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-sitemap">
          <a href="/sitemap.xml" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-sitemap"></i> <br />
            
            Sitemap
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2016/11/17/当我写分布式算法的时候在想些什么/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="Li Ping">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Dare To Think, Strive To Execute">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Dare To Think, Strive To Execute" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                当我写分布式算法的时候在想些什么
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-11-17T19:28:02+08:00">
                2016-11-17
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x2003;&#x2003;&#x524D;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x53C2;&#x52A0;&#x4E00;&#x4E2A;&#x7535;&#x4FE1;&#x4E3E;&#x529E;&#x7684;&#x5929;&#x7FFC;&#x676F;&#x5927;&#x6570;&#x636E;&#x6BD4;&#x8D5B;&#xFF0C;&#x8BA9;&#x6211;&#x597D;&#x751F;&#x53CD;&#x601D;&#x4E86;&#x81EA;&#x5DF1;&#x524D;&#x534A;&#x5E74;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5F53;&#x5929;&#x665A;&#x4E0A;&#x6211;&#x96BE;&#x8FC7;&#x5F97;&#x5931;&#x7720;&#x4E86;&#x534A;&#x5BBF;&#x3002;&#x8FD9;&#x534A;&#x5E74;&#x6211;&#x603B;&#x5171;&#x5199;&#x4E86;&#x4E94;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7B97;&#x6CD5;&#xFF0C;&#x6D89;&#x53CA;&#x4E86;&#x56FE;&#x8BA1;&#x7B97;&#x3001;&#x77E9;&#x9635;&#x5206;&#x89E3;&#x3001;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF0C;&#x4ECE;&#x6570;&#x91CF;&#x4E0A;&#x8BB2;&#x4E0D;&#x7B97;&#x5C11;&#xFF0C;&#x5C0F;&#x8F89;&#x8001;&#x5E08;&#x8DDF;&#x6211;&#x4EEC;&#x8BF4;&#x6211;&#x4EEC;&#x7684;BDALib&#x5DF2;&#x7ECF;&#x6709;30000&#x591A;&#x884C;&#x4EE3;&#x7801;&#x4E86;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x6211;&#x7684;&#x8D21;&#x732E;&#xFF0C;5000&#x884C;&#x5E94;&#x8BE5;&#x8FD8;&#x662F;&#x6709;&#x7684;&#xFF0C;scala&#x672C;&#x8EAB;&#x662F;&#x6BD4;&#x8F83;&#x7CBE;&#x70BC;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x53E6;&#x5916;&#x6BCF;&#x6B21;&#x5199;&#x5B8C;&#x8FD8;&#x6709;code review&#xFF0C;&#x6211;&#x5BF9;&#x8FD9;&#x4E2A;&#x6570;&#x91CF;&#x8FD8;&#x662F;&#x633A;&#x6EE1;&#x610F;&#x7684;&#x3002;&#x53EF;&#x662F;&#x5F53;&#x6211;&#x9700;&#x8981;&#x7528;&#x5230;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7ADF;&#x7136;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x53EF;&#x9760;&#xFF0C;&#x8981;&#x4E0D;&#x662F;&#x6570;&#x636E;&#x91CF;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x89C4;&#x6A21;&#xFF0C;&#x6211;&#x662F;&#x51B3;&#x8BA1;&#x4E0D;&#x613F;&#x610F;&#x7528;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x7B97;&#x6CD5;&#x7684;&#x3002;&#x540C;&#x6837;&#x662F;&#x5B9E;&#x73B0;&#x4E86;Factorization Machine, &#x5C3D;&#x7BA1;&#x6211;&#x66F4;&#x6E05;&#x695A;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x7B97;&#x6CD5;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x8FD8;&#x662F;&#x66F4;&#x613F;&#x610F;&#x7528;LibFM&#x3002;&#x5F53;&#x6211;&#x62B1;&#x7740;&#x8BD5;&#x8BD5;&#x7684;&#x6001;&#x5EA6;&#x7528;&#x6211;&#x7684;&#x7B97;&#x6CD5;&#x5305;&#x8DD1;&#x4E0A;G&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E2D;&#x9014;&#x679C;&#x771F;&#x662F;&#x5D29;&#x6E83;&#x4E86;&#xFF0C;&#x6211;&#x611F;&#x89C9;&#x6211;&#x88AB;&#x8FD9;&#x610F;&#x6599;&#x4E4B;&#x4E2D;&#x7684;&#x4E8B;&#x5B9E;&#x7529;&#x4E86;&#x4E00;&#x8BB0;&#x54CD;&#x4EAE;&#x7684;&#x8033;&#x5149;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5F53;&#x5929;&#x665A;&#x4E0A;&#x6211;&#x5C31;&#x4E00;&#x76F4;&#x53CD;&#x601D;&#x6211;&#x5199;BDALib&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x4ECE;&#x6211;&#x7684;&#x89D2;&#x5EA6;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x6DF1;&#x5165;&#x5730;&#x77E5;&#x9053;&#x4E86;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x66F4;&#x52A0;&#x719F;&#x6089;&#x4E86;spark&#x4EE5;&#x53CA;Pregel&#x7B49;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4EE5;&#x53CA;&#x5206;&#x5E03;&#x5F0F;&#x6846;&#x67B6;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x63D0;&#x9AD8;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x7528;&#x5728;&#x5E74;&#x672B;&#x5DE5;&#x4F5C;&#x6C47;&#x62A5;&#x5927;boss&#x7684;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x63D0;&#x5347;&#x662F;&#x5F88;&#x660E;&#x663E;&#x7684;&#x3002;&#x53EF;&#x662F;&#xFF0C;&#x6211;&#x4E5F;&#x89C9;&#x5F97;&#x5199;&#x4E86;&#x82E5;&#x5E72;&#x7B97;&#x6CD5;&#xFF0C;&#x53EA;&#x6709;&#x4E3A;&#x6570;&#x4E0D;&#x591A;&#x7684;&#x80FD;&#x7ECF;&#x5F97;&#x8D77;&#x4E0A;&#x4EBF;&#x89C4;&#x6A21;&#x6570;&#x636E;&#xFF0C;&#x9C81;&#x68D2;&#x6027;&#x4E0D;&#x53EF;&#x77E5;&#xFF0C;&#x4E5F;&#x662F;&#x4EF6;&#x6781;&#x5176;&#x60B2;&#x54C0;&#x7684;&#x4E8B;&#x513F;&#x3002;&#x6211;&#x60F3;&#x5982;&#x679C;&#x6709;&#x4E00;&#x5929;&#x522B;&#x4EBA;&#x95EE;&#x6211;&#xFF0C;&#x6211;&#x7684;&#x90A3;&#x4E9B;&#x57FA;&#x4E8E;spark&#x5E73;&#x53F0;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5982;&#x4F55;&#x7684;&#x9002;&#x5408;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x62CD;&#x62CD;&#x80F8;&#x812F;&#x544A;&#x8BC9;&#x4ED6;&#xFF0C;&#x5982;&#x679C;&#x54EA;&#x4E00;&#x5929;&#x5728;&#x4E00;&#x4E2A;&#x573A;&#x5408;&#x53EF;&#x4EE5;&#x7528;&#x5230;&#x5979;&#xFF0C;&#x6211;&#x4F1A;&#x6BEB;&#x4E0D;&#x72B9;&#x8C6B;&#x7684;&#x9009;&#x62E9;&#x81EA;&#x5DF1;&#x7684;&#x7B97;&#x6CD5;&#x5305;&#xFF0C;&#x90A3;&#x6837;&#x6211;&#x5C31;&#x77E5;&#x8DB3;&#x4E86;&#x3002;&#x5199;&#x591A;&#x4E86;&#x90A3;&#x79CD;&#x5199;&#x5B8C;&#x4E86;&#x8FC7;&#x4E24;&#x5929;&#x5C31;&#x6CA1;&#x7528;&#x7684;&#x5783;&#x573E;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#x5185;&#x5FC3;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x9119;&#x89C6;&#x3002;&#x5F53;&#x81EA;&#x5DF1;&#x5728;&#x4E0D;&#x65AD;&#x6210;&#x957F;&#x5730;&#x540C;&#x65F6;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x5B9E;&#x771F;&#x662F;&#x8BA9;&#x6211;&#x8D8A;&#x6765;&#x8D8A;&#x4E0D;&#x80FD;&#x6DE1;&#x5B9A;&#x4E86;&#x3002;</p>
<p>&#x2003;&#x2003;&#x8FD9;&#x91CC;&#x6211;&#x60F3;&#x8D77;&#x4E86;&#x81EA;&#x5DF1;&#x66FE;&#x7ECF;&#x5199;&#x7684;&#x4E00;&#x4E2A;&#x611F;&#x609F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5927;&#x90E8;&#x5206;&#x4E8B;&#x513F;&#xFF0C;&#x4E0D;&#x597D;&#x597D;&#x575A;&#x6301;&#x4E0B;&#x6765;&#x610F;&#x4E49;&#x4E0D;&#x5927;&#xFF0C;&#x6BD4;&#x5982;&#x5B66;&#x4E86;&#x4E00;&#x5E74;&#x5C31;&#x6CA1;&#x600E;&#x4E48;&#x7528;&#x5FC3;&#x7684;&#x6444;&#x5F71;&#xFF0C;&#x6BD4;&#x5982;&#x5076;&#x5C14;&#x60F3;&#x8D77;&#x6765;&#x4F1A;&#x53BB;&#x6E38;&#x6CF3;&#x5065;&#x8EAB;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x65F6;&#x5174;&#x8D77;&#x624D;&#x4F1A;&#x770B;&#x770B;&#x7684;&#x4E25;&#x8083;&#x4E66;&#x7C4D;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x591A;&#x5927;&#x7528;&#xFF1B;&#x56E0;&#x4E3A;&#x6211;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x8BF4;&#x81EA;&#x5DF1;&#x4F1A;&#x6444;&#x5F71;&#xFF0C;&#x53EA;&#x597D;&#x8BF4;&#x6211;&#x4F1A;&#x7528;&#x5355;&#x53CD;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x8BF4;&#x6211;&#x5065;&#x8EAB;&#xFF0C;&#x6216;&#x8005;&#x6211;&#x7684;&#x8EAB;&#x4F53;&#x5E76;&#x6CA1;&#x6709;&#x5F88;&#x5927;&#x7684;&#x6539;&#x5584;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x5E76;&#x4E0D;&#x600E;&#x4E48;&#x5065;&#x8EAB;&#xFF1B;&#x6211;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x8BF4;&#x6211;&#x4E86;&#x89E3;&#x653F;&#x6CBB;&#xFF0C;&#x901A;&#x6653;&#x5386;&#x53F2;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x53EA;&#x662F;&#x77E5;&#x9053;&#x4E00;&#x4E9B;&#x8FB9;&#x89D2;&#x6599;&#x7F62;&#x4E86;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5F53;&#x6211;&#x79BB;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x65E5;&#x5B50;&#x8D8A;&#x6765;&#x8D8A;&#x8FD1;&#xFF0C;&#x5F53;&#x77E5;&#x9053;&#x6211;&#x4E0D;&#x61C2;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x66F4;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x80FD;&#x575A;&#x6301;&#x81EA;&#x5DF1;&#x7684;&#x521D;&#x8877;&#xFF0C;&#x5199;&#x4E00;&#x4E2A;&#x9C81;&#x68D2;&#x3001;&#x6027;&#x80FD;&#x4E0D;&#x9519;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x5F3A;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7B97;&#x6CD5;&#x7684;&#x610F;&#x4E49;&#x8FDC;&#x6BD4;&#x8349;&#x7387;&#x5730;&#x5199;&#x597D;&#x591A;&#x5768;&#x5783;&#x573E;&#x4EE3;&#x7801;&#x5F3A;&#x7684;&#x591A;&#x3002;&#x5199;&#x4EE3;&#x7801;&#x771F;&#x7684;&#x662F;&#x4E2A;&#x7CBE;&#x96D5;&#x7EC6;&#x7422;&#x7684;&#x6D3B;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x5199;&#x597D;&#x4E86;&#xFF0C;&#x6D4B;&#x8BD5;&#x4E5F;&#x662F;&#x4EF6;&#x4E0D;&#x5BB9;&#x5FFD;&#x89C6;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x60F3;&#x60F3;&#x5F53;&#x521D;&#x6211;&#x8DDF;&#x5927;boss&#x4FE1;&#x8A93;&#x65E6;&#x65E6;&#x5730;&#x8BF4;&#x6211;&#x4EEC;&#x7684;BDALib&#x6709;code review&#xFF0C;&#x6709;&#x7B97;&#x6CD5;&#x7684;&#x8BBE;&#x8BA1;&#x6587;&#x6863;&#xFF0C;&#x6709;&#x5355;&#x673A;&#x7248;&#x672C;&#xFF0C;&#x6709;&#x8BE6;&#x7EC6;&#x7684;&#x6D4B;&#x8BD5;&#x62A5;&#x544A;&#xFF0C;&#x6709;&#x53CB;&#x597D;&#x7684;API&#xFF0C;&#x8FD9;&#x662F;&#x591A;&#x4E48;&#x7684;naive&#x3002; &#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x6709;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x6709;&#x5B9E;&#x4F8B;&#x6D4B;&#x8BD5;&#x6709;&#x51E0;&#x4E2A;&#xFF0C;&#x6709;&#x5C0F;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7B49;&#x6570;&#x636E;&#x96C6;&#x6D4B;&#x8BD5;&#xFF0C;&#x4E0A;&#x4EBF;&#x89C4;&#x6A21;&#x7684;&#x6570;&#x636E;&#x96C6;&#x6D4B;&#x8BD5;&#x8FC7;&#x4E86;&#x4E48;&#xFF1F;&#x505A;&#x5DE5;&#x7A0B;&#xFF0C;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x5DF2;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x638C;&#x63E1;&#x5176;&#x4E2D;&#x7684;&#x6280;&#x672F;&#x539F;&#x7406;&#xFF0C;&#x66F4;&#x8981;&#x7D27;&#x7684;&#x662F;&#x8981;&#x660E;&#x767D;&#x505A;&#x5DE5;&#x7A0B;&#x7684;&#x6001;&#x5EA6;&#xFF0C;&#x505A;&#x7CBE;&#x81F4;&#x505A;&#x7EC6;&#x8282;&#x3002;&#x8DEF;&#x8FD8;&#x6709;&#x5F88;&#x957F;&#xFF0C;&#x8E0F;&#x8E0F;&#x5B9E;&#x5B9E;&#xFF0C;&#x4E0D;&#x9A84;&#x4E0D;&#x8E81;&#xFF0C;&#x83AB;&#x8981;&#x5FC3;&#x5927;&#xFF0C;&#x4EE5;&#x6B64;&#x81EA;&#x52C9;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5728;&#x6211;&#x5199;&#x8FD9;&#x7BC7;&#x81EA;&#x7701;&#x7684;&#x535A;&#x5BA2;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x961F;&#x53CB;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x6211;&#x4EEC;&#x521D;&#x8D5B;&#x8FDB;&#x5165;&#x4E86;&#x524D;&#x5341;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x4E86;&#x5341;&#x5929;&#x7684;&#x65F6;&#x95F4;&#x8FBE;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x6548;&#x679C;&#xFF0C;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x6B23;&#x6170;&#x7684;&#x3002;&#x53E6;&#x5916;&#x8FD9;&#x4E5F;&#x7ED9;&#x6211;&#x4E00;&#x4E2A;&#x8B66;&#x9192;&#xFF0C;&#x8D81;&#x7740;&#x7B2C;&#x4E8C;&#x8D5B;&#x5B63;&#x7684;&#x5927;&#x6570;&#x636E;&#x8FD8;&#x6CA1;&#x6765;&#xFF0C;&#x65E9;&#x70B9;&#x63D0;&#x9AD8;BDALib&#x4E2D;&#x7B97;&#x6CD5;&#x7684;&#x9C81;&#x68D2;&#x6027;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5F53;&#x6211;&#x5199;&#x5206;&#x5E03;&#x5F0F;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4E0D;&#x662F;&#x5728;&#x60F3;&#x6211;&#x8981;&#x5B66;&#x4F1A;&#x7528;spark&#xFF0C;&#x4E0D;&#x662F;&#x5728;&#x60F3;&#x641E;&#x61C2;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#xFF0C;&#x6211;&#x5728;&#x60F3;&#x6211;&#x8981;&#x641E;&#x4E00;&#x4E2A;&#x201C;&#x7B80;&#x5355;&#x53EF;&#x4F9D;&#x8D56;&#x201D;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7B97;&#x6CD5;&#x5305;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/感悟/" rel="tag"># 感悟</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/11/17/spark-SQL-使用JDBC连接数据库/" rel="next" title="Spark SQL 使用JDBC连接数据库">
                <i class="fa fa-chevron-left"></i> Spark SQL 使用JDBC连接数据库
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/11/17/how-to-checkpoint/" rel="prev" title="How to Checkpoint">
                How to Checkpoint <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.png"
               alt="Li Ping" />
          <p class="site-author-name" itemprop="name">Li Ping</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">17</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">6</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Li Ping</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Muse
  </a>
</div>


        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	




  
  

  
  
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
          processEscapes: true,
          skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
        }
      });
    </script>

    <script type="text/x-mathjax-config">
      MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for (i=0; i < all.length; i += 1) {
          all[i].SourceElement().parentNode.className += ' has-jax';
        }
      });
    </script>
    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
  


  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config({"tex2jax":{"inlineMath":[["$","$"],["\\(","\\)"]],"skipTags":["script","noscript","style","textarea","pre","code"],"processEscapes":true},"TeX":{"equationNumbers":{"autoNumber":"AMS"}}});
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->


  


</body>
</html>
