<!doctype html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head>
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hello, World" />





  <link rel="alternate" href="/atom.xml" title="Dare To Think, Strive To Execute" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="google girl hackthon&amp;#x2003;&amp;#x2003;&amp;#x82B1;&amp;#x4E86;&amp;#x4E24;&amp;#x5929;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#x53C2;&amp;#x52A0;&amp;#x4E86;&amp;#x8C37;&amp;#x6B4C;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E3A;&amp;#x4E86;&amp;#x9F13;&amp;#x52B1;&amp;#x5973;&amp;#x7">
<meta property="og:type" content="article">
<meta property="og:title" content="Google Girl Hackthon">
<meta property="og:url" content="http://yoursite.com/2017/03/13/Google-Girl-Hackthon/index.html">
<meta property="og:site_name" content="Dare To Think, Strive To Execute">
<meta property="og:description" content="google girl hackthon&amp;#x2003;&amp;#x2003;&amp;#x82B1;&amp;#x4E86;&amp;#x4E24;&amp;#x5929;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#x53C2;&amp;#x52A0;&amp;#x4E86;&amp;#x8C37;&amp;#x6B4C;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E3A;&amp;#x4E86;&amp;#x9F13;&amp;#x52B1;&amp;#x5973;&amp;#x7">
<meta property="og:image" content="http://yoursite.com/images/hackthon1.jpeg">
<meta property="og:image" content="http://yoursite.com/images/hackthon2.jpeg">
<meta property="og:updated_time" content="2017-03-14T12:35:55.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Google Girl Hackthon">
<meta name="twitter:description" content="google girl hackthon&amp;#x2003;&amp;#x2003;&amp;#x82B1;&amp;#x4E86;&amp;#x4E24;&amp;#x5929;&amp;#x7684;&amp;#x65F6;&amp;#x95F4;&amp;#x53C2;&amp;#x52A0;&amp;#x4E86;&amp;#x8C37;&amp;#x6B4C;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E3A;&amp;#x4E86;&amp;#x9F13;&amp;#x52B1;&amp;#x5973;&amp;#x7">
<meta name="twitter:image" content="http://yoursite.com/images/hackthon1.jpeg">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/2017/03/13/Google-Girl-Hackthon/"/>





  <title> Google Girl Hackthon | Dare To Think, Strive To Execute </title><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <!-- hexo-inject:begin --><!-- hexo-inject:end --><div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Dare To Think, Strive To Execute</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-sitemap">
          <a href="/sitemap.xml" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-sitemap"></i> <br />
            
            Sitemap
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2017/03/13/Google-Girl-Hackthon/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="Li Ping">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/avatar.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Dare To Think, Strive To Execute">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Dare To Think, Strive To Execute" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                Google Girl Hackthon
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-03-13T18:58:10+08:00">
                2017-03-13
              </time>
            

            

            
          </span>

          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="google-girl-hackthon"><a href="#google-girl-hackthon" class="headerlink" title="google girl hackthon"></a>google girl hackthon</h2><p>&#x2003;&#x2003;&#x82B1;&#x4E86;&#x4E24;&#x5929;&#x7684;&#x65F6;&#x95F4;&#x53C2;&#x52A0;&#x4E86;&#x8C37;&#x6B4C;&#x7684;&#x4E00;&#x4E2A;&#x4E3A;&#x4E86;&#x9F13;&#x52B1;&#x5973;&#x751F;coding&#x7684;&#x7F16;&#x7A0B;&#x9A6C;&#x62C9;&#x677E;&#xFF0C;&#x611F;&#x89E6;&#x8FD8;&#x662F;&#x633A;&#x6DF1;&#x7684;&#x3002;&#x5373;&#x4F7F;&#x77E5;&#x4E4E;&#x4E0A;&#x725B;&#x4EBA;&#x518D;&#x591A;&#xFF0C;&#x624B;&#x673A;&#x4E0A;&#x5929;&#x5929;&#x90FD;&#x80FD;&#x542C;&#x5230;&#x738B;&#x5065;&#x6797;&#x9A6C;&#x4E91;&#x9F13;&#x52B1;&#x5E74;&#x8F7B;&#x4EBA;&#x7684;&#x9E21;&#x6C64;&#xFF0C;&#x5373;&#x4FBF;&#x6BCF;&#x5929;&#x516C;&#x4F17;&#x53F7;&#x5404;&#x79CD;&#x6B63;&#x80FD;&#x91CF;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x5E26;&#x7ED9;&#x6211;&#x7684;&#x89E6;&#x52A8;&#x8FDC;&#x4E0D;&#x53CA;&#x9762;&#x5BF9;&#x9762;&#x770B;&#x5230;&#x4E00;&#x7FA4;&#x667A;&#x6167;&#x4F18;&#x96C5;&#x624D;&#x534E;&#x6A2A;&#x6EA2;&#x7684;&#x5973;&#x5DE5;&#x7A0B;&#x5E08;&#x7ED9;&#x6211;&#x7684;&#x89E6;&#x52A8;&#x5927;&#x3002;</p>
<p>&#x2003;&#x2003;&#x53C2;&#x52A0;&#x8FD9;&#x4E2A;&#x7684;&#x65F6;&#x5019;&#x5355;&#x7EAF;&#x662F;&#x51B2;&#x7740;&#x8C37;&#x6B4C;&#x7684;&#x98DF;&#x5802;&#x53BB;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x5DE5;&#x4F5C;&#x4E5F;&#x627E;&#x4E86;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x5956;&#x54C1;&#x4EE5;&#x53CA;&#x5B9E;&#x4E60;&#x5BF9;&#x6211;&#x6765;&#x8BB2;&#x8981;&#x4E48;&#x6CA1;&#x6709;&#x5438;&#x5F15;&#x529B;&#x8981;&#x4E48;&#x4E5F;&#x6CA1;&#x5F88;&#x5927;&#x7684;&#x610F;&#x4E49;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x6211;&#x6536;&#x83B7;&#x4E86;&#x6BD4;&#x60F3;&#x8C61;&#x7684;&#x66F4;&#x591A;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x2003;&#x2003;&#x5148;&#x653E;&#x51E0;&#x5F20;&#x6211;&#x4EEC;&#x7684;&#x7167;&#x7247;</p>
<p><img src="/images/hackthon1.jpeg" width="400" height="300" alt="name" align="center"></p>
<p><img src="/images/hackthon2.jpeg" width="400" height="300" alt="name" align="center"></p>
<h1 id="&#x6700;&#x6709;&#x611F;&#x89E6;&#x7684;&#x8BDD;"><a href="#&#x6700;&#x6709;&#x611F;&#x89E6;&#x7684;&#x8BDD;" class="headerlink" title="&#x6700;&#x6709;&#x611F;&#x89E6;&#x7684;&#x8BDD;"></a>&#x6700;&#x6709;&#x611F;&#x89E6;&#x7684;&#x8BDD;</h1><p>&#x2003;&#x2003;&#x65F6;&#x95F4;&#x4E0D;&#x80FD;&#x5012;&#x6D41;&#xFF0C;&#x90A3;&#x4E9B;&#x5E74;&#x9519;&#x8FC7;&#x7684;&#x5927;&#x4F5C;&#x4E1A;&#xFF0C;&#x90A3;&#x4E9B;&#x5E74;&#x9519;&#x8FC7;&#x7684;Project&#xFF0C;&#x8FD8;&#x6709;&#x90A3;&#x4E9B;&#x5E74;&#x62B1;&#x8FC7;&#x7684;&#x5927;&#x817F;&#xFF0C;&#x60F3;&#x60F3;&#x5F53;&#x5E74;&#x81EA;&#x5DF1;&#x7684;&#x8868;&#x73B0;&#x771F;&#x5B9E;&#x7F9E;&#x6127;&#x3002;&#x6211;&#x4E0D;&#x592A;&#x6E05;&#x695A;&#x540C;&#x6837;&#x53C2;&#x52A0;&#x8FD9;&#x4E2A;&#x6D3B;&#x52A8;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x4EC0;&#x4E48;&#x611F;&#x53D7;&#xFF0C;&#x4F46;&#x662F;&#x542C;&#x4E86;&#x51E0;&#x4E2A;&#x5973;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x771F;&#x662F;&#x975E;&#x5E38;&#x89E6;&#x52A8;&#x3002;&#x5176;&#x4E2D;&#x6700;&#x8BA9;&#x6211;&#x96BE;&#x5FD8;&#x4E5F;&#x662F;&#x6700;&#x8BA9;&#x6211;&#x6DF1;&#x601D;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x662F;</p>
<blockquote>
<p>&#x4E0D;&#x8981;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x5973;&#x5B69;&#x770B;<br>&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x5973;&#x5B69;&#x770B;</p>
</blockquote>
<p>&#x2003;&#x2003;&#x6240;&#x8C13;&#x201C;&#x4E0D;&#x8981;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x5973;&#x5B69;&#x770B;&#x201D;&#x662F;&#x8BF4;&#x4E0D;&#x8981;&#x603B;&#x7528;&#x4F4E;&#x6807;&#x51C6;&#x6765;&#x8981;&#x6C42;&#x81EA;&#x5DF1;&#xFF0C;&#x6211;&#x5927;&#x5B66;&#x671F;&#x95F4;&#x4E0D;&#x4E4F;&#x6210;&#x7EE9;&#x4F18;&#x5F02;&#x7684;&#x5973;&#x540C;&#x5B66;&#xFF0C;&#x4F46;&#x662F;&#x8BF4;&#x5230;&#x52A8;&#x624B;&#x80FD;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x90FD;&#x4E0D;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x800C;&#x4E14;&#x957F;&#x671F;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5373;&#x4F7F;&#x662F;&#x52A8;&#x624B;&#x5728;&#x5973;&#x751F;&#x4E2D;&#x4E5F;&#x4E0D;&#x5DEE;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x6CA1;&#x6709;&#x52A8;&#x529B;&#x8D85;&#x8D8A;&#x81EA;&#x5DF1;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6280;&#x672F;&#x4E0A;&#x8FDB;&#x6B65;&#x975E;&#x5E38;&#x7F13;&#x6162;&#xFF0C;&#x751A;&#x81F3;&#x5F88;&#x591A;&#x5230;&#x4E86;&#x6700;&#x540E;&#x5C31;&#x81EA;&#x66B4;&#x81EA;&#x5F03;&#x4E86;&#x3002;&#x800C;&#x6211;&#x6CA1;&#x6709;&#x653E;&#x5F03;&#x80AF;&#x5B9A;&#x662F;&#x56E0;&#x4E3A;&#x65E2;&#x6CA1;&#x6709;&#x9000;&#x8DEF;&#x53C8;&#x6CA1;&#x6709;&#x4F9D;&#x9760;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6709;&#x4E00;&#x4E2A;&#x7F8E;&#x5973;&#x5DE5;&#x7A0B;&#x5E08;&#x4E5F;&#x8BB2;&#x5230;&#x5F53;&#x81EA;&#x5DF1;&#x7855;&#x58EB;&#x9636;&#x6BB5;&#x4E0D;&#x662F;&#x5408;&#x4F5C;&#x5199;&#x5927;&#x4F5C;&#x4E1A;&#x800C;&#x662F;&#x9700;&#x8981;&#x72EC;&#x7ACB;&#x5B8C;&#x6210;project&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x81EA;&#x5DF1;&#x72EC;&#x7ACB;&#x80FD;handle&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x73B0;&#x539F;&#x6765;&#x5199;&#x4EE3;&#x7801;&#x4EC0;&#x4E48;&#x7684;&#x4E5F;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x96BE;&#x561B;&#xFF0C;&#x81EA;&#x5DF1;&#x5176;&#x5B9E;&#x6BD4;&#x60F3;&#x8C61;&#x7684;&#x80FD;&#x5E72;&#x5F88;&#x591A;&#x3002;&#x5F53;&#x81EA;&#x5DF1;&#x603B;&#x662F;&#x6709;&#x5F88;&#x591A;&#x9000;&#x8DEF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C24;&#x5176;&#x90A3;&#x4E9B;&#x9000;&#x8DEF;&#x90A3;&#x4E48;&#x663E;&#x800C;&#x6613;&#x89C1;&#xFF0C;&#x4E00;&#x65E6;&#x5B66;&#x4F1A;&#x4E86;&#x62FF;&#x90A3;&#x4E9B;&#x201C;&#x5973;&#x751F;&#x5DE5;&#x7A0B;&#x4E0D;&#x884C;&#x201D;&#x7684;&#x5957;&#x8DEF;&#x4E3A;&#x81EA;&#x5DF1;&#x5F00;&#x8131;&#xFF0C;&#x6162;&#x6162;&#x5C31;&#x6D88;&#x78E8;&#x4E86;&#x514B;&#x670D;&#x56F0;&#x96BE;&#x7684;&#x52A8;&#x529B;&#x3002;&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#xFF0C;&#x6211;&#x52AA;&#x529B;&#x514B;&#x670D;&#x7740;&#x81EA;&#x5DF1;&#x8EAB;&#x4E0A;&#x7684;&#x574F;&#x6BDB;&#x75C5;&#xFF0C;&#x4E00;&#x6B65;&#x6B65;&#x5C3D;&#x529B;&#x6210;&#x4E3A;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x7684;&#x6837;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x81EA;&#x8BA4;&#x4E3A;&#x6CA1;&#x6709;&#x5929;&#x8D4B;&#xFF0C;&#x6CA1;&#x6709;&#x624D;&#x534E;&#xFF0C;&#x751A;&#x81F3;&#x4E5F;&#x4E0D;&#x591F;&#x806A;&#x660E;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x7F16;&#x7A0B;&#x6211;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x5165;&#x9053;&#xFF0C;&#x975E;&#x5E38;&#x7684;&#x6CAE;&#x4E27;&#xFF0C;&#x5018;&#x82E5;&#x6709;&#x9000;&#x8DEF;&#x548C;&#x5176;&#x4ED6;&#x9009;&#x62E9;&#x6211;&#x80AF;&#x5B9A;&#x4E5F;&#x65E9;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#x3002;&#x539F;&#x672C;&#x5F88;&#x591A;&#x6280;&#x80FD;&#x7684;&#x83B7;&#x5F97;&#x90FD;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x8F7B;&#x677E;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x73B0;&#x5728;&#x60F3;&#x60F3;&#x652F;&#x6301;&#x6211;&#x8D70;&#x8FC7;&#x5F88;&#x591A;&#x56F0;&#x5883;&#x7684;&#x4E5F;&#x4E0D;&#x8FC7;&#x662F;&#x65E0;&#x4EBA;&#x53EF;&#x4F9D;&#x65F6;&#x7684;&#x987D;&#x5F3A;&#x3002;&#x4E0D;&#x903C;&#x81EA;&#x5DF1;&#x4E00;&#x628A;&#xFF0C;&#x6211;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x539F;&#x6765;&#x53EF;&#x4EE5;&#x4E00;&#x76F4;&#x8D70;&#x8FD9;&#x4E48;&#x8FDC;&#xFF0C;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x6211;&#x514B;&#x670D;&#x4E86;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x6000;&#x7591;&#x4EE5;&#x53CA;&#x5BF9;&#x5DE5;&#x7A0B;&#x7684;&#x6050;&#x60E7;&#x3002;</p>
<p>&#x2003;&#x2003;&#x6240;&#x8C13;&#x201C;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x4E2A;&#x5973;&#x5B69;&#x201D;&#x662F;&#x8BF4;&#x8981;&#x53D1;&#x6325;&#x597D;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x6C14;&#x8D28;&#x8FD8;&#x662F;&#x98CE;&#x683C;&#xFF0C;&#x5973;&#x751F;&#x786E;&#x5B9E;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x5018;&#x82E5;&#x4E00;&#x4E2A;&#x4EBA;&#x5916;&#x5728;&#x4E3E;&#x6B62;&#x6295;&#x8DB3;&#x4F18;&#x96C5;&#x5927;&#x65B9;&#xFF0C;&#x58F0;&#x97F3;&#x60A6;&#x8033;&#x8868;&#x60C5;&#x81EA;&#x4FE1;&#xFF0C;&#x5FC3;&#x601D;&#x4F53;&#x8D34;&#x7EC6;&#x817B;&#xFF0C;&#x6027;&#x683C;&#x5F00;&#x6717;&#x5E7D;&#x9ED8;&#xFF0C;&#x6709;&#x60F3;&#x6CD5;&#xFF0C;&#x6709;&#x80FD;&#x529B;&#xFF0C;&#x6709;&#x89C1;&#x8BC6;&#xFF0C;&#x8BBA;&#x8C01;&#x8DDF;&#x5979;&#x6253;&#x4EA4;&#x9053;&#x90FD;&#x4F1A;&#x5982;&#x6C90;&#x6625;&#x98CE;&#x7684;&#x5427;&#xFF1F;&#x5F53;&#x6211;&#x8D8A;&#x6765;&#x8D8A;&#x610F;&#x8BC6;&#x5230;&#x4F18;&#x79C0;&#x7684;&#x591A;&#x5143;&#x4EE5;&#x540E;&#xFF0C;&#x4E5F;&#x6108;&#x53D1;&#x4F53;&#x4F1A;&#x5230;&#x8FD9;&#x4E9B;&#x8F6F;&#x5B9E;&#x529B;&#x7684;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x2003;&#x2003;&#x60F3;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x60F3;&#x505A;&#x6210;&#x5B83;&#x7684;&#x613F;&#x671B;&#xFF0C;&#x800C;&#x60F3;&#x505A;&#x597D;&#x4E00;&#x4EF6;&#x4E8B;&#x5219;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7ED9;&#x81EA;&#x5DF1;&#x9884;&#x8BBE;&#x7684;&#x6807;&#x51C6;&#x3002;&#x4E00;&#x76F4;&#x90FD;&#x5F88;&#x559C;&#x6B22;&#x90A3;&#x53E5;&#x8BDD;&#xFF0C;&#x201D;&#x6C42;&#x4E8E;&#x4E0A;&#x8005;&#x5F97;&#x4E8E;&#x4E2D;&#xFF0C;&#x6C42;&#x4E8E;&#x4E2D;&#x8005;&#x5F97;&#x4E8E;&#x4E0B;&#x201D;&#x3002;</p>
<ul>
<li>&#x6807;&#x51C6;&#x8DDF;&#x81EA;&#x5DF1;&#x7684;&#x89C6;&#x91CE;&#xFF0C;&#x89C2;&#x5FF5;&#x4EE5;&#x53CA;&#x81EA;&#x4FE1;&#x621A;&#x621A;&#x76F8;&#x5173;&#xFF0C;&#x6807;&#x51C6;&#x600E;&#x4E48;&#x4E5F;&#x4E0D;&#x4F1A;&#x9AD8;&#x4E8E;&#x699C;&#x6837;&#xFF0C;&#x6709;&#x51E0;&#x4E2A;&#x4EBA;&#x80FD;&#x53D8;&#x5F97;&#x6BD4;&#x81EA;&#x5DF1;&#x7684;&#x699C;&#x6837;&#x8FD8;&#x597D;&#x5462;&#xFF1F;&#x800C;&#x4E14;&#x9762;&#x5BF9;&#x9762;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x8DDF;&#x81EA;&#x5DF1;&#x6709;&#x76F8;&#x540C;&#x7ECF;&#x5386;&#x7684;&#x4EBA;&#x987F;&#x65F6;&#x5C31;&#x6709;&#x4E86;&#x699C;&#x6837;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x6B21;&#x6D3B;&#x52A8;&#x5C31;&#x8BA9;&#x6211;&#x610F;&#x8BC6;&#x5230;&#x539F;&#x6765;&#x5973;&#x5DE5;&#x7A0B;&#x5E08;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x4F18;&#x79C0;&#x5982;&#x6B64;&#x800C;&#x4E14;&#x4EBA;&#x6570;&#x4E0D;&#x5C11;&#xFF1B;&#x81F3;&#x4E8E;&#x89C2;&#x5FF5;&#xFF0C;&#x5018;&#x82E5;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x88AB;&#x90A3;&#x53E5;&#x201C;&#x7537;&#x5DE5;&#x7A0B;&#x5E08;&#x5C31;&#x662F;&#x6BD4;&#x5973;&#x7A0B;&#x5E8F;&#x5458;&#x4F18;&#x79C0;&#x201D;&#x5F71;&#x54CD;&#xFF0C;&#x6211;&#x5E94;&#x8BE5;&#x4E5F;&#x4F1A;&#x4EE5;&#x66F4;&#x9AD8;&#x7684;&#x6807;&#x51C6;&#x8981;&#x6C42;&#x81EA;&#x5DF1;&#xFF0C;&#x518D;&#x8BF4;&#x81EA;&#x4FE1;&#xFF0C;&#x81EA;&#x4FE1;&#x662F;&#x81EA;&#x5DF1;&#x5728;&#x81EA;&#x5DF1;&#x89C1;&#x8BC6;&#x591A;&#x4E86;&#x4F18;&#x79C0;&#x4E14;&#x6392;&#x9664;&#x4E86;&#x65E0;&#x5173;&#x6742;&#x5FF5;&#x540E;&#x4E00;&#x6B65;&#x6B65;&#x4ECE;&#x5FC3;&#x5E95;&#x91CC;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x8BA4;&#x540C;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4E3B;&#x52A8;&#x627F;&#x62C5;&#x8D23;&#x4EFB;&#x4E5F;&#x5BB9;&#x6613;&#x8BA9;&#x81EA;&#x5DF1;&#x63D0;&#x9AD8;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x56E0;&#x4E3A;&#x8F9C;&#x8D1F;&#x81EA;&#x5DF1;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x8F9C;&#x8D1F;&#x522B;&#x4EBA;&#x5F88;&#x4E0D;&#x597D;&#x610F;&#x601D;&#xFF0C;&#x5F53;&#x7136;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x8FD8;&#x4E0D;&#x591F;&#x4E0D;&#x8981;&#x8138;&#x3002;&#x5BF9;&#x4E8E;&#x6807;&#x51C6;&#x7684;&#x611F;&#x53D7;&#x7B80;&#x76F4;&#x4E0D;&#x8981;&#x66F4;&#x591A;&#xFF0C;&#x5927;&#x5B66;&#x6211;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x5973;&#x751F;&#x4E2D;&#x611F;&#x89C9;&#x826F;&#x597D;&#xFF0C;&#x6446;&#x8131;&#x4E0D;&#x4E86;&#x6027;&#x522B;&#x8D28;&#x7591;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x73ED;&#x4E0A;&#x5927;&#x817F;&#x7ED9;&#x6211;&#x7559;&#x4E86;&#x4E0D;&#x5C11;&#x540E;&#x8DEF;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x800C;&#x518D;&#x5730;&#x964D;&#x4F4E;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x8981;&#x6C42;&#x3002;</li>
<li><p>&#x9898;&#x5916;&#x8BDD;&#x662F;&#x60F3;&#x8D77;&#x4E86;&#x66FE;&#x7ECF;&#x4E00;&#x4E2A;&#x5E08;&#x5F1F;&#x8BF4;&#x7684;&#x4E00;&#x53E5;&#x8BDD;</p>
<blockquote>
<p>&#x60F3;&#x9003;&#x907F;&#x7684;&#x4E8B;&#xFF0C;&#x7EC8;&#x7A76;&#x662F;&#x8981;&#x9762;&#x5BF9;&#x548C;&#x89E3;&#x51B3;&#x7684;<br>&#x6211;&#x60F3;&#x8BF4;&#xFF0C;&#x53EF;&#x80FD;&#x72AF;&#x7684;&#x9519;&#x8BEF;&#x65E9;&#x665A;&#x90FD;&#x4F1A;&#x72AF;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x72AF;&#x9519;&#x4E5F;&#x8981;&#x8D81;&#x65E9;<br>&#x6BD5;&#x7ADF;&#x8D8A;&#x665A;&#x65F6;&#x95F4;&#x6210;&#x672C;&#x8D8A;&#x9AD8;<br>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x6B20;&#x4E0B;&#x7684;&#x90FD;&#x4F1A;&#x8FD8;&#x7684;</p>
</blockquote>
</li>
<li><p>&#x518D;&#x8BF4;&#x52AA;&#x529B;&#xFF0C;&#x6211;&#x5F53;&#x7136;&#x4E0D;&#x662F;&#x552F;&#x5FC3;&#x4E3B;&#x4E49;&#x8005;&#xFF0C;&#x4F46;&#x662F;&#x201C;&#x5FF5;&#x5FF5;&#x4E0D;&#x5FD8;&#xFF0C;&#x5FC5;&#x6709;&#x56DE;&#x54CD;&#x201D;&#x7684;&#x611F;&#x53D7;&#x6211;&#x8FD8;&#x662F;&#x633A;&#x8BA4;&#x540C;&#x7684;&#xFF0C;&#x6211;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x5927;&#x90E8;&#x5206;&#x7684;&#x61C8;&#x6020;&#x90FD;&#x53D1;&#x751F;&#x5728;&#x81EA;&#x5DF1;&#x6CA1;&#x90A3;&#x4E48;&#x5F3A;&#x70C8;&#x505A;&#x7684;&#x613F;&#x671B;&#x6216;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x6709;&#x6240;&#x6000;&#x7591;&#x6216;&#x8005;&#x6709;&#x7740;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x9000;&#x8DEF;&#x7684;&#x65F6;&#x5019;&#x3002;&#x4E0D;&#x8FC7;&#x5F3A;&#x70C8;&#x505A;&#x6210;&#x4E00;&#x4EF6;&#x4E8B;&#x7684;&#x613F;&#x671B;&#x4E5F;&#x4F1A;&#x8DDF;&#x4E0E;&#x8FD9;&#x4EF6;&#x4E8B;&#x76F8;&#x9047;&#x7684;&#x60C5;&#x666F;&#x6709;&#x5173;&#xFF0C;&#x5F53;&#x7136;&#x60C5;&#x666F;&#x662F;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EE5;&#x524D;&#x542C;&#x4E86;&#x90A3;&#x4E48;&#x591A;word2vector&#x90FD;&#x4E0D;&#x4E3A;&#x6240;&#x52A8;&#xFF0C;&#x5F53;&#x6211;&#x4EB2;&#x773C;&#x89C1;&#x5230;&#x5B83;&#x4EE4;&#x4EBA;&#x9707;&#x64BC;&#x7684;&#x6A21;&#x578B;&#x6548;&#x679C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4F1A;&#x60C5;&#x4E0D;&#x81EA;&#x7981;&#x60F3;&#x53BB;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x5B83;&#x3002;</p>
</li>
</ul>
<p>&#x2003;&#x2003;&#x8FD9;&#x6B21;&#x6D3B;&#x52A8;&#x867D;&#x7136;&#x53EA;&#x5728;&#x8C37;&#x6B4C;&#x5403;&#x4E86;&#x4E00;&#x987F;&#x996D;&#xFF0C;&#x4F46;&#x662F;&#x4ECD;&#x7136;&#x5F88;&#x611F;&#x6FC0;&#x8FD9;&#x4E48;&#x6709;&#x60C5;&#x6000;&#x7684;&#x516C;&#x53F8;&#x3002;&#x6240;&#x8C13;&#x201C;&#x7A77;&#x5219;&#x72EC;&#x5584;&#x5176;&#x8EAB;&#xFF0C;&#x8FBE;&#x5219;&#x517C;&#x6D4E;&#x5929;&#x4E0B;&#x201D;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#x9053;&#x7406;&#x7684;&#xFF0C;&#x770B;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x7684;&#x5BF9;&#x4EBA;&#x624D;&#x7684;&#x6001;&#x5EA6;&#x770B;&#x5176;&#x60C5;&#x6000;&#x8FD8;&#x662F;&#x6709;&#x9053;&#x7406;&#x7684;&#x3002;&#x867D;&#x7136;&#x538B;&#x69A8;&#x5458;&#x5DE5;&#x662F;&#x8D44;&#x672C;&#x4E3B;&#x4E49;&#x7684;&#x5929;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x517C;&#x6D4E;&#x5929;&#x4E0B;&#x7684;&#x516C;&#x53F8;&#x60F3;&#x5FC5;&#x5BF9;&#x81EA;&#x5DF1;&#x5458;&#x5DE5;&#x7684;&#x53D1;&#x5C55;&#x8003;&#x8651;&#x7684;&#x4E5F;&#x4E0D;&#x4F1A;&#x5C11;&#x3002;&#x6069;&#xFF0C;&#x6CA1;&#x9519;&#x6211;&#x5C31;&#x662F;&#x5728;&#x89E3;&#x91CA;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x613F;&#x610F;&#x53BB;&#x5FAE;&#x8F6F;&#xFF0C;&#x5E0C;&#x671B;&#x5230;&#x65F6;&#x5019;&#x6211;&#x4E5F;&#x80FD;&#x9047;&#x5230;&#x4E00;&#x5E2E;&#x5F88;&#x4F18;&#x79C0;&#x7684;&#x540C;&#x4E8B;&#x3002;</p>
<h2 id="&#x6536;&#x83B7;"><a href="#&#x6536;&#x83B7;" class="headerlink" title="&#x6536;&#x83B7;"></a>&#x6536;&#x83B7;</h2><p>&#x2003;&#x2003;&#x6536;&#x83B7;&#x4E3B;&#x8981;&#x6709;&#x4E8C;</p>
<ul>
<li><p>&#x81EA;&#x5DF1;&#x9047;&#x5230;&#x7684;&#x56F0;&#x96BE;&#x5F88;&#x591A;&#x4EBA;&#x4E5F;&#x90FD;&#x9047;&#x5230;&#x8FC7;&#xFF0C;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x7684;&#x8D28;&#x7591;&#x4EE5;&#x53CA;&#x56F0;&#x60D1;&#x5F88;&#x591A;&#x4EBA;&#x4E5F;&#x7ECF;&#x5386;&#x8FC7;&#xFF0C;&#x770B;&#x5230;&#x90A3;&#x4E48;&#x591A;&#x59B9;&#x5B50;&#x95EE;&#x7740;&#x56F0;&#x6270;&#x6211;&#x5F53;&#x5E74;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6211;&#x5FC3;&#x91CC;&#x4E5F;&#x662F;&#x611F;&#x6168;&#x4E07;&#x5343;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5F53;&#x6211;&#x542C;&#x5230;&#x4E00;&#x4E2A;&#x5E08;&#x59B9;&#x95EE;&#x600E;&#x4E48;&#x63D0;&#x9AD8;&#x7F16;&#x7A0B;&#x80FD;&#x529B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4E0D;&#x7981;&#x54D1;&#x7136;&#x5931;&#x7B11;&#xFF0C;&#x6069;&#x6069;&#xFF0C;&#x6211;&#x4EFF;&#x4F5B;&#x770B;&#x5230;&#x4E86;&#x5F53;&#x5E74;&#x6211;&#x4E00;&#x8138;&#x8654;&#x8BDA;&#x8BF7;&#x6559;&#x5E08;&#x5144;&#x5E08;&#x59D0;&#x7684;&#x6837;&#x5B50;&#x3002;&#x6709;&#x4E2A;&#x5E08;&#x59D0;&#x8BF4;&#x5E94;&#x8BE5;&#x770B;&#x4EC0;&#x4E48;&#x4E66;&#xFF0C;&#x800C;&#x6211;&#x5FC3;&#x91CC;&#x5728;&#x60F3;&#x5176;&#x5B9E;&#x5F88;&#x591A;&#x59B9;&#x5B50;&#x5B66;&#x4E60;&#x975E;&#x5E38;&#x523B;&#x82E6;&#xFF0C;&#x666E;&#x904D;&#x90FD;&#x662F;&#x7F3A;&#x4E4F;&#x9762;&#x5BF9;&#x56F0;&#x96BE;&#x7684;&#x52C7;&#x6C14;&#x548C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x51B3;&#x5FC3;&#xFF0C;&#x4F46;&#x51E1;&#x903C;&#x7740;&#x81EA;&#x5DF1;&#x6709;&#x8FC7;&#x4E00;&#x4E24;&#x6B21;&#x7ECF;&#x5386;&#x8FD9;&#x4E9B;&#x90FD;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#x4E86;&#x3002;</p>
</li>
<li><p>&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x7F3A;&#x61BE;&#x8DDF;&#x80FD;&#x529B;&#x6709;&#x4E86;&#x66F4;&#x52A0;&#x6E05;&#x9192;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x7406;&#x6027;&#x6709;&#x4F59;&#xFF0C;&#x611F;&#x6027;&#x4E0D;&#x8DB3;&#xFF0C;&#x4E25;&#x8C28;&#x4F46;&#x4E0D;&#x591F;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x5F88;&#x6B23;&#x8D4F;&#x6709;&#x8DA3;&#x7684;&#x4EBA;&#xFF1B;</p>
</li>
<li>&#x4EB2;&#x8EAB;&#x611F;&#x53D7;&#x4E86;&#x591A;&#x7EF4;&#x7684;&#x4F18;&#x79C0;&#xFF0C;&#x73B0;&#x5728;&#x73AF;&#x5883;&#x6BD5;&#x7ADF;&#x7B80;&#x5355;&#xFF0C;&#x6211;&#x9876;&#x591A;&#x4F1A;&#x89C9;&#x5F97;&#x4E00;&#x4E2A;&#x4EBA;&#x4EE3;&#x7801;&#x5199;&#x7684;&#x597D;&#x4F69;&#x670D;&#xFF0C;&#x8BBA;&#x6587;&#x53D1;&#x7684;&#x591A;&#x53D1;&#x7684;&#x725B;&#x94A6;&#x4F69;&#xFF0C;&#x4E3A;&#x4EBA;&#x505A;&#x4E8B;&#x597D;&#x8BA9;&#x4EBA;&#x7FA1;&#x6155;&#xFF1B;&#x5F53;&#x6211;&#x770B;&#x5230;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#x59B9;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5DE5;&#x7A0B;&#x5E08;&#x8FD8;&#x662F;&#x8DDF;&#x6211;&#x4E00;&#x6837;&#x7684;&#x53C2;&#x52A0;&#x6D3B;&#x52A8;&#x7684;&#x7AE5;&#x978B;&#xFF0C;&#x6211;&#x610F;&#x8BC6;&#x5230;&#x5979;&#x4EEC;&#x7684;&#x4F18;&#x79C0;&#x662F;&#x90A3;&#x4E48;&#x591A;&#x5143;&#x3002;&#x6709;&#x7684;&#x662F;&#x5E74;&#x7EAA;&#x8F7B;&#x8F7B;&#x5BF9;&#x81EA;&#x5DF1;&#x672A;&#x6765;&#x90A3;&#x4E48;&#x575A;&#x5B9A;&#x90A3;&#x4E48;&#x6709;&#x68A6;&#x60F3;&#xFF0C;&#x6709;&#x7684;&#x8868;&#x8FBE;&#x81EA;&#x5982;&#x8C08;&#x7B11;&#x98CE;&#x751F;&#xFF0C;&#x6709;&#x7684;&#x662F;&#x624D;&#x534E;&#x6A2A;&#x6EA2;&#x80FD;&#x529B;&#x8D85;&#x7FA4;&#xFF0C;&#x6709;&#x7684;&#x5973;&#x5B69;&#x662F;&#x63D0;&#x95EE;&#x9898;&#x4E00;&#x9488;&#x89C1;&#x8840;&#x5C16;&#x9510;&#x6709;&#x6DF1;&#x5EA6;&#xFF0C;&#x6709;&#x7684;&#x601D;&#x7EF4;&#x7F1C;&#x5BC6;&#x8BA4;&#x771F;&#x8D1F;&#x8D23;&#xFF0C;&#x6709;&#x7684;&#x59B9;&#x5B50;&#x98CE;&#x8DA3;&#x5E7D;&#x9ED8;&#xFF0C;&#x505A;&#x5C55;&#x793A;&#x975E;&#x5E38;&#x6709;&#x611F;&#x67D3;&#x529B;&#xFF0C;&#x6709;&#x7684;&#x7EC6;&#x817B;&#x6E29;&#x5A49;&#x751F;&#x6D3B;&#x7CBE;&#x81F4;&#xFF0C;&#x8FD8;&#x6709;&#x7684;&#x82F1;&#x8BED;&#x4E00;&#x7EA7;&#x68D2;&#x3002;</li>
</ul>
<h2 id="&#x53CD;&#x601D;"><a href="#&#x53CD;&#x601D;" class="headerlink" title="&#x53CD;&#x601D;"></a>&#x53CD;&#x601D;</h2><p>&#x2003;&#x2003;&#x8BF4;&#x5B8C;&#x4E86;&#x611F;&#x53D7;&#xFF0C;&#x518D;&#x8BF4;&#x4E00;&#x8BF4;&#x81EA;&#x5DF1;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x53CD;&#x601D;&#x3002;</p>
<ul>
<li>&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6446;&#x8131;&#x4E0D;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x504F;&#x89C1;&#xFF0C;&#x89C9;&#x5F97;&#x6280;&#x672F;&#x725B;&#x624D;&#x503C;&#x5F97;&#x94A6;&#x4F69;&#x3002;&#x8FD9;&#x4E2A;&#x6211;&#x6628;&#x665A;&#x4E5F;&#x8DDF;&#x5BA4;&#x53CB;&#x63A2;&#x8BA8;&#x8FC7;&#xFF0C;&#x6280;&#x672F;&#x725B;&#x5F53;&#x7136;&#x503C;&#x5F97;&#x94A6;&#x4F69;&#xFF0C;&#x4F46;&#x662F;&#x6280;&#x672F;&#x4EC5;&#x4EC5;&#x662F;&#x63A8;&#x52A8;&#x793E;&#x4F1A;&#x524D;&#x8FDB;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x529B;&#x91CF;&#xFF0C;&#x8131;&#x79BB;&#x4E86;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#x8FD0;&#x8425;&#x7B49;&#x5176;&#x5F71;&#x54CD;&#x529B;&#x5341;&#x5206;&#x6709;&#x9650;&#x3002;&#x60F3;&#x8D77;&#x6765;&#x9AD8;&#x4E2D;&#x4EE5;&#x524D;&#x7684;&#x81EA;&#x5DF1;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5728;&#x81EA;&#x5DF1;&#x6267;&#x7740;&#x8FFD;&#x9010;&#x5206;&#x6570;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x7F3A;&#x4E4F;&#x4E86;&#x5BF9;&#x5176;&#x4ED6;&#x7D20;&#x517B;&#x7684;&#x9274;&#x522B;&#x4E0E;&#x6B23;&#x8D4F;&#x3002;</li>
<li>&#x505A;&#x8FC7;presentation&#x8D8A;&#x591A;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x4E86;&#x89E3;&#x5230;&#x8868;&#x73B0;&#x80FD;&#x529B;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x4E0D;&#x7F3A;&#x628A;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x8868;&#x8FBE;&#x6E05;&#x695A;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x662F;&#x81EA;&#x5DF1;&#x5F88;&#x7F3A;&#x8868;&#x73B0;&#x529B;&#x8DDF;&#x611F;&#x67D3;&#x529B;&#x3002;&#x4FE1;&#x606F;&#x4F20;&#x9012;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x56E0;&#x4E3A;&#x8868;&#x73B0;&#x529B;&#x8DDF;&#x611F;&#x67D3;&#x529B;&#x4E0D;&#x4F73;&#x5BFC;&#x81F4;&#x5F88;&#x591A;&#x4FE1;&#x606F;&#x4E22;&#x5931;&#xFF0C;&#x60F3;&#x8C61;&#x4E0B;&#x81EA;&#x5DF1;&#x7ECF;&#x5E38;&#x4F5C;&#x4E3A;&#x53F0;&#x4E0B;&#x7684;&#x89C2;&#x4F17;&#x542C;&#x6F14;&#x8BB2;&#x7684;&#x72B6;&#x6001;&#x540E;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x60C5;&#x4E0D;&#x81EA;&#x7981;&#x5730;&#x7B11;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x76F8;&#x6BD4;&#x4E8E;&#x4E00;&#x672C;&#x6B63;&#x7ECF;&#x7684;&#x5B66;&#x7A76;&#x5F53;&#x7136;&#x8FD8;&#x662F;&#x6BB5;&#x5B50;&#x624B;&#x66F4;&#x6709;&#x770B;&#x70B9;&#x5440;&#x3002;</li>
<li>&#x7406;&#x6027;&#x6709;&#x4F59;&#xFF0C;&#x611F;&#x6027;&#x4E0D;&#x8DB3;&#x3002;&#x6000;&#x7591;&#x81EA;&#x5DF1;&#x662F;&#x4E0D;&#x662F;&#x5F88;&#x5446;&#x677F;&#x4E4F;&#x5473;&#x3002;</li>
</ul>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>&#x2003;&#x2003;&#x90FD;&#x662F;&#x8001;&#x751F;&#x957F;&#x8C08;&#xFF0C;&#x8BF4;&#x4E0D;&#x4E0A;&#x610F;&#x8BC6;&#x5230;&#x4E86;&#x95EE;&#x9898;&#x5C31;&#x80FD;&#x6539;&#x7684;&#x5F88;&#x5F7B;&#x5E95;&#xFF0C;&#x597D;&#x6B79;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x603B;&#x7ED3;&#xFF0C;&#x6211;&#x5F88;&#x5F00;&#x5FC3;&#x81EA;&#x5DF1;&#x80FD;&#x5728;&#x5165;&#x804C;&#x4E4B;&#x524D;&#x601D;&#x8003;&#x4E86;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5199;&#x51FA;&#x6765;&#x4E00;&#x662F;&#x4E3A;&#x4E86;&#x7EAA;&#x5FF5;&#xFF0C;&#x4E8C;&#x662F;&#x6574;&#x7406;&#x4E0B;&#x601D;&#x8DEF;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x54EA;&#x5929;&#x81EA;&#x5DF1;&#x770B;&#x7684;&#x4E5F;&#x4E3A;&#x50CF;&#x674E;&#x552F;&#x5E08;&#x59D0;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x89C9;&#x5F97;&#x5F53;&#x521D;&#x7684;&#x81EA;&#x5DF1;&#x90A3;&#x4E48;&#x50BB;&#x90A3;&#x4E48;&#x6709;&#x610F;&#x601D;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/12/06/NMF实现/" rel="next" title="Nonnegative Matrix Factorization(NMF)实现">
                <i class="fa fa-chevron-left"></i> Nonnegative Matrix Factorization(NMF)实现
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.png"
               alt="Li Ping" />
          <p class="site-author-name" itemprop="name">Li Ping</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">22</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">9</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#google-girl-hackthon"><span class="nav-number">1.</span> <span class="nav-text">google girl hackthon</span></a></li></ol></li><li class="nav-item nav-level-1"><a class="nav-link" href="#最有感触的话"><span class="nav-number"></span> <span class="nav-text">最有感触的话</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#收获"><span class="nav-number">1.</span> <span class="nav-text">收获</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#反思"><span class="nav-number">2.</span> <span class="nav-text">反思</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#总结"><span class="nav-number">3.</span> <span class="nav-text">总结</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Li Ping</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Muse
  </a>
</div>


        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	




  
  

  
  
    <script type="text/x-mathjax-config">
      MathJax.Hub.Config({
        tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
          processEscapes: true,
          skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
        }
      });
    </script>

    <script type="text/x-mathjax-config">
      MathJax.Hub.Queue(function() {
        var all = MathJax.Hub.getAllJax(), i;
        for (i=0; i < all.length; i += 1) {
          all[i].SourceElement().parentNode.className += ' has-jax';
        }
      });
    </script>
    <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
  


  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config({"tex2jax":{"inlineMath":[["$","$"],["\\(","\\)"]],"skipTags":["script","noscript","style","textarea","pre","code"],"processEscapes":true},"TeX":{"equationNumbers":{"autoNumber":"AMS"}}});
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->


  


</body>
</html>
